[{"type": "heading", "level": 4, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 3, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF KAPCHORWA SUAM KITALE AND ELDORET BYPASS ROADS PROJECT (UGANDA)", "page": 0}, {"type": "paragraph", "content": "FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2019", "page": 0}, {"type": "heading", "level": 1, "content": "OFFICE OF THE AUDITOR GENERAL UGANDA", "page": 0}, {"type": "heading", "level": 1, "content": "TABLE OF CONTENTS", "page": 1}, {"type": "tableOfContent", "content": ["Opinion - 2", "Basis for Opinion - 2", "Key Audit Matters - 2", "Delayed payment to Project Affected People (PAPs) - 3", "Non-Compliance with Contractual Obligations: Civil Works - 3", "Implemented Designs - 4", "Emphasis of Matter - 4", "Other Information - 5", "Management’s Responsibility for the Financial Statements - 5", "Auditor’s Responsibilities for the Audit of the Financial Statements - 6", "Other Regulatory and Reporting Requirements - 7", "Compliance with the Provisions of the Loan Agreement and Contractual Obligations - 7", "GOU Counterpart Funding - 8", "Internal Controls Relevant to Preparation of PFSs - 8", "APPENDIX I - 9", "FINANCIAL STATEMENTS - 9"], "page": 1}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF KAPCHORWA SUAM KITALE AND ELDORET BYPASS ROADS PROJECT, PROJECT ID NO.P-ZI-DB0-107, ADB LOAN NO. 2000200001051 AND ADF LOAN NO. 2100150037299 FOR THE YEAR ENDED 30TH JUNE, 2019", "page": 2}, {"type": "heading", "level": 1, "content": "THE RT. HON. SPEAKER OF PARLIAMENT", "page": 2}, {"type": "heading", "level": 1, "content": "Opinion", "page": 2}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Kapchorwa Suam and Eldoret Bypass Roads Project implemented by Uganda National Roads Authority for the year ended 30 th June 2019. These financial statements comprise of the Statement of Receipts and Payments and the Statement of Fund Balances for the year then ended and notes to the financial statements, including a summary of significant accounting policies adopted and other explanatory notes.", "page": 2}, {"type": "paragraph", "content": "In my opinion, the accompanying financial statements present fairly in all material respects, Kapchorwa Suam and Eldoret Bypass Roads Project Statement of Receipts and Payments, and the Statement of Fund Balance for the year ended 30 th June 2019, in accordance with the terms and conditions of the ADF and DFID funding agreements, and the cash basis of accounting described in Note 8 of the financial statements.", "page": 2}, {"type": "heading", "level": 1, "content": "Basis for Opinion", "page": 2}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards on Auditing (ISAs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of Project Management in accordance with the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act 2008, the International Ethics Standards Board for Accountants’ Code of Ethics for Professional Accountants (IESBA Code) together with the ethical requirements that are relevant to my audit of the financial statements in Uganda, and I have fulfilled my other ethical responsibilities in accordance with these requirements and the IESBA Code. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 2}, {"type": "heading", "level": 1, "content": "Key Audit Matters", "page": 2}, {"type": "paragraph", "content": "Key audit matters are those matters that, in my professional judgment, were of most significance in my audit of the financial statements of the period. These matters were addressed in the context of the audit of the financial statements as a whole, and in forming my opinion thereon, and I do not provide a separate opinion on these matters. I have determined the matters described below as key audit matters to be communicated in my report.", "page": 2}, {"type": "list", "content": "- Compensation of Project Affected Persons", "page": 2}, {"type": "paragraph", "content": "Section 42 of the Land Act, 1998 empowers Government to acquire land for public interest in exchange for compensation of owners or tenants based upon market value of the land plus disturbance allowance.", "page": 2}, {"type": "paragraph", "content": "Government of Uganda received financing support from the African Development Bank and African Development Fund (ADF) to implement the Kapchorwa Suam Road Project. The Project comprises, among other components, the upgrading of Kapchorwa-Suam Road (73km) and supervision consultancy, studies, training of unemployed youth and capacity building; compensation and resettlement. Before implementing this project and", "page": 2}, {"type": "paragraph", "content": "in accordance with the laws of Uganda, Government had to acquire rights by valuation of Project Affected Persons (PAPs) land, compensating the Project Affected Persons and finally demarcating the right of way.", "page": 3}, {"type": "paragraph", "content": "The area was identified during the risk assessment of the project, at the preliminary stage of the planning of the audit as a significant service delivery point, directly impacting on its mandate and an area of high stakeholder concern on the operational efficiency of the project. I focused on this area because of some of the PAPs disputed the amounts assessed by UNRA and they have not yet been paid, and delays compensation or non-compensation of PAPs affects progress of civil works.", "page": 3}, {"type": "paragraph", "content": "I designed specific programmes for execution to ascertain whether all valuations are done in accordance with the applicable law, regulations and best practice, whether the compensation process is fair, just and complete, whether persons compensated are the bona-fide owners of the land and, to establish procedures and action taken after compensation of PAPs.", "page": 3}, {"type": "paragraph", "content": "Based on the above procedures I noted the following:", "page": 3}, {"type": "table", "content": [["**No**", "**Observations**", "**Recommendations**"], ["**1.1**", "**Delayed payment to Project Affected People (PAPs)** UGX 1,348,154,371 (UGX 4,458,406,014 for 2017/2018) was paid to Project Affected Persons (PAPs) during the year under review, as disclosed in note 9.3 of the financial statements. My review of the land acquisition process on the project revealed that 23 Km representing 31.5% of the length of the road was in possession of the contractor as of the commencement date of 1st October 2018\\. However some PAPs within the possessed section had not been compensated and denied the contractor access to site on several occasions such as, at Km 9+660 to km 17+00 in May 2019, km 22+740 to km 22+860 in June 2019. also noted that there was a long time lag (delay of over 6 months) between the date PAPs signed transfer forms ceding the rights and obligations of their land to UNRA and the date when compensation was effected. of PAPs’ claims before commencement of construction exposes the project to refusal of handover of land by PAPs,  the PAPs, delayed project implementation and a risk of the Donors withdrawal of funding. litigation costs by explained that the delayed payment was due to lack of funds since the budget allocation for land acquisition was depleted within quarter two. I Non-settlement Management", "advised  UNRA management to plan adequately, source for timely funding and fast track the land acquisition process and clear all issues relating to PAPs, avoid blocking the progress of the project. to I"], ["**1.2**", "**Non-Compliance with Contractual Obligations: Civil** **Works**  Included in the financial statements under Note 9.2.1.2 is UGX 50,305,243,150 (inclusive of advance payment of 20% of the contract value) relating to Civil Works. The amount accounts for 83.6% of the total cumulative project expenditure (UGX 60,113,394,725) so far, exclusive of funds re-allocated. I noted that  UNRA engaged M/S China State Construction Engineering Corporation Ltd on the 7 th May 2018 to upgrade Kapchorwa- Suam road for a period of 36 months, with effect from 1 st", "recommended that UNRA adopts measures to address the delayed compensation of PAPs. I"]], "page": 3}, {"type": "table", "content": [["", "October 2018. However, the physical progress as at June 30, 2019 was 4.48% against 7.93% planned with a cumulative lag of 3.48%. causes of delays are denied access to site by the PAPs who have not been compensated and adverse weather conditions. clarified that the PAPs have been compensated and the Contractor is undertaking works in this section and that the Engineer shall make a determination as per the contract requirement whenever the Contractor submits a claim of any entitlement as a result of such events. Primarily, Management", ""], ["**1.3**", "**Implemented Designs**  The approved design reviews  the engineering specifications for the road which give a basis for the contract and payments thereof. specify noted that according to the Terms of References (ToRs) in the contract between the Employer and Consultant signed on the 26 th June 2018, the Design Review was supposed to be completed in six (6) months from the commencement of the Consultant’s tasks. However, the design review had not been concluded as at 30 th June 2019 (9 months after commencement). clarified that the Consultant has been submitting the Design Review in phases citing missing original Design details and additional design requirements, which had earlier not been envisaged. As of June 2020, a section of 23 Km from Km 0+000 to 23+000 had been handed over to the Contractor and the designs for this section had been reviewed and issued for implementation to ensure that the works are not delayed. To- date, designs up to Km 43+000 and those for all drainage structures have been reviewed and issued to the Contractor. The Consultant has also completed the review for the section from Km 43+000 to 73+000 and the designs are under review by the Employer. I Management", "advised  UNRA Management  to expedite the completion of the designs, and undertake the project within the contract timelines. I"]], "page": 4}, {"type": "heading", "level": 1, "content": "Emphasis of Matter", "page": 4}, {"type": "paragraph", "content": "Without qualifying my opinion, I draw attention to the following matters relating to the receipts and payments for the financial ended 30 th June 2018 and re-allocation of project funds reported in the Statement of Receipts and Payments that, in my judgement, are of such importance and fundamental to the users’ understanding of the financial statements;", "page": 4}, {"type": "list", "content": "- Opening Balances", "page": 4}, {"type": "paragraph", "content": "Included in the Statement of Receipts and Payments is receipts of UGX 6,300,000,000 and payments of UGX 6,299,980,587 relating to the financial year ended 30 th June 2018 for which the audited financial statements have not been provided. Management explained that these were GOU funds utilized to pay PAPS ahead of the start of civil works.", "page": 4}, {"type": "paragraph", "content": "I could not confirm with certainty the reported opening balances since individual project audited financial statements were not provided for review. I advised management to always prepare individual project Financial Statements and have them audited.", "page": 5}, {"type": "list", "content": "- Inter-Project Reallocations – UGX 3,702,931,057", "page": 5}, {"type": "paragraph", "content": "During the year to 30 th June 2019, UGX 3,702,931,057 was reallocated from the project to fund other projects. However, I was not provided with documentary proof of approval for the reallocated funds.", "page": 5}, {"type": "paragraph", "content": "Non-approval for the reallocation of funds does not only impact on the delivery of planned project outputs but also exposes the entity to the risk of fund withdrawal by the donors.", "page": 5}, {"type": "paragraph", "content": "Management explained that the budgeted funds were adequate and all project obligations were met before end of the financial year. Management further explained that during the year, the project implementation suffered disruption due to adverse weather conditions and budgeted funds could not be fully absorbed hence, the surplus funds were utilized on other GOU funded projects.", "page": 5}, {"type": "paragraph", "content": "I advised Management to ensure that:  \no  \nRealistic work plans and budgets are made and implemented within the set time periods.", "page": 5}, {"type": "paragraph", "content": "o  \nFunds earmarked for the project are available as and when required to ensure timely implementation of planned activities.", "page": 5}, {"type": "heading", "level": 1, "content": "Other Information", "page": 5}, {"type": "paragraph", "content": "Management is responsible for the other information. The other information comprises the Project background, objectives and management information. The other information does not include the financial statements and my audit report thereon. My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 5}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact.", "page": 5}, {"type": "paragraph", "content": "I have nothing to report in this regard.", "page": 5}, {"type": "heading", "level": 1, "content": "Management’s Responsibility for the Financial Statements", "page": 5}, {"type": "paragraph", "content": "Management is responsible for the preparation and fair presentation of the Project financial statements in accordance with the in accordance with Government of Uganda and African Development Bank Guidelines, and the cash basis of accounting as described under note 8 to the financial statements and for maintenance of such internal controls as management determines is necessary for the preparation and fair presentation of the Project financial statements that are free from material misstatement, whether due to fraud or error.", "page": 5}, {"type": "paragraph", "content": "In preparing the financial statements, Management is responsible for assessing the Project’s ability to achieve its core objectives, disclosing, as applicable, matters related to the achievement of its objectives, unless management either intends to close the project or to cease operations, or have no realistic alternative but to do so.", "page": 6}, {"type": "paragraph", "content": "Management is responsible for overseeing the Project’s financial reporting process.", "page": 6}, {"type": "heading", "level": 1, "content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 6}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISAs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.", "page": 6}, {"type": "paragraph", "content": "As part of an audit in accordance with ISAs, I exercise professional judgment and maintain professional skepticism throughout the audit. I also:", "page": 6}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 6}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Project’s internal control.", "page": 6}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by management.\n- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Project’s ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Project to fail to deliver on its mandate.", "page": 6}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 6}, {"type": "paragraph", "content": "I communicate with Management regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 6}, {"type": "paragraph", "content": "I also provide Management with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with him/her all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 7}, {"type": "paragraph", "content": "From the matters communicated with the Management, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 7}, {"type": "heading", "level": 1, "content": "Other Regulatory and Reporting Requirements", "page": 7}, {"type": "paragraph", "content": "I consider it necessary to communicate the following matters other than those presented or disclosed in the financial statements;", "page": 7}, {"type": "heading", "level": 1, "content": "Compliance with the Provisions of the Loan Agreement and Contractual Obligations", "page": 7}, {"type": "paragraph", "content": "Except for the following matters, UNRA complied with the loan agreement covenants. I have obtained all the information and explanations, and all expenses were eligible.", "page": 7}, {"type": "list", "content": "- Insurance", "page": 7}, {"type": "paragraph", "content": "Section 18.1.6 of the particular conditions of the contract, requires the contractor to provide proof of payment for the contractual insurance policies within 28 days after commencement date. However, a detailed review of the insurance policies indicated that not all the equipment on site was insured; only 5 out of the 10 excavators were insured and 3 out of the 8 bull dozers were insured. Bitumen distributors, Asphalt mixing plant, water pump and all generators were not insured.", "page": 7}, {"type": "paragraph", "content": "Non-compliance with contractual requirements especially with regard to possession of insurance cover may lead to total loss in case of any eventuality.", "page": 7}, {"type": "paragraph", "content": "Management explained that, the list of insured equipment was as per the Contractor’s mobilization at the time of purchasing the policies. As at June 2019, the list was not yet updated however, the policy has since been updated accordingly.", "page": 7}, {"type": "paragraph", "content": "I advised Management to liaise with the Resident Engineer and ensure that the contractors obtain insurance cover as required by the contract.", "page": 7}, {"type": "list", "content": "- Consultant’s Personnel Mobilization", "page": 7}, {"type": "paragraph", "content": "Progress report No. 9 (End of June 2019) table 38 K (Consultant’s attendance) indicated that the Hydrologist/ Drainage Engineer attended 30 days however, in other correspondences it was indicated that this key position is intermittent. I was not provided with proof of approval for the person occupying this position.", "page": 7}, {"type": "paragraph", "content": "Given the hydrological condition of the project area, challenges related to drainage affecting the communities and subsequent litigations are eminent.", "page": 7}, {"type": "paragraph", "content": "Management clarified that the Consultant communicated to UNRA that the originally proposed Hydrologist for Supervision was not available for the assignment. The proposed replacement staff was not approved because he did not meet the experience stipulated in the contract and UNRA has since communicated to the Consultant to mobilize a Hydrologist for the supervision phase. The Consultant has since been managing the Hydrological issues however, no payment is being made for the position.", "page": 8}, {"type": "paragraph", "content": "I advised UNRA and the Consulting Engineer to ensure that all key personnel are mobilized, in accordance with the contract terms.", "page": 8}, {"type": "heading", "level": 1, "content": "GOU Counterpart Funding", "page": 8}, {"type": "paragraph", "content": "I confirm that the Government of Uganda has fulfilled its counterpart funding obligation for Kapchorwa-Suam Project for the year ended 30 th June 2019.", "page": 8}, {"type": "heading", "level": 1, "content": "Internal Controls", "page": 8}, {"type": "paragraph", "content": "As part of my audit scope and in accordance with International Standards on Auditing, I considered internal controls relevant to UNRA in the preparation and fair presentation of Kapchorwa-Suam Project financial statements for the year ended 30 th June 2019, in order to design audit procedures that are appropriate. Other than the matters referred to in the report, the Internal Control structure for Kapchorwa-Suam Project, was found to be appropriate.", "page": 8}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 8}, {"type": "heading", "level": 1, "content": "AUDITOR GENERAL", "page": 8}, {"type": "heading", "level": 1, "content": "KAMPALA", "page": 8}, {"type": "paragraph", "content": "30 th September, 2020.", "page": 8}, {"type": "heading", "level": 1, "content": "APPENDIX I FINANCIAL STATEMENTS", "page": 9}]