[{"type": "heading", "level": 3, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 3, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF UGANDA ROAD FUND", "page": 0}, {"type": "paragraph", "content": "FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2021", "page": 0}, {"type": "heading", "level": 3, "content": "OFFICE OF THE AUDITOR GENERAL UGANDA", "page": 0}, {"type": "heading", "level": 3, "content": "TABLE OF CONTENTS", "page": 1}, {"type": "tableOfContent", "content": ["Opinion - 4", "Basis for Opinion - 4", "Key Audit Matter - 4", "  1.0 Implementation of the approved budget - 4", "Other Information - 11", "Management Responsibilities for the Financial Statements - 11", "Auditor’s Responsibilities for the audit of the Financial Statements - 12", "Other Reporting Responsibilities - 13", "Report on the Audit of Compliance with Legislation - 13", "  2.0 Failure to collect monies of the Fund - 13", "3.0 Review and calibration of the Funds allocation formulae to Designated Agencies", " ………………………………………………………………………………………….13", "  4.0 Delayed procurements - 14", "  5.0 Inadequate monitoring and evaluation of the performance of Designated Agencies - 15", "  6.0 Lack of internal controls in the office inventory stores - 16"], "page": 1}, {"type": "paragraph", "content": "2", "page": 1}, {"type": "table", "content": [["**Acronym**", "**Meaning**"], ["BN", "Billion"], ["DAs", "Designated Agencies"], ["DUCAR", "District Urban and Community Access Roads"], ["FY", "Financial year"], ["GoU", "Government of Uganda"], ["IESBA", "International Ethics Standards Board for Accountants"], ["IFMIS", "Integrated Financial Management Information System"], ["ISSAIs", "International Standards of Supreme Audit Institutions"], ["INTOSAI", "International Organization of Supreme Audit Institutions"], ["MDAs", "Ministries, Departments and Agencies"], ["MOFPED", "Ministry of Finance, Planning and Economic Development Development"], ["MoWT", "Ministry of Works and Transport"], ["NTR", "Non Tax Revenue"], ["PFMA", "Public Finance Management Act"], ["PPDA", "Public Procurement and Disposal Authority"], ["**TAI**", "Treasury Accounting Instructions"], ["URF", "Uganda Road Fund"], ["UGX", "Uganda Shillings"]], "page": 2}, {"type": "paragraph", "content": "3", "page": 2}, {"type": "heading", "level": 3, "content": "REPORT OF THE AUDITOR GENERAL ON THE AUDIT OF FINANCIAL STATEMENTS OF UGANDA ROAD FUND FOR THE FINANCIAL YEAR ENDED 30 TH JUNE, 2021", "page": 3}, {"type": "heading", "level": 3, "content": "THE RT. HON. SPEAKER OF PARLIAMENT Opinion", "page": 3}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Uganda Road Fund which comprise the statement of Financial Position as at 30 th June 2021, and the Statement of Financial Performance, Statement of Changes in Equity and Statement of Cash Flows together with other accompanying statements for the year then ended, and notes to the financial statements, including a summary of significant accounting policies.", "page": 3}, {"type": "paragraph", "content": "In my opinion, the financial statements of Uganda Road Fund for the year ended 30 th June 2021 are prepared, in all material respects, in accordance with Section 51 of the Public Finance Management Act, 2015 and the Financial Reporting Guide, 2018.", "page": 3}, {"type": "heading", "level": 3, "content": "Basis for Opinion", "page": 3}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of Uganda Road Fund in accordance with the Constitution of the Republic of Uganda, 1995 (as amended), the National Audit Act, 2008, the International Organization of Supreme Audit Institutions (INTOSAI) Code of Ethics, the International Ethics Standards Board for Accountants Code of Ethics for Professional Accountants (Parts A and B) (IESBA Code), and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "heading", "level": 3, "content": "Key Audit Matter", "page": 3}, {"type": "paragraph", "content": "Key audit matters are those matters that, in my professional judgment, were of most significance in my audit of the financial statements of the current period. These matters were addressed in the context of my audit of the financial statements as a whole, and in forming my opinion thereon, and I do not provide a separate opinion on these matters. I have determined the matter described below to be key audit matter communicated in my report.", "page": 3}, {"type": "paragraph", "content": "1.0", "page": 3}, {"type": "heading", "level": 3, "content": "Implementation of the approved budget", "page": 3}, {"type": "paragraph", "content": "On the 24 th of April 2020, Parliament approved the annual budget for MDAs and LGs that contained the specific resource envelope allocated to each vote to implement agreed on outputs. Subsequently, the PS/ST issued a Budget Execution Circular that communicated the budget strategy, policy, and administrative issues to guide the budget implementation for the financial year 2020/2021.", "page": 3}, {"type": "paragraph", "content": "During my overall risk assessment exercise, I noted that MDAs and LGs are still experiencing challenges in implementing the budgets approved by parliament and policy guidance’s issued by PS/ST, which has continued to affect the performance and credibility of the budget negatively. These challenges include; lack of strategic plans that are aligned to the National Development Plans, underperformance of revenue, implementation of off-budget activities, under absorption of funds, insufficient", "page": 3}, {"type": "paragraph", "content": "4", "page": 3}, {"type": "paragraph", "content": "quantification of outputs, partial and non-implementation of outputs, diversion of funds and challenges in budget monitoring and reporting of performance.", "page": 4}, {"type": "paragraph", "content": "I am aware that the Covid-19 Pandemic continues to significantly affect the implementation of several activities. Consequently, a number of activities were not implemented due to budget cuts and lockdown measures instituted to control the spread of the pandemic. It is against this background that the implementation of the budget was again considered a key audit area during the office-wide planning for the current audit year.", "page": 4}, {"type": "paragraph", "content": "The Uganda Road Fund (URF) is mandated under Section 6 of The Uganda Road Fund Act, 2008 to finance the routine and periodic maintenance of public roads in Uganda; to ensure that public roads are maintained at all times; and to advise the Minister, in consultation with the Minister responsible for roads and the Minister responsible for local governments on the preparation and efficient and effective implementation of the Annual Road Maintenance Programme; and the control of overloading of vehicles on public roads.", "page": 4}, {"type": "paragraph", "content": "To achieve this mandate, URF planned to implement both recurrent and development activities. A review of the entity’s policy statement and budget revealed that the entity had an approved budget of UGX.512,175,459,769, out of which UGX.506,507,049,954 was warranted. The table below shows a summary of the key outputs of the URF for the financial year 2020/21.", "page": 4}, {"type": "heading", "level": 4, "content": "Table 1: Showing key deliverables for URF for the year", "page": 4}, {"type": "table", "content": [["**No**", "**Details**", "**Budget (UGX) “000”**", "**Percentage share of the total approved budget**"], ["1", "045201: Road Fund Secretariat Services", "9,758,436", "1.9"], ["2", "045251: National Roads Maintenance", "310,285,191", "62.4"], ["3", "045252: District, Urban and Community Access Roads (DUCAR) Maintenance", "176,241,833", "96.8"], ["4", "045272: Government Buildings Administrative Infrastructure and", "15,770,000", "99.9"], ["5", "045276 Purchase of Office and Equipment, including Software ICT", "70,000", "99.9"], ["6", "045278 Purchase of Office and Residential Furniture and Fittings", "50,000", "100"], ["**Total**", "**512,175,460**", "**100**", null]], "page": 4}, {"type": "paragraph", "content": "URF planned to accomplish its budgetary objectives by implementing six (6) outputs with a total approved budget of UGX. 512,175,459,769. I assessed all the six (6) outputs with a total of eighteen (18) activities and a budget of UGX.512,175,459,769 representing 100% of the total approved budget for review.", "page": 4}, {"type": "paragraph", "content": "From the procedures undertaken, I noted the following (Table 2):", "page": 4}, {"type": "paragraph", "content": "5", "page": 4}, {"type": "heading", "level": 4, "content": "Table 2: Findings on Budget implementation", "page": 5}, {"type": "table", "content": [["**No**", "**Observation**", "**Recommendation**"], ["1.1.1", "**Existence of Strategic plans that are aligned to NDP-III** Paragraph 5 of the budget execution circular for the financial year 2020/2021 cites poor alignment of Government Budgets with the National Development Plans. The PS/ST urges Accounting Officers to ensure that all activities for Financial Year 2020/2021 are aligned with NDP III and implemented accordingly. Regulation 26 (1) of the National Planning Authority (development of Plans) regulations require entities to submit to NPA their five-year development plans for certification before approval This being the first year of implementation of the NDP-III, the entity was expected to prepare a strategic plan aligned to NDP III and ensure that the plan is approved. The strategic plan would then form the basis of the preparation of the entity’s annual plans. Through document review and interviews, I noted that URF did not have an approved five year vote strategic plan to facilitate operationalization of the NDP III infrastructure sector priorities during the first year of NDP III implementation. There is a risk that activities implemented during the financial year 2020/2021 were not aligned to the NDP-III, which negatively affects the achievement of NDP-III objectives. The Accounting Officer explained that the URF prepared a Strategic Plan 2020/21 - 2024/25 which is aligned to NDPIII and was submitted to National Planning Authority (NPA) for approval, but the Plan was still under approval process by the NPA.", "I advised the Accounting to follow up and have the plan approved by NPA"], ["1.1.2", "I reviewed the NTR estimates, revenue sources and rates charged at vote level for the financial year 2020/2021 and noted that URF did not forecast the NTR to be collected during the year under review. However, the financial statements indicated that NTR amounting to UGX 7,078,800.was collected during the year. Non-budgeting for NTR collections at the vote level results in an aggregate revenue under budgeting at the Treasury level, which negatively affects planning at a Government-wide level. **of GoU receipts** URF budgeted to receive UGX. 512.175 bn out of which UGX. 506.507 bn was availed, resulting in a shortfall of UGX 5.493 bn, which is 1.1% of the budget. Revenue shortfalls affect the implementation of planned activities. explained that the entity did not make any NTR projections in the year under review because the only source of realizable revenue is appropriations from Treasury received on a quarterly basis. However they would make projects relating sale of bid documents and disposal of assets. **Revenue Performance Performance of NTR** **Performance** Management", "I advised the Accounting Officer to always ensure that NTR  forecasted and indicated in the budget. is advised  the Accounting officer to liaise with MOFPED to ensure that the approved funding is always fully availed. I"]], "page": 5}, {"type": "paragraph", "content": "6", "page": 5}, {"type": "table", "content": [["1.1.3", "**Absorption of funds** Out of the total warrants of UGX. 506.507bn received during the financial year, UGX. 506.296 Bn was spent by the entity resulting in an unspent balance of UGX. 0.211Bn representing an absorption level of 99.96%. The unspent funds were swept back to the consolidated fund as required by the PFMA. The funds were meant for activities that were not fully implemented by the end of the financial year and these include;  1\\. Recruitment and substantive appointment of staff, and  2\\. Importation of materials for construction of the Fund Secretariat further noted that the entity did not seek revision of its budget and work plan as provided for by section 17 (3) of the PFMA 2015. I", null, null, null, null, null, null, null, null, null, "I advised the Accounting Officer to ensure that all funds availed are absorbed or make the necessary revisions in the budget and work plan and have these approved as guided  the PFMA2015. by"], ["1.1.4", "**Quantification of outputs/activities** Section 13 (15, b) of the PFMA 2015 states that a policy statement submitted by a vote shall contain the annual and three months’ work plans, outputs, targets and performance indicators of the work plans. . Regulation 11 (3) of PFMR 2016 requires that a vote prepares a work plan that indicates the outputs of the vote for the financial year; the indicators to be used to gauge the performance of the outputs and funds allocated to each activity. To assess the performance of an output, all activities supporting the output must be quantified.  I reviewed the extent of quantification of outputs and activities for all the Fund’s six (6) outputs with a total of eighteen (18) activities with an approved budget of UGX 512.175bn representing 100% of the Fund’s approved total budget.  I noted that six (6) outputs with a total of eighteen (18) activities and expenditure worth UGX 506.296 Bn were fully quantified. That is, all the eighteen (18) activities (100%) within these outputs were clearly quantified to enable the assessment of performance. **Table 3 refers:** **Activity details-Analysis** **Table 3: showing the extent of quantification of outputs** **Summary of Performance by**  **Outputs**  **Cate**  **gory**  **of**  **outp** uts** **% prop ortio n to total expe ndit ure** **Total no of activ ities in the outp uts** **No. of Fully Qua ntifi ed activ ities** **No of activit** **ies** not fully quanti fied** **No. of out put** **s** sa mp led** **Expe ndit ure UGX Bn** **% of tot al out put** **s** sa mp led** **% of quan tifica tion of activ ities per cate gory of outp** **ut**  6 100 506.2 100 18 18 0 100 96 Fully quant ified outpu ts noted that URF did not have unit cost estimates at activity level to provide a link between inputs, processes, outputs and I", null, null, null, null, null, null, null, null, null, "I advised the Accounting Officer to ensure  unit costs are estimated at activity level. that"], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null]], "page": 6}, {"type": "paragraph", "content": "7", "page": 6}, {"type": "table", "content": [["intermediate outcomes realized during the year.", null, null, null, null, null, null, null, null, null, null, ""], ["1.1.5 **Implementation of quantified outputs** I assessed the implementation of six (6) outputs that were fully quantified with a total of eighteen (18) activities worth UGX 506.296 and noted that;  these two outputs were  Two (2) outputs with two (2) activities and expenditure worth UGX 310.335bn were fully implemented. That is all the two (2) activities within  fully implemented. Four (4) outputs with sixteen (16) activities worth UGX. 195.961bn were partially implemented. Out of the sixteen (16) activities, the entity fully implemented five (5) activities, and nine (9) activities were partially implemented, while two (2) activities remained unimplemented. **Table 4 refers.** Details in **Appendix I.** **4: Showing level of implementation of Fully** **Quantified outputs**  **Summary of Performance by**  **Output**  **Cate**  **gory**  **of**  **outp** ut** **No of out put s** **% of im ple me nta tio n** **Exp end itur e UG X Bn** **% prop ortio n to total expe ndit ure** **Tot al no of act ivit ies** **Activity details-Analysis** **No of Ful ly im ple me nte d act ivit ies** **No. of par tial ly im ple me nte d act ivit ies** **No** of activ ities that wer** **e** not impl eme nted** **Exten t of imple menta** **tion** of activit** **ies** per categ ory of outpu t** 61.3 2 2 0 0 100 38.7 16 5 9 2 56 Fully imple ment ed outp uts 1 Parti ally Impl emen ted outp uts 2 2 33. 3 4 66. 7 310 .33 5 195 .96 1 506 .29 6 Total 6 100 100 18 7 9 2 of planned activities the expected services to the beneficiary communities were not attained. For example, URF did not implement the following planned activities despite having received the required funds; implies that **Table** Non-implementation", null, null, null, null, null, null, null, null, null, null, "I advised the Accounting Officer to ensure that outputs / activities  are implemented  as planned."], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null, null]], "page": 7}, {"type": "paragraph", "content": "1 Fully implemented output -All the activities within the outputs are fully implemented  \n2 Partially implemented Output-Activities within the output are either; Fully implemented, partially implemented or not implemented 8", "page": 7}, {"type": "table", "content": [["1\\. Production of quarterly reports on the status and functionality of District Road Committees and  2\\. Review and calibration of the funds allocation formula The Accounting Officer explained that implementation of majority of the above activities was affected by the COVID-19 pandemic and the nationwide lockdown during quarter two and three of the financial year. In addition, budget cuts by MOFPED affected the planned implementation of activities.", null, null, null, null, null, ""], ["1.1.6 **Achievement of intended services from implemented outputs-** I undertook an assessment to establish if there has been service delivery from a sample of outputs that were implemented and noted the following **(Table** 5): **Table 5: achievement of intended services** Output Output: 45201 Road Fund Secretariat Services Planned Target  FY 20/21  Report on spot M&E field visits on 48 Designated Agencies  produced  Report  in- house Technical and  Financial reviews of 45 agencies on 4 tracking report Program field Audit remarks 17 out of 48 DAs visited indicating that 30 Designated agencies were not visited for monitoring. Out of the 45 agencies planned for review, only 30 agencies were reviewed. However, the performance report indicated that 48 agencies were reviewed.  I noted that out of the 4 quarterly program tracking reports only 3 were prepared failure to achieve the intended services from the implemented outputs negates the purpose of budgeting and implementing these activities. The", null, null, null, null, null, "in I advised the Accounting Officer to urgently address the anomalies/  gaps noted  the implementation of the outputs / activities to enable the communities to fully benefit from the projects/ programs implemented by the agencies."], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], [null, null, null, null, null, null, null], ["I noted that funds to the tune of UGX. 427,232,982 reallocated from the activities on which they were budgeted and spent on other activities without seeking and obtaining the necessary approvals. Reallocation/ diversion of funds is not only contrary to the Public Finance and Management Act, but it negatively affects the delivery of services and negates the purpose of budgeting. 1.1.7  **Reallocation / Diversion of funds**", null, null, null, null, null, "I advised the Accounting Officer to ensure that spending is undertaken as per approved  budget lines. I also advised that authority should be sought for any reallocations/diversio ns prior to spending in accordance with the regulations."], [null, null, null, null, null, null, null], ["1.1.8  **Submission of Quarterly Performance Reports-** Paragraph 8.12 (4,5,6) of the Treasury Instruction 2017, require the Accounting Officer to prepare reports for each quarter of the Financial Year in respect of the vote for which he/she is responsible. These reports shall contain financial and non-financial", null, null, null, null, null, "I advised the Accounting Officer to ensure  that performance reports are prepared and"], [null, null, null, null, null, null, null]], "page": 8}, {"type": "paragraph", "content": "9", "page": 8}, {"type": "table", "content": [["", "information on the performance of the vote and shall be submitted to Treasury not later than 15 days after the end of each quarter. I noted that the entity submitted performance reports for Q1, Q3 and Q4 after the deadline given for submission of the reports. The **Table 6** below shows the delays per quarter on submission of budget performance reports; **Table 6: Delayed submission of performance reports** Details Deadline for No  submission Quarter One 15/10/2020 Quarter Two 15/01/2021 Quarter Three 15/04/2021 Quarter Four 15/07/2021 Actual date Comment  of  (submitted in time/ submission delayed) 27/11/2020 Delayed 10/01/2021 Submitted in time 07/5/2021  24/7/2021 Delayed Delayed addition, whereas the Accounting Officer prepared Monitoring Plans, I did not obtain evidence (monitoring reports) to confirm that monitoring activities were conducted as indicated in the plan for purposes of ensuring that the budget performs as expected. Failure to submit performance reports in time and failure to prepare monitoring reports contravenes the Treasury Instructions and monitoring manual, and affects timely tracking and evaluation of performance. 1 2 3 4 In", null, null, null, null, null, null, null, null, "submitted in time. I also advised that the Accounting Officer should  always prepare monitoring reports to facilitate evidence  based decision making."], ["No", null, null, null, null, null, null, null, null, null, null], ["1", null, null, null, null, null, null, null, null, null, null], ["2", null, null, null, null, null, null, null, null, null, null], ["3", null, null, null, null, null, null, null, null, null, null], ["4", null, null, null, null, null, null, null, null, null, null], ["addition, whereas the Accounting Officer prepared Monitoring Plans, I did not obtain evidence (monitoring reports) to confirm that monitoring activities were conducted as indicated in the plan for purposes of ensuring that the budget performs as expected. Failure to submit performance reports in time and failure to prepare monitoring reports contravenes the Treasury Instructions and monitoring manual, and affects timely tracking and evaluation of performance. In", null, null, null, null, null, null, null, null, null, null], ["1.1.9", "**Accuracy of Performance reports submitted**  From my review of the annual performance reports and physical inspections/verification  noted inconsistencies in the reported performance, as shown in Table 7 below. of outputs reported, I **7: Inconsistencies in reported performance** **Planned**  **Target** FY 20/21** Reviewed and calibrated funds allocation Formula (1) Report  on spot  M&E field visits to 48  Designated Agencies produced Report on in- house Technical and Financial reviews of 45 **Reported achieved target in the Q4 report** Calibrated Funds allocation  formula  reviewed approved and 12 Local M&E  Reports produced  for field  visits carried out on 5 UNRA stations, 4 Municipal Councils,  District Governments  and 4 Cities Reports on in- house Technical and  Financial reviews of 48 Agencies **Verified achieved target by the audit team** Although Management reported  this activity  as completed, there was no evidence that the activity was implemented at all. Reports on spot M&E field visits on 27  Designated  Agencies  were produced and not 25 as reported in the  performance report Only 30 reports were  prepared contrary to the 48 reported to have been prepared in **Output** Output: 45201 Road Fund Secretariat Services **Table**", null, null, null, null, null, null, null, null, "I advised the Accounting Officer to report  on performance accurately."], [null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null, null]], "page": 9}, {"type": "paragraph", "content": "10", "page": 9}, {"type": "paragraph", "content": "Agencies Prepared the performance report  \nReport (4 4 District Roads Although quarterly) on Committee Management status and quarterly reports reported this functionality prepared and activity as of District reviewed completed, there Roads  \nwas no evidence Committee  \nthat the activity was (DRCs)  \nimplemented at all.", "page": 10}, {"type": "paragraph", "content": "Inaccurate reporting of performance misleads the users of this financial information and casts doubt on the reliability and authenticity of the information (both Financial and Non-financial) presented by the entity.", "page": 10}, {"type": "paragraph", "content": "The accounting officer explained that:", "page": 10}, {"type": "list", "content": "1. The contract under EU which was meant to implement the calibration formula was frustrated by the COVID pandemic and the contract was suspended indefinitely by the EU hence failure to calibrate the Formula. However, the Fund plans to calibrate the existing Formula in FY 2021/22.", "page": 10}, {"type": "list", "content": "2. In-house technical and financial reviews achieved in the financial year were 30 agencies and not 48 agencies as reported. The anomaly has been noted and will be corrected.", "page": 10}, {"type": "list", "content": "3. Program tracking outstanding activities were rolled over to the FY2021/22 as we were unable to undertake them due to COVID-19 travel restrictions.", "page": 10}, {"type": "heading", "level": 3, "content": "Other Information", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer of URF is responsible for the other information. The other information comprises the statement of responsibilities of the Accounting Officer and the commentaries by the Head of Accounts and the Accounting Officer, and other supplementary information. The other information does not include the financial statements and my auditors’ report thereon. My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 10}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the other information and, in doing so, consider whether the other information is materially consistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact.  \nI have nothing to report in this regard.", "page": 10}, {"type": "heading", "level": 3, "content": "Management Responsibilities for the Financial Statements", "page": 10}, {"type": "paragraph", "content": "U nder Article 164 of the Constitution of the Republic of Uganda, 1995 (as amended) and Section 45 of the Public Finance Management Act, 2015, the Accounting Officer is accountable to Parliament for the funds and resources of Uganda Road Fund.", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer is also responsible for the preparation of financial statements in accordance with the requirements of the Local Governments Financial and Accounting Manual, 2007 and the Public Finance Management Act, 2015 and for such internal control as management determines necessary to enable the preparation of financial statements that are free from material misstatement whether due to fraud or error.", "page": 10}, {"type": "paragraph", "content": "11", "page": 10}, {"type": "paragraph", "content": "In preparing the financial statements, the Accounting Officer is responsible for assessing the Fund’s ability to continue as a going concern, disclosing, as applicable, matters related to going concern and using the going concern basis of accounting, unless the Accounting Officer has a realistic alternative to the contrary.", "page": 11}, {"type": "paragraph", "content": "The Accounting Officer is responsible for overseeing the Uganda Road Fund’s financial reporting process.", "page": 11}, {"type": "heading", "level": 3, "content": "Auditor’s Responsibilities for the audit of the Financial Statements", "page": 11}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISSAIs will always detect a material misstatement, when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in aggregate, they could reasonably be expected to influence the economic decisions of users, taken on the basis of these financial statements.", "page": 11}, {"type": "paragraph", "content": "As part of an audit in accordance with ISSAIs, I exercise professional judgement and maintain professional scepticism throughout the audit. I also:-", "page": 11}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 11}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Fund’s internal controls.", "page": 11}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by the management.", "page": 11}, {"type": "list", "content": "- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Fund’s ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Fund to cease to continue as a going concern.", "page": 11}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 11}, {"type": "paragraph", "content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 11}, {"type": "paragraph", "content": "I also provide the Accounting Officer with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with them all relationships", "page": 11}, {"type": "paragraph", "content": "12", "page": 11}, {"type": "paragraph", "content": "and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 12}, {"type": "paragraph", "content": "From the matters communicated with the Accounting Officer, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 12}, {"type": "heading", "level": 3, "content": "Other Reporting Responsibilities", "page": 12}, {"type": "paragraph", "content": "In accordance with Section 19 (1) of the National Audit Act, 2008, I report to you, based on my work described on the audit of Financial Statements, that; except for the matters raised in compliance with legislation section below, and whose effect has been considered in forming my opinion on financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 12}, {"type": "heading", "level": 3, "content": "Report on the Audit of Compliance with Legislation", "page": 12}, {"type": "paragraph", "content": "In accordance with Section 13 of the NAA 2008, I have a responsibility to report material findings on the compliance of the Authority with specific matters in key legislations. I performed procedures primarily to identify findings but not to gather evidence to express assurance.", "page": 12}, {"type": "paragraph", "content": "The material findings in respect of the compliance criteria for the applicable subject matters are as follows;", "page": 12}, {"type": "paragraph", "content": "2.0", "page": 12}, {"type": "heading", "level": 3, "content": "Failure to collect monies of the Fund", "page": 12}, {"type": "paragraph", "content": "Section 21 of the URF Act 2008 mandates the Fund on recommendations by the Board to charge road user charges which include fuel levies, international transit fees from vehicles entering the country, road license fees, axle load fees, and bridge and road toll fees. This is amplified under the monies of the Fund by the commentary on the financial statements by the Accounting Officer at page 3. The audit of financial statements indicated that the Fund did not collect the above monies.", "page": 12}, {"type": "paragraph", "content": "Failure to collect the revenue negatively affects the Fund’s mandate and hence hampers service delivery.", "page": 12}, {"type": "paragraph", "content": "The Accounting Officer explained that this was caused by a lacuna in the law whereby section 14 of the URA Act also empowers URA to collect the same revenue which made URF not to budget for it.", "page": 12}, {"type": "paragraph", "content": "I advised the Accounting officer in collaboration with the Board to engage all the necessary stakeholders involved to ensure that the revenues are collected on behalf of the Fund so as to support in the fulfilment of the Fund objectives.", "page": 12}, {"type": "heading", "level": 3, "content": "3.0 Review and calibration of the Funds allocation formulae to Designated Agencies", "page": 12}, {"type": "paragraph", "content": "Section 6.1.4 of the Planning and programming policies and procedures manual states that the allocation formula shall be reviewed by the Board annually to ensure that it remains valid under current circumstances.", "page": 12}, {"type": "paragraph", "content": "13", "page": 12}, {"type": "paragraph", "content": "However, I noted that the fund allocation formula was last reviewed by the Secretariat in 2019. In addition, during the year, the formula was not reviewed to provide for current situations such as budget cuts and Covid-19 pandemic effects which led to disproportionate transfers to designated agencies.", "page": 13}, {"type": "paragraph", "content": "Without regular review and calibration of the funds allocation formula, transfers to designated agencies have no proper basis and may not be fairly justified by the Fund. The practice affects service delivery provision to the intended beneficiaries due to inadequate allocation of funds for road maintenance services.", "page": 13}, {"type": "paragraph", "content": "The Accounting Officer explained that the Funds Allocation Formula was planned to be reviewed with Technical Assistance from the EU to URF in FY 2020/21. The revised Funds Allocation Formula would subsequently be calibrated and applied. However the contract under EU was frustrated by the COVID pandemic of 2020 and the contract was suspended indefinitely by the EU hence failure to calibrate the Formula. It should be noted no funds were budgeted for under URF for that purpose in FY 2020/21. However, the Fund plans to calibrate the existing Formula in FY 2021/22.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to urgently plan for the review of the review and calibration of the funds allocation formula.", "page": 13}, {"type": "paragraph", "content": "4.0 Delayed procurements", "page": 13}, {"type": "paragraph", "content": "According to the budget execution circular Para 9 FY 2020/2021, the implementation of the budget for FY 2020/2021 will strictly be based on the approved annual work plan, procurement plans and recruitment plans. The Accounting officers are further required to embark on their procurement and recruitment activities as early as possible to minimize delayed procurements and failure to effectively absorb released resources. In order to achieve timely delivery of services, procurement processes must be undertaken in a manner that ensures that the best service providers are identified in time.", "page": 13}, {"type": "paragraph", "content": "For this analysis, I compared the total amount of time needed to complete the procurement of service providers / Works (from approval of bid documents to contract signing/) for each type and method of procurement to establish the time taken against the timelines in the PPDA Act.", "page": 13}, {"type": "paragraph", "content": "I analyzed the procurement process between the date of bid approval and the date of contract signing (award of the best evaluated bidder) for eleven sampled procurements and it was noted that procurements worth UGX 642,234,236 had delays ranging between 1 and 93 working days. For example; the contract for provision of Motor Vehicle maintenance services under framework contract was delayed by 93 days and the contract for supply, delivery and installation of I-pads for URF Board members was delayed by 15 days.", "page": 13}, {"type": "paragraph", "content": "Delays in the execution of the procurement processes translate into delays in Programme / project implementation which affects funds absorption rates and timely realisation of the output targets.", "page": 13}, {"type": "paragraph", "content": "The Accounting Officer explained that the delays as detailed above were occasioned by the halting of procurements during the COVID-19 lock down period. The processes later commenced after lifting of the lockdown that enabled evaluation of bids to be undertaken and awards made.", "page": 13}, {"type": "paragraph", "content": "14", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting officer to embark on the procurement processes early enough to avoid unnecessary delays that in the long run affect delivery of the expected outputs/ targets.", "page": 14}, {"type": "heading", "level": 3, "content": "5.0 Inadequate monitoring and evaluation of the performance of Designated Agencies.", "page": 14}, {"type": "paragraph", "content": "Section 4.3.4.2, paragraph 4 of the Uganda Road Fund Monitoring and Evaluation Framework stipulates that to match the proposed sampling criteria to the URF in-house capacities and available funding, 12.5% of all the DA's and sub agencies shall be monitored in each quarter and each DA grouped as one unit with its sub-agencies shall be monitored at least once every two years.", "page": 14}, {"type": "paragraph", "content": "I noted that the total number of designated agencies and sub-agencies financed by the Fund is two hundred and three (203) out of which one hundred and thirty four (134) are District Local Governments, thirty one (31) municipalities, twenty three (23) UNRA stations, ten (10) cities and five (5) KCCA divisions. It was further noted through review of the M&E framework that the M&E department is supposed to monitor and evaluate at least one hundred and one (101) representing 50% of all the designated agencies and sub agencies financed by the Fund. However, out of the 203 designated agencies supposed to be monitored, only twenty seven (27) Agencies representing 13.3% of the total designated agencies and sub agencies were monitored during the year. The below refers.", "page": 14}, {"type": "table", "content": [["**Designated Agencies**", "**Total Agencies/ Sub-Agencies**", "**Q1**", "**Q2**", "**Q3**", "**Q4**", "**Total designated agencies and sub-agencies monitored in the year**", "**% of agencies monitored out of the total agencies**"], ["UNRA stations", "23", "2", "2", "2", "0", "6", "26.1"], ["DLGs", "134", "3", "6", "5", "0", "14", "10.4"], ["Municipalities", "31", "2", "1", "2", "0", "5", "16.1"], ["Cities", "10", "0", "0", "2", "0", "2", "20"], ["KCCA", "5", "0", "0", "0", "0", "0", "0"], ["**TOTAL**", "**203**", "**7**", "**9**", "**11**", "**0**", "**27**", "**13.3**"]], "page": 14}, {"type": "paragraph", "content": "From the table above, it can be observed that in quarter four (Q4) no designated agency and sub agency was monitored and in the first three quarters of the year only 27 DAs were monitored.", "page": 14}, {"type": "paragraph", "content": "The failure to monitor operations of the designated agencies in 4 th quarter and low coverage in the last three quarters of the year is attributable to the covid-19 movement restrictions and inadequate staffing structure/ staffing position of the M&E department whereby the structure provides for only three (3) staff in the department to monitor the operations of all DAs which is very low staffing position given the mandate of the department. In addition, out of the approved structure of three-staff, only two positions representing 67% are filled by URF. This further affects realization of the set targets in the M&E annual work plan and in the long run affects making corrective action to facilitate timely delivery and quality achievement of the set planned targets.", "page": 14}, {"type": "paragraph", "content": "It was further noted that whereas the department prepared M&E reports, there was no evidence that these reports were discussed by the Board for purposes of making corrective action for performance improvement and fast tracking timely delivery of undertaken projects by designated agencies.", "page": 14}, {"type": "paragraph", "content": "15", "page": 14}, {"type": "paragraph", "content": "Without adequate monitoring and evaluation of implemented projects by designated agencies, Management of URF cannot ascertain the extent of delivery of such projects and challenges experienced during project delivery for evidence based decision making and performance improvement.", "page": 15}, {"type": "paragraph", "content": "The Accounting Officer explained that due to the COVID-19 pandemic and travel restrictions, collection of data for input in the reports faced massive delays from designated agencies leading to downstream delays in the reporting process.", "page": 15}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that an M&E system is developed with clear administrative and institutional tasks for establishing data collection, analysis and reporting guidelines. I also advised the Accounting Officer to ensure that the M&E structure is revised and fully constituted to facilitate monitoring of the designated agencies as required by the M&E Framework to generate monthly and quarterly reports on the performance of the Programmes with recommendations for corrective action so as to facilitate evidence based decision making by Government.", "page": 15}, {"type": "paragraph", "content": "6.0", "page": 15}, {"type": "heading", "level": 3, "content": "Lack of internal controls in the office inventory stores", "page": 15}, {"type": "paragraph", "content": "Paragraph 7.19.2 of the Treasury instructions 2017 requires Issuance of a book of original entry to be properly authorized and signed for by both the requisitioning and issuing officers and recorded in the appropriate register detailing the; Name of book of original entry; Date issued; Name of Officer issued to; Name of issuing Officer; Range of Series; and Head of Finance and Accounts signature.", "page": 15}, {"type": "paragraph", "content": "However audit noted that whereas URF had central stores under the charge and control of the Administrative Officer, the entity did not have a proper stores management system that is recommended in the Treasury Instructions. Most of the purchases that were made did not go through stores and those that went through stores had the Goods Received Note only signed by the Administrative Officer without an allowance of any other countersigning control like internal audit to verify the actual deliveries that have been made. Also audit noted that the stores did not have any stock cards in place to show record of issue of stock and balances at the store.  \nLack of proper controls in place in the stores makes the inventories susceptible to theft resulting into loss of funds.", "page": 15}, {"type": "paragraph", "content": "The Accounting Officer explained that the system has been reviewed and updated to take into consideration the proper receipt of items into stores, recording of stores items, the issuing of stores and updating of stores records. The 107 th Board meeting also approved the records management manual that will further strengthen the stores management.", "page": 15}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that the stores controls are immediately put to effect to ensure proper inventory management for accountability purposes.", "page": 15}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 15}, {"type": "heading", "level": 3, "content": "AUDITOR GENERAL", "page": 15}, {"type": "paragraph", "content": "20 th December, 2021", "page": 15}, {"type": "paragraph", "content": "16", "page": 15}]