[{"type": "heading", "level": 1, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF KAMPALA CAPITAL CITY AUTHORITY", "page": 0}, {"type": "paragraph", "content": "FOR THE YEAR ENDED 30 TH JUNE 2022", "page": 0}, {"type": "paragraph", "content": "Table of Contents", "page": 1}, {"type": "tableOfContent", "content": ["Table of Contents - ii", "List of Acronyms - iii", "Report of the Auditor General on the audit of financial statements of Kampala Capital City", "Authority for the year ended 30 th June, 2022 - 1", "Opinion - 1", "Basis for Opinion - 1", "Key Audit Matter - 1", "  1.0 Implementation of the Approved Budget - 1", "  2.0 Management of Public land - 6", "Emphasis of Matter - 8", "  3.0 Management of Domestic arrears - 8", "Other matter - 9", "  4.0 Delayed commencement of the Kampala Rehabilitation Project - 9", "  5.0 Nugatory expenditure -Interest on delayed payments: UGX.94,811,339 - 10", "  6.0 Implementation of the Youth livelihood Programme (YLP) - 11", "  7.0 Delay to operationalise the 2019 outdoor advertising ordinance - 11", "  8.0 Human Resource Management - 12", "  9.0 Management of Schools - 13", "  10.0 Review of KCCA Mandate - 13", "Other Information - 14", "Management Responsibilities for the Financial Statements - 15", "Auditor's Responsibilities for the audit of the Financial Statements - 15", "Other Reporting Responsibilities - 16", "Report on the Audit of Compliance with Legislation - 16", "  11.0 Management of Information Technology (IT) Investments in Government - 16", "  12.0 Management of Public Land - 18", "  13.0 Parish Development Model (PDM) - 19", "  14.0 Court Awards and Compensations - 21", "  15.0 Management of Pension and Gratuity - 22"], "page": 1}, {"type": "paragraph", "content": "List of Acronyms", "page": 2}, {"type": "table", "content": [["**ACRONYM**", "**MEANING**"], ["**Bn**", "Billion"], ["**ICT**", "Information Communication Technology"], ["**IESBA**", "International Ethics Standards Board for Accountants"], ["**IFMS**", "Integrated Financial Management System"], ["**INTOSAI**", "International Organization of Supreme Audit Institutions"], ["**ISSAIs**", "International Standards of Supreme Audit Institutions"], ["**KCCA**", "Kampala Capital City Authority"], ["**LGs**", "Local Governments"], ["**MDAs**", "Ministries, Departments and Agencies"], ["**Mn**", "Million"], ["**MoFPED**", "Ministry of Finance, Planning and Economic Development"], ["**NTR**", "Non-Tax Revenue"], ["**PFMA**", "Public Finance Management Act, 2015"], ["**PS/ST**", "Permanent Secretary/Secretary to Treasury"], ["**PPDA**", "Public Procurement and Disposal of Assets"], ["**TI**", "Treasury Instructions,"], ["**UGX**", "Uganda Shillings"]], "page": 2}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE AUDIT OF FINANCIAL STATEMENTS", "page": 3}, {"type": "paragraph", "content": "OF KAMPALA CAPITAL CITY AUTHORITY FOR THE YEAR ENDED 30 TH JUNE, 2022", "page": 3}, {"type": "paragraph", "content": "THE RT. HON. SPEAKER OF PARLIAMENT", "page": 3}, {"type": "heading", "level": 1, "content": "Opinion", "page": 3}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Kampala Capital City Authority (KCCA), which comprise the statement of financial position as at 30 th June 2022, the Statement of financial performance, Statement of changes in Equity and statement of cash flows, together with the notes to the financial statements, including a summary of significant accounting policies.", "page": 3}, {"type": "paragraph", "content": "In my opinion, the accompanying financial statements present fairly, in all material respects, the financial position of Kampala Capital City Authority as at 30 th June 2022 and its financial performance and cash flows for the period then ended, in accordance with the Public Finance Management Act, 2015, as amended, KCCA Act 2010 and International Public Sector Accounting Standards (IPSAS).", "page": 3}, {"type": "paragraph", "content": "Basis for Opinion", "page": 3}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of the Authority in accordance with the Constitution of the Republic of Uganda, 1995 (as amended), the National Audit Act, 2008, the International Organization of Supreme Audit Institutions (INTOSAI) Code of Ethics, the International Ethics Standards Board for Accountants (IESBA) Code of Ethics for Professional Accountants (Parts A and B), and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "paragraph", "content": "Key Audit Matter", "page": 3}, {"type": "paragraph", "content": "activities, service delivery and credibility of the budget. Against this background, budget performance was considered a key audit area during the office-wide planning. I reviewed documents such as work plans, performance reports, conducted interviews and physical inspections to arrive at my findings.", "page": 4}, {"type": "paragraph", "content": "Kampala Capital City Authority is mandated to facilitate delivering of quality services to the people in Uganda’s Capital, City-Kampala.", "page": 4}, {"type": "paragraph", "content": "The entity had an approved budget of UGX.316,890,424,758, of which UGX.316,676,584,628 was warranted. The entity’s key deliverables for the financial year under review were;", "page": 4}, {"type": "heading", "level": 2, "content": "Table: Showing key deliverables for KCCA for the year", "page": 4}, {"type": "table", "content": [["**No**", "**Output**", "**Details**", "**Budget (UGX) “000”**", "**Cumulative % share of the total approved budget**"], ["1", "134937", "Human Resource Development and organizational restructuring", "85,422,751,932", "26.61%"], ["2", "040680", "Urban Road Construction", "53,004,148,872", "42.86%"], ["3", "134940", "Communications and Relations strategies Public", "29,544,878,033", "52.06%"], ["4", "070808", "Secondary (Wage) Education Services", "20,880,694,976", "57.65%"], ["5", "090801", "Policies, development Laws and strategy", "18,544,312,297", "63.24%"], ["", "", "**Total**", "**207,396,786,110**", ""]], "page": 4}, {"type": "paragraph", "content": "I reviewed the implementation of the approved 2021/2022 budget by the entity and noted the following;", "page": 4}, {"type": "table", "content": [["**No**", "**Observation**", null, null, null, null, null, null, "**Recommendation**"], ["1.1", "**Revenue Performance** of GoU receipts** to the approved budget, the entity was supposed to receive UGX.316.89Bn, out of which UGX.316.67Bn was warranted, resulting in a shortfall of UGX.0.22Bn. The shortfall represents 0.07% of the approved budget. further noted that the entity did not seek a revision of its budget and the work plan as provided for by section 17 (3) of the PFMA 2015. I funds that were not warranted were meant for the implementation of the following activities, which were never implemented. **No Out- put** **Activity** 1 134940 Ex-Gratia **Budget Amount (UGX)** 100,400,000 **Purpose** for other Retired and Serving Public servants for Local Government 2 134940 Pension 113,440,000  was meant to provide pay ex- gratia for public servants.   were meant to pay Pension for Local Government Workers  **Total** 213,840,000** **Performance** According The", null, null, null, null, null, null, "I advised the Accounting Officer to always liaise with MoFPED during implementation to ensure that GoU funds are released as planned."], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null]], "page": 4}, {"type": "table", "content": [["Accounting Officer explained that management would continue to engage MoFPED so that all funds are released as planned/appropriated by Parliament. The", null, null, null, null, null, null, null, ""], ["1.2 **Utilisation of warrants** of the total warrants of UGX.313.67Bn received during the financial year, UGX.303.11Bn was spent by the entity resulting in an unspent balance of UGX.13.56Bn representing an absorption level of 95.7%. The unspent funds were swept back to the consolidated fund as required by the PFMA. funds that were not absorbed were meant for the following activities, which were subsequently partially or not implemented at all. **No Out-put Activity Amount (UGX)** 1,734,049,44 6 Payment of general staff salaries for primary teachers 80703- 080703 Primary Health Care Services (Wages) 70808- Secondary Education Services (Wage) Payment general salaries secondary teachers of staff for 3,164,311,47 8 **Reason**  of the Delayed recruitme nt  health workers  by  Health Service Commissio n  Delayed recruitme nt  teachers by  the Education Service Commissio n of **Total** 4,898,360,9 24** a result of failure to absorb funds, the Authority has always had excess funds in these areas, which negates the purpose of budgeting Accounting Officer explained that the responsibility for recruitment, deployment and other human resource management functions, except payroll management for secondary school teachers and staff, rests with the Ministry of Education & Sports (MoES). The Ministry delayed recruiting teachers, which caused the challenge of budget absorption. However, the recruitment process, and the challenge will be resolved soon. the Ministry has initiated addition, KCCA has the budget, and the structure for Health facilities structure needed a review to recruit more staff. KCCA submitted a request for a new structure for health units under KCCA to the Ministries of Health and 1 2 Out The As The In", null, null, null, null, null, null, null, "advised the Accounting Officer to liaise with the Ministry of education and Sports and the Ministry of health to expedite the recruitment of primary school head teachers; secondary school teachers, and health workers in  order to enhance the Authority’s funds absorption and service delivery in these areas. I"], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null]], "page": 5}, {"type": "table", "content": [["", "Public Service. This process took a lot of time to complete, and when the approval was made in February 2022, KCCA submitted a request for recruitment of 42 health workers and concluded.", ""], ["1.3", "could not assess the implementation of all the forty-six (46) outputs worth UGX.316,676,584,628 with 137 activities since they were not fully quantified. was also not provided with the individual Directorate’s work plans to confirm the quantification of outputs. Accounting Officer explained that this was addressed in the FY 2022/2023 and the individual Directorate work plans of FY 2021/2022. I I **Implementation of outputs and activities** The", "I advised the Accounting Officer to always ensure that activities and outputs are quantified to enable Performance measurement."]], "page": 6}, {"type": "paragraph", "content": "1.4", "page": 6}, {"type": "heading", "level": 1, "content": "Delivery of services from implemented activities", "page": 6}, {"type": "paragraph", "content": "I undertook procedures to establish whether activities were undertaken in a timely manner, were of expected quality and quantity, and if citizens were getting the expected services. In addition, I assessed if the works/services were delivered at reasonable costs. Below is a summary of my observations, details of which have been provided as Appendix I.", "page": 6}, {"type": "table", "content": [["**No**", "**Activity details**", "**Total expenditur** **e** “000”** **(UGX)**", "**Summary** **findings** **of**", "**Conclusion** **service delivery** **regarding**"], ["1", "Completed  Phase- 1renovation of a classroom block at Munyonyo", "500,000", " At the time of inspection,  the renovated area had already  developed cracks at the wall and floor.", " The anticipated services from the Admin block will not be achieved due to increasing cracks that could lead to the collapse of the building."], ["2", "Removed  asbestos sheets and renovated 24 classrooms at Kololo SS (Phase 2)", "541,566", " At the time of inspection,  the construction of the 24-classroom block was incomplete, and the classes were not in use.   The other operational classes were not replaced with iron sheets; asbestos was still in existence.", " The anticipated benefit of replacing all classes with iron sheets  the students from danger caused by asbestos may not be achieved that prevent"], ["3", "Renovated a classroom block at Uganda School for the Deaf- Ntinda  the auspices  PIFUD (100% complete) under of", "6,000", " Although management  had painted the classes, the roofs of the classes were leaking and  therefore subjecting the paint to damage", " The anticipated benefit of providing better ambience to the classes may be short- lived since most of the classes painted were leaking and damaging the work already done"], ["4", "Completed renovation works at Luzira C/U Primary School with a donation by the", "68,987", " At the time on of inspection 7 th November 2022, all painted areas had", " The objective of providing face lift to the classes may not be not have been fully met."]], "page": 6}, {"type": "table", "content": [["", "schools' Netherlands friends in", "", "faded because of applying only one coating.", ""], ["5", "Construction of Kiswa Health centre Phase I works.", "1,565,397", " At the time of inspection phase1- works of casting the floor, poles, double shafts and block work purported to have been completed were not yet complete", "months  The anticipated benefit of utilising the facility after the nine  contract provided in the agreement for provision of maternity may not be achieved."], ["6", "Mapped and House Numbers Issued", "120,000", " At the time of audit, the mapping of all houses had not been completed", " The anticipated benefit of easy identification of houses for billing for property rates and ground rent which generate revenue for the authority, may not be achieved soon."], ["7", "93 newly appointed staff with minutes from PSC  issued appointment letters", "436,456", " Recruitment of new staff had not been completed", " The anticipated benefit of providing teaching services may not be achieved soon"], ["8", "Completed Phase 1 construction of MTN Phillip  Omondi stadium.", "4,100,000", " At the time of inspection, the phase- 1 purported to be complete had not been  completed, activities such as the structural  works, columns, slab, stairs and foundation were not complete.", " The the stadium for use to support the club may not be achieved soon due to delayed contract revisions and slow works completion of"], ["9", "Procured 39 office chairs, 14 tables and 5 desks", "2,140,000", " At the time audit the chairs had not been delivered", " The anticipated benefit of utilizing the chairs and tables may not be achieved soon  "], ["10", "Procurement of Road Maintenance equipment.", "547,789", " At the time the of 5 collectors been to the inspection, garbage had distributed divisions. not  The procurement for the 5 tractor trailers and 20 skip containers had not been completed", " The anticipated benefit of utilising the garbage collectors for transportation of garbage may not be realised soon.   The anticipated benefit of utilizing the 5 tractor trailers and 20 skip containers for cleaning the city will not be achieved soon"], ["11", "of and 7 5 for emergency services Procurement ambulances motorcycles provision  medical  contract awarded.", "3,706,210", "the time of inspection,  the ambulances had not yet been distributed to  respective divisions of the city the  At", " Delayed distribution of the ambulances results in a delay in the utilisation of the vehicles by patients"], ["12", "The procurement and Signalization of 30 Junctions and the construction of the Traffic Control centre under JICA  finalized", "3,798,000", " At the time of inspection, the procurement of the 30 Junctions and construction of Traffic Control centre under JICA had not been finalized.", " Delayed installation of the traffic control centres is likely to delay the improvement of traffic management in the City."]], "page": 7}, {"type": "paragraph", "content": "The Accounting Officer pledged to take remedial action as and when funds become available.", "page": 8}, {"type": "paragraph", "content": "I advised the Accounting Officer to expedite the procurement processes such as the revision of Philip Omondi contract, prioritize key activities such as replacing leaking iron sheets in schools and ensure that procured items are distributed on time for efficient and effective service delivery.", "page": 8}, {"type": "paragraph", "content": "2.0", "page": 8}, {"type": "heading", "level": 1, "content": "Management of Public land", "page": 8}, {"type": "paragraph", "content": "Section 45 of the Public Finance and Management Act (PFMA), 2015 (as amended) requires the Accounting Officers to manage the land under their custody. Public land management is the process by which public land resources are properly utilised. Paragraph 16.13.11 of the Treasury Instructions, 2017 requires that a government entity be considered to have control over land only when it has the title.", "page": 8}, {"type": "paragraph", "content": "The current financial reporting framework requires Land to be recognized as Non- produced assets in the statement of financial position (effective 2014) for all reporting entities on both Modified accrual and accrual basis of Accounting. The framework further requires land procured prior to 2014, and where the value cannot be ascertained to be recorded in the memorandum statement to the financial statements.", "page": 8}, {"type": "paragraph", "content": "I observed that Ministries, Departments and Agencies (MDAs), and Local Governments (LGs) have challenges with regard to planning and budgeting, protecting, reporting, utilization and disposal of Public Land. These challenges include; inadequate record keeping, non-compliance to recognition and measurement criteria, loss of entity control due to encroachment and encumbrances, and lack of land titles, among others. These have negatively affected the quality of financial statements and hampered service delivery and fulfilment of entity mandates.", "page": 8}, {"type": "paragraph", "content": "Documents, such as; Laws and Regulations, approved strategic plans, policy statements, budgets, Financial Statements, Asset Registers, Court case files and correspondences, Land titles and lease files, were reviewed. In addition, I interacted with entity management and discussed public land management issues. Furthermore, I physically inspected some of the pieces of land owned by the entities.", "page": 8}, {"type": "table", "content": [["**No**", "**Observation**", "**Recommendation**"], ["**4.4.1 2.2**", "16.6.1 of the Treasury Instructions, 2017 requires the Accounting officer to maintain an electronic or manual register. Furthermore, Instruction 10.12.4 of the Treasury Instructions, 2017 requires all fixed assets acquired to be captured in the fixed asset module of the Government Financial Management Information System (GFMIS)-IFMS. noted that out of the 242 pieces of land measuring approximately 184.818 hectares held, 194 pieces of titled land measuring approximately 147.755 hectares were I **Maintenance of land Register** Instruction", "advised the Accounting Officer to always ensure that all fixed assets acquired by the Authority are captured in the GFMIS Asset module, and the system is updated annually. I"]], "page": 8}, {"type": "table", "content": [["**No**", "**Observation**", "**Recommendation**"], ["recorded in the entity land/assets register. I further noted that the 242 pieces of land measuring approximately 184.818 hectares we’re not recorded in the GFMIS fixed asset module, thus affecting the accuracy of the non- produced assets in the financial statements. incomplete recording of land in the land register affects the entity’s ability to track and monitor all its land and misstatement of the non-produced asset in the statement of financial statements. Accounting Officer explained that effective FY 2022/23, management is using the GFMIS asset module in the IFMS system, and the update was ongoing and would take care of all the assets as advised. The The", "", null], ["**4.4.2 2.3**", "16.13.12 of the Treasury Instructions, 2017 requires that to control an asset, a government entity should be the predominant user of the asset. noted that out of the two hundred forty-two (242) pieces of land measuring approximately 184.818 hectares held, 24 pieces measuring approximately 36.79 hectares (19.6%) valued at UGX.34,664,788,600 had encumbrances in the form of encroachment by the local population. hinder management’s ability to utilize the land and pose a risk of loss of land. Accounting Officer explained that the Authority had no control over matters before Courts of Law, but once the court pronounces itself in management's favour, the Authority would take proper control over the land. I **Encumbrance on Public Land** Instruction Encumbrances The", "advised the Accounting Officer to keep track of the court proceedings to resolve all forms of encumbrances in order to ensure uninterrupted utilization of land for service delivery I"], ["**4.4.3 2.4**", "49 (c) of the Land Act, Cap 227, requires that Uganda Land Commission shall procure certificates of title for any land vested in or acquired by the Government. noted that out of the 184 pieces of land measuring approximately 184.818 hectares the entity held, forty-eight (48) pieces of land measuring approximately 37.755 hectares (20%) did not have land titles. of Land titles may result in encroachment, disputes and loss of public land. response, the Accounting Officer explained that management continued to engage the key stakeholders that support acquiring land titles, especially the Ministry of Lands Housing and Urban Development (MLHUD), and Buganda Land Board, among others, to expedite the process and had submitted a good number of files to the MLHUD pending titling. I **Titling and Transfer** Section Lack In", "advised the Accounting Officer to continue engaging the relevant stakeholders, especially MoLHUD and Buganda Land Board, to ensure that the remaining forty-eight (48) pieces of land are titled. I"]], "page": 9}, {"type": "paragraph", "content": "Emphasis of Matter", "page": 10}, {"type": "paragraph", "content": "Without qualifying my opinion, I would like to draw the readers’ attention to the following matters, which have been disclosed in Notes 10, 12 and 15 of the financial statements of the Authority;", "page": 10}, {"type": "paragraph", "content": "3.0", "page": 10}, {"type": "heading", "level": 1, "content": "Management of Domestic arrears", "page": 10}, {"type": "paragraph", "content": "3.1", "page": 10}, {"type": "heading", "level": 1, "content": "Outstanding Long-term Payables: UGX.42,570,488,999", "page": 10}, {"type": "paragraph", "content": "I noted that the Authority had a long-term liability of UGX.42,570,448,999 on its balance sheet that arose from a development credit agreement entered into on 12 th August 1991 between IDA and KCCA on behalf of Government for the improvement of waste management in the city, production of up-to-date Kampala maps and strengthening of the financial and personnel management systems and services.", "page": 10}, {"type": "paragraph", "content": "This loan has never been serviced, and the outstanding balance of UGX.42,570,488,999 has remained on the KCCA books as an obligation pending clearance even though the Authority does not have the capacity to settle this obligation and the chance of repaying this liability is very remote.", "page": 10}, {"type": "paragraph", "content": "Long outstanding receivables overstate the entity's Payables, misleading the users of the financial statements.", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer stated that the Accountant General had been engaged for the last five (5) years with no conclusive response.", "page": 10}, {"type": "paragraph", "content": "I advised the Accounting Officer to continue following up on the matter with the Accountant General to have this debt written off.", "page": 10}, {"type": "paragraph", "content": "3.2", "page": 10}, {"type": "heading", "level": 1, "content": "Outstanding domestic arrears: UGX.24,986,987,210", "page": 10}, {"type": "paragraph", "content": "Section 21(2) of the Public Finance Management Act 2015 states that a vote shall not take any credit from any local company or body unless it has no unpaid domestic arrears from debts in the previous financial year, and it has the capacity to pay the expenditure from the approved estimates as appropriated by parliament for that financial year. Further, Paragraph 10.9.17 of the Treasury Instructions, 2017 states, an Accounting Officer will ensure that no payments due in any financial year remain unpaid at the end of that year", "page": 10}, {"type": "paragraph", "content": "taken care of in the multiyear planning. However, the risk of litigation continues to worry the Authority.", "page": 11}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that all major works, especially multi-year projects, are allocated sufficient funds to avoid arrears which attract interest on delayed/late payments.", "page": 11}, {"type": "paragraph", "content": "3.3", "page": 11}, {"type": "heading", "level": 1, "content": "Non- remittance of statutory deductions", "page": 11}, {"type": "paragraph", "content": "Paragraph 10.23.1 of the Treasury Instructions 2017 states that Statutory deductions from public officers, where applicable, shall be effected through the payroll and remitted promptly to the respective institutions. Such statutory deductions include Pay as You Earn (PAYE), Local Service Tax (LST), NSSF contributions, and workers’ unions' contributions.", "page": 11}, {"type": "paragraph", "content": "I noted that by the end of the financial year, KCCA made statutory deductions amounting to UGX.4,107,020,986, which had not been remitted to the respective institutions, as shown in the table below.", "page": 11}, {"type": "table", "content": [["**No**", "**Details**", "**Amount UGX**", "**Beneficiary Institution**"], ["1", "PAYE", "2,597,162,249", "URA"], ["2", "WHT", "17,211,198", "URA"], ["3", "NSSF contributions", "1,492,647,539", "NSSF"], ["", "**Total**", "**4,107,020,986**", ""]], "page": 11}, {"type": "paragraph", "content": "Non-remittance of statutory deductions is contrary to the law and exposes the Authority to fines and penalties. In addition, the unremitted NSSF contributions may negatively affect the employees' livelihoods on retirement.", "page": 11}, {"type": "paragraph", "content": "The Accounting Officer explained that management was constrained with the budget to process these outstanding statutory payments but was engaging government to allocate additional funding. In addition, the bulk of the outstanding PAYE and NSSF was related to the June 2022 remittance, which has since been paid. The NSSF for casuals which were not remitted for the most part of the year was caused by delayed registration, with the NSSF part of those have been registered and now paid. Arrangements have been made for the remaining unregistered casual in collaboration with NSSF, and the remittance will be made thereafter.", "page": 11}, {"type": "paragraph", "content": "was responsible for nominating a Project Coordinator acceptable to the Bank for the day-to-day management of the project and constituting a Project Implementation Team (PIT) comprising a Civil Engineer, a Procurement expert, an Accountant, an Environmentalist, and a socio-Economist.", "page": 12}, {"type": "paragraph", "content": "I noted that the project had delays in commencement due to some factors, such as delays in obtaining necessary project approvals and lengthy procurement processes that involved obtaining the Bank no objection and contracts committee approval before advertisement was done. As a result, the project was declared effective upon signing a loan agreement on 11 th May 2021, eleven (11) months after the intended effectiveness date.", "page": 12}, {"type": "paragraph", "content": "Delays in commencing the projects have led to low absorption of funds and non- implementation of planned activities, which have affected the project's overall performance.", "page": 12}, {"type": "paragraph", "content": "The Accounting Officer stated that the project approval process involved other stakeholders, including the Ministry of Finance and the office of the Attorney General, which are beyond KCCA's control. To mitigate the delays after signing the Financing Agreement, however, KCCA secured no objection from the Bank through the MoFPED to conduct an advance procurement for both the supervising consultancy and actual works. In addition, the delay in the procurement was also caused by the impact of the Covid 19 at the beginning of the project implementation period.", "page": 12}, {"type": "paragraph", "content": "However, the project has now taken good strides where 4 out of the five lots of works contracts have been signed and commencement letters issued to begin in early December 2022. Other related projects and sub-projects are also in advanced stages; generally, the project is now on schedule.", "page": 12}, {"type": "paragraph", "content": "I advised the Accounting Officer to fast-track all key project activities to avoid further delays in project implementation. I further advised the Accounting Officer to ensure that the necessary loan documentation is submitted to the loan appraisal unit at MoFPED and subsequently to the respective approval authorities to avoid delays.", "page": 12}, {"type": "paragraph", "content": "The Accounting Officer explained that these payment claims required going through a review process before payment; however, the staffing numbers were too small to handle the volumes of work and efforts to fill the structure through recruitment by PSC were too slow.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to expeditiously conclude the staff recruitment process to enable timely review of payment claims and settlement of approved certificates and invoices.", "page": 13}, {"type": "paragraph", "content": "6.0", "page": 13}, {"type": "heading", "level": 1, "content": "Implementation of the Youth livelihood Programme (YLP)", "page": 13}, {"type": "paragraph", "content": "Chapter 6 of the programme document states that youth groups should repay the loan within one year from receipt of the funds, and thereafter, all un refunded amounts attract a service fee of 5% to cater for inflation. Otherwise, the loan should not exceed three years.", "page": 13}, {"type": "paragraph", "content": "I noted that since the programmes inception, UGX.4,628,647,280 was disbursed to various youth groups in the five divisions of Kampala; however, only UGX.1,046,738,620 has been recovered, representing a recovery rate of 22%. I further noted that some groups have never made any repayment to the tune of UGX.1,291,719,451", "page": 13}, {"type": "paragraph", "content": "Failure to recover funds from the beneficiary groups may lead to the non- achievement of the intended objectives of the revolving fund. This may be attributable to management's lack of commitment to ensure the programmes success.", "page": 13}, {"type": "paragraph", "content": "The Accounting Officer explained that KCCA was committed to follow-up on repayments through; regular monitoring, issuing demand notices and ensuring recovery of funds; however, most groups were affected by COVID-19, but KCCA was working with the leadership of the groups to reschedule the repayments. In addition, low recovery had also been majorly due to mismanagement of funds by the beneficiaries. However, Police has been involved, and some arrests have been made, although the current guidelines and laws are not favorable. For example, those arrested cannot spend more than 48 hours in the police cells. Furthermore, the prosecutions have also had their challenges because of gaps in the guidelines from the Ministry of Gender, so KCCA have brought this to the attention of the mother Ministry/MoGLSD.", "page": 13}, {"type": "paragraph", "content": "Therefore, no collections were made during the year, although the Authority, in the FYR 2019/2020, collected UGX.3,502,864,732 before the court ruling that halted collecting these fees.", "page": 14}, {"type": "paragraph", "content": "Failure to develop and approve regulations on outdoor advertising rates has led to a loss of revenue that would have been collected and used to deliver services to the citizens.", "page": 14}, {"type": "paragraph", "content": "The Accounting Officer explained that a draft Outdoor Advertising Ordinance was prepared with the input of the relevant KCCA technical staff and was presented to the City Executive Committee (CEC), which made their input and thereafter tabled the draft Ordinance to the Authority Council. Council referred the draft to a select committee of Councilors for their detailed review, after which it will be tabled again to the Council for its consideration.", "page": 14}, {"type": "paragraph", "content": "I advised the Accounting Officer to fast-track the approval process of the draft Advertising Ordinance to enable the Authority collect revenue from Outdoor Advertising.", "page": 14}, {"type": "heading", "level": 1, "content": "8.0 Human Resource Management", "page": 14}, {"type": "paragraph", "content": "8.1", "page": 14}, {"type": "heading", "level": 1, "content": "Vacant positions in the Authority", "page": 14}, {"type": "paragraph", "content": "I reviewed the Authority’s organizational structure and noted that out of the approved 1,454 posts, only 825 (56.7%) are filled, leaving 629 posts vacant, representing a staffing gap of 43.3%. The unfilled positions included key personnel in the Authority, such as Manager Fleet and Transport logistics, Manager Human Resource operations, Manager Education Services and Director Engineering and Technical Services, among others.", "page": 14}, {"type": "paragraph", "content": "Lack of key staff in the Organisation affects the performance and overall achievement of the Authority’s goals and objectives, and this negatively affects the level of public service delivery. In addition, the existing staff members may be overworked, leading to demotivation and probable staff turnover.", "page": 14}, {"type": "paragraph", "content": "The Accounting Officer explained that the process of staff recruitment by the Commissions had taken considerable time, and several stakeholders are involved. However, a progress has been made since 2018, and the number of permanent staff has increased by 33% from 558 to 830 staff. Management had made submissions to the Commission to fill some of the vacant critical positions, including recruitment of Senior positions, in line with the Budget allocations.", "page": 14}, {"type": "heading", "level": 1, "content": "9.0 Management of Schools", "page": 15}, {"type": "paragraph", "content": "9.1", "page": 15}, {"type": "heading", "level": 1, "content": "Operation of unlicensed and unregistered schools", "page": 15}, {"type": "paragraph", "content": "Section 32(1) of the Education (Pre-primary, primary and post-primary) Act, 2008 requires any person, community or Organisation before the operation of a new school to obtain permission in form of a provisional license for two years. Furthermore, Section 34 states that if, after two school years, the Permanent Secretary, Chief Administrative Officer or Town Clerk is satisfied that the school provisionally licensed has met all the conditions set in the Act, such a school will be registered.", "page": 15}, {"type": "paragraph", "content": "I reviewed the status of licensing and registration of schools in Kampala and noted the following;", "page": 15}, {"type": "paragraph", "content": "Only 865 out of 1,927 schools were registered with KCCA representing 45%, while 928 schools were not registered and licensed, representing 48%. The balance of 134 schools were provisionally licensed. The provisional licenses for 102 out of the 134 schools had expired (exceeded the two years in operation) and had not been renewed, implying that the schools were operating illegally.", "page": 15}, {"type": "paragraph", "content": "I further noted that except for the schools which were issued closure notices as far back as 2018 but are still operating, other schools had never been issued closure notices by KCCA.  \nThe above inactions affected service delivery, and the education service standards in the city schools are at risk of declining to worrying levels.", "page": 15}, {"type": "paragraph", "content": "The Accounting Officer explained that the challenges are; Schools begin operating before they apply to be licensed and the activity of surveying communities to identify unlicensed schools is intensive, and the rate at which schools are mushrooming beats institutional capacity in terms of available resources.", "page": 15}, {"type": "paragraph", "content": "In addition, schools are licensed provisionally for two years and are licensed if they meet 100% of the basic requirements and minimum standards after two years or are put on an improvement plan. The Authority communicated to all unlicensed schools not to open come 2023, and the responsible Directorate is procuring two dedicated vehicles to improve management capacity.", "page": 15}, {"type": "paragraph", "content": "In the absence of the City Public Accounts Committee, the recommendations of the Internal Audit department, Auditor General and other investigation agencies may not be reviewed and implemented. Under the circumstances, I cannot confirm whether the City's corporate governance structures are adequate and well-functioning.", "page": 16}, {"type": "paragraph", "content": "The Accounting Officer explained that the matter was before council, and names for the PAC membership were proposed and recommended by the City Executive committee to Council, but only one member was pending approval of the Council as vetting was completed.", "page": 16}, {"type": "paragraph", "content": "I advised the Accounting Officer to follow up the matter with the Council so that the current arrangements are expedited, and the City Public Accounts Committee is constituted and operationalized as soon as possible.", "page": 16}, {"type": "heading", "level": 1, "content": "10.2 Failure to prepare implementation report for Kampala Physical Development Plan (KPDP)", "page": 16}, {"type": "paragraph", "content": "In 2013 KCCA started implementing the 10-year Kampala physical development plan recommendations from the consultancy report. The report indicated activity timeliness for short-term (10 years) accomplishments scheduled to end in 2022, as well as long-term accomplishments per development plan III and vision 2040. The short-term activities included; establishing a strong Transport Unit (TU), relocating the main taxi stages (Old and new taxi park) away from the City Centre and protecting and preserving Kampala’s non-degraded wetlands beyond currently urbanized built areas in their natural state, among others.", "page": 16}, {"type": "paragraph", "content": "I noted that it is the final year (expiry of the ten years) of implementing the Consultancy recommendations on KPDP. However, management has not prepared an implementation and evaluation report to evaluate performance.", "page": 16}, {"type": "paragraph", "content": "In the absence of the implementation report, I could not confirm the extent of implementation of the planned activities and the achievement of the intended goals and objectives.", "page": 16}, {"type": "paragraph", "content": "The Accounting Officer indicated that the report to the effect would be in place by the end of FYR 2022/23.", "page": 16}, {"type": "paragraph", "content": "appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information, I am required to report that fact. I have nothing to report in this regard.", "page": 17}, {"type": "paragraph", "content": "Management Responsibilities for the Financial Statements", "page": 17}, {"type": "paragraph", "content": "Under Article 164 of the Constitution of the Republic of Uganda, 1995 (as amended) and Section 45 of the Public Finance Management Act, 2015, the Accounting Officer is accountable to Parliament for the funds and resources of Kampala Capital City Authority (KCCA).", "page": 17}, {"type": "paragraph", "content": "The Accounting Officer is also responsible for the preparation of financial statements in accordance with the requirements of the Public Finance Management Act, 2015 and for such internal control as management determines necessary to enable the preparation of financial statements that are free from material misstatement whether due to fraud or error.", "page": 17}, {"type": "paragraph", "content": "In preparing the financial statements, the Accounting Officer is responsible for assessing the Authority's ability to continue as a going concern, disclosing, as applicable, matters related to going concern and using the going concern basis of accounting, unless the Accounting Officer has a realistic alternative to the contrary.", "page": 17}, {"type": "paragraph", "content": "The Accounting Officer is responsible for overseeing the authority's financial reporting process.", "page": 17}, {"type": "heading", "level": 1, "content": "Auditor's Responsibilities for the audit of the Financial Statements", "page": 17}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor's report that includes my opinion. Reasonable assurance is a high level of assurance but is not a guarantee that an audit conducted in accordance with ISSAIs will always detect a material misstatement, when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.", "page": 17}, {"type": "paragraph", "content": "As part of an audit in accordance with ISSAIs, I exercise professional judgement and maintain professional scepticism throughout the audit. I also;", "page": 17}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 17}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Authority's internal control.", "page": 17}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by the management.", "page": 17}, {"type": "list", "content": "- Conclude on the appropriateness of management's use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material", "page": 17}, {"type": "paragraph", "content": "uncertainty exists related to events or conditions that may cast significant doubt on the Authority's ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor's report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor's report. However, future events or conditions may cause the Authority to cease to continue as a going concern.", "page": 18}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 18}, {"type": "paragraph", "content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 18}, {"type": "paragraph", "content": "I also provide the Accounting Officer with a statement that I have complied with relevant ethical requirements regarding independence and to communicate with them all relationships and other matters that may reasonably be thought to bear on my independence, and, where applicable, related safeguards.", "page": 18}, {"type": "paragraph", "content": "From the matters communicated with the Accounting Officer, I determine those matters that were of most significance in the audit of the financial statements of the current period and are, therefore, the key audit matters. I describe these matters in my auditor's report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 18}, {"type": "paragraph", "content": "Other Reporting Responsibilities", "page": 18}, {"type": "paragraph", "content": "In accordance with Section 19 (1) of the National Audit Act (NAA), 2008, I report to you, based on my work described on the audit of Financial Statements, that; except for the matter raised in compliance with the legislation section below, and whose effect has been considered in forming my opinion on financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 18}, {"type": "paragraph", "content": "operations and services. One of the key programmes of NDP III 2020/21-2024/25 is D i g i tal Transformation, in which Government of Uganda, aims to increase Information, Communication Technology (ICT) penetration and use of digital services for enhancing social and economic development.", "page": 19}, {"type": "paragraph", "content": "As a result of the national prioritization of ICT, I undertook a thematic audit covering three financial years’ expenditure (2019/20 to 2021/22) to scrutinize the management of IT Investments across Government. The overall objective was to assess whether the IT investments in Government are strategically aligned, managed appropriately and focused on achieving the NDP III objective. The procedures undertaken covered: planning and budgeting; procurement, utilization, maintenance and disposal of IT systems; governance; and financial reporting.", "page": 19}, {"type": "paragraph", "content": "For 2021/2022, the entity budgeted for UGX.2,6000,000 to acquire and implement IT systems and equipment and received UGX.2,200,000,000.", "page": 19}, {"type": "paragraph", "content": "A review of ICT activities implemented by the Authority revealed the following;", "page": 19}, {"type": "table", "content": [["**No**", "**Observation**", "**Recommendation**"], ["**11.1**", "**Disposal and Decommissioning of ICT Assets** Paragraph 15.11.1 of the TIs, 2017, PPDA Act, 2003 (as amended) and PPDA Regulations 2014, together with the PFMA, 2015 require MDAs and LGs to efficiently and transparently dispose assets as recommended. However, I noted; Several IT equipment were recommended for disposal by board of survey report but were not disposed off.  **ii.** All IT systems were decommissioned following procedures for data protection as required. The Accounting Officer explained that KCCA had also concluded the Board of Survey exercise, and the obsolete assets, including ICT equipment, have been identified for disposal, and the process is soon to commence. **i.**", "advised the Accounting Officer to expedite the process of disposing of the ICT equipment, per the Board of survey recommendation. I"], ["**11.2**", "**ICT Governance** governance entails leadership, structures, and processes that enable an organization to make decisions to ensure that its IT sustains and extends its strategies and objectives. However, a review of the ICT governance structure of the entity revealed that; **i.** There were no specific structures that steer and oversee ICT implementation at the entity.  **ii.** The entity had an approved IT staff structure in line with the ICT prioritisation in NDP III.  **iii.** The entity had filled only 20 (61%) out of the 33 positions of the ICT staff establishment, leaving 13 positions (39%) vacant; however, all the existing IT staff have the required qualifications.  **iv.** There was no business continuity plan contrary to Section 4.6 of the National Information Security Policy 2014. IT", "advised the Accounting Officer to expedite the process of constituting the ICT Steering Committee and institute governance policies to manage ICT investments in consultation with other stakeholders effectively. I"]], "page": 19}, {"type": "table", "content": [["**No**", "**Observation**", "**Recommendation**"], ["The absence of ICT governance structures hampers the formulation of appropriate ICT policies, strategies and real- time upgrades of ICT interventions. In addition, it may lead to the misalignment of IT investments with the overall entity's strategic objectives. Accounting Officer explained that the Steering Committee was in the process of being constituted. In addition, the business Continuity Planning (BCP) Assessment was completed in December 2020 by a Consultant (PwC). The procurement process for the new service provider has been concluded and is now ready for award. The", "", null], ["**11. 3**", "**Manual/Off-System Statements** **Preparation of Financial** entity did not acquire any system improve accountability and reporting, and I noted that the entity was preparing financial statements manually without any system. to a result, financial statements are prone to errors due to human intervention and manipulation. Accounting Officer explained that the entity prepares two sets of Accounts, i.e. Modified cash and historical cost /accrual basis. However, Accountant General uses the IFMS, but historical cost/ accrual were manually prepared. The As The", "advised the Accounting Officer to acquire an appropriate system for the preparation of financial statements on historical cost since it’s the recommended basis of accounting. I"]], "page": 20}, {"type": "heading", "level": 1, "content": "12.0 Management of Public Land", "page": 20}, {"type": "table", "content": [["**No.**", "**Observation**", "**Recommendation**"], ["**4.4.4 12.1 4.4.5**", "16.13.12 of the Treasury Instructions, 2017 requires that to control an asset, a government entity usually be the predominant user of the asset. noted that out of the 242 pieces of land measuring approximately 184.818 hectares held, 3 pieces of land measuring approximately 1.71 hectares (1%) valued at UGX.9,073,395,190 hectares were not utilized by the entity at the time of audit.  Un-utilized land is susceptible to encroachment. Accounting Officer explained that management was committed to securing vacant land and the process for leasing these properties was ongoing; however, proper due diligence had to be conducted before a lease out of the property, which explains a bit of the delay. I **Utilisation Land for Delivery of Service** Instruction The", "advised the Accounting Officer to expedite the due diligence process to enable leasing out the vacant land for use. I"], ["**4.4.6 12.2 4.4.7**", "**Irregularities in Management of Leased Land** 6 of the Land Regulations, 2004 requires a lease offer made by a Board or the Commission to communicate the offer stating the terms and conditions of the offer conditioned upon payment of fees and other charges, in full Regulation", "advised the Accounting Officer to strengthen internal controls surrounding lease management I"]], "page": 20}, {"type": "table", "content": [["**No.**", "**Observation**", "**Recommendation**"], ["or by instalment. A review of the lease file and MOUs held by the Authority revealed the following;  Two leases for land measuring 0.602 hectares had expired at the time of carrying out this Audit;   One piece of land measuring 0.455 hectares leased out had not been developed as per the conditions of the lease agreement.  Out of the lease rentals of UGX.1.5bn expected in the period under review, the entity only received UGX.620m (41%) hence an under collection of UGX.880m.   No leases for land were renewed without payment of ground rent arrears or development of land as per the lease agreement. potentially lead to loss of revenue and public land. in lease management processes could Accounting Officer explained that all leased properties are subjected to compliance through physical planning, and no extension is approved without a compliance report; however, its normal business for leases to expire; the leasee had complained of encroachment, and management is handling . in regard to lease revenue collection, efforts are being enhanced. Irregularities The", "and ensure that proper lease agreements with clear terms are signed with prospective lessees.", null]], "page": 21}, {"type": "heading", "level": 1, "content": "13.0 Parish Development Model (PDM) 13.1 Budget performance", "page": 21}, {"type": "paragraph", "content": "I reviewed the approved PDM budget allocation for the FYR 2021/2022 and noted that KCCA had an approved budget of UGX.1,556,280,000; out of this, the Authority received UGX.1,537,621,295 (98%) as shown in the table below;", "page": 21}, {"type": "table", "content": [["**S N**", "**Purpose**", "**Budgeted** **(UGX)** **amount**", "**Released** **(UGX)** **amount**", "**Variance (UGX)**"], ["1", "Revolving fund", "0", "0", "0"], ["2", "Administrative costs", "19,800,000", "19,800,000", "0"], ["3", "Gadgets and tools", "990,000,000", "971,341,295", "18,658,705"], ["4", "Staff costs", "546,480,000", "546,480,000", "0"], ["", "**Total**", "**1,556,280,000**", "**1,537,621,295**", "**18,658,705**"]], "page": 21}, {"type": "heading", "level": 1, "content": "13.2 Absorption of funds", "page": 22}, {"type": "paragraph", "content": "I noted that out of the total receipts of UGX.1,537,621,295, UGX.373,611,052 was spent, representing an absorption level of 24.3%, leaving UGX.1,164,010,243 unspent by the year-end.", "page": 22}, {"type": "table", "content": [["**Category**", "**Approved Estimate (A) (UGX billions)**", "**Release (B) (UGX billions)**", "**Expenditure (C) (UGX billions)**", "**Unspent (B-C) billions)** **(UGX**", "**% Absorptio n**"], ["Revolving fund", "0", "0", "0", "0", "0"], ["Administrative costs", "19,800,000", "19,800,000", "19,800,000", "0", "100"], ["Gadgets  and tools", "990,000,000", "971,341,295", "353,811,052", "617,530,243", "36"], ["Staff costs", "546,480,000", "546,480,000", "0", "546,480,000", "0"], ["**Total**", "**1,556,280,00 0**", "**1,537,621,29 5**", "**373,611,05 2**", "**1,164,010,24 3**", ""]], "page": 22}, {"type": "paragraph", "content": "Under absorption of funds results in delayed or non-implementation of the budgeted activities. It also leads to the delayed achievement of the programme goal of total financial inclusion for all Ugandans.", "page": 22}, {"type": "paragraph", "content": "The Accounting Officer explained that the beneficiary SACCOs had not been formed at the end of FY2021/22 because the PDM Secretariat had not yet provided guidelines.", "page": 22}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that all funds are absorbed as per the work plan and, in future, ensure that preliminary activities such as the formation of SACCOs are undertaken before receipt of funds.", "page": 22}, {"type": "heading", "level": 1, "content": "13.3 Failure to transfer funds to the PDM SACCOs", "page": 22}, {"type": "paragraph", "content": "Guideline 3.6.1(c) of the step-by-step guide for rolling out the PDM at the community level issued in May 2022 by the PDM secretariat requires that the funds should be channeled directly to beneficiary PDM SACCO’s accounts.", "page": 22}, {"type": "paragraph", "content": "MoFPED did not release funds to the Authority for the beneficiary PDM SACCO accounts. Delays in establishing the SACCOs caused the non-release of funds to the SACCOs, which affected the commencement of the implementation of the revolving fund.", "page": 22}, {"type": "table", "content": [["**Subject/Area**", "**Areas of Contradiction**"], ["Transfer of funds to PDM SACCO", "**PDM Guidelines by Secretariat** - Funds should go direct to PDM SACCO accounts in commercial banks  **Guidance by PSST** - Funds to be sent to entity General Fund Accounts"], ["Recruitment of Parish Model Chiefs", "KCCA recruited Assistant Ward Administrators for Parish Model on three months contract, which expired on 30 th September 2022, contrary to the recommended three-year contract."]], "page": 23}, {"type": "paragraph", "content": "Contradictory guidance to implementers of PDM causes disharmony and impairs/curtails coordination in implementing PDM activities which will negatively affect the progress of activities.", "page": 23}, {"type": "paragraph", "content": "The Accounting Officer took note of the audit observation.", "page": 23}, {"type": "paragraph", "content": "I advised the Accounting Officer to liaise with the PDM secretariat and review the various guidelines issued and harmonize guidance given to implementers of PDM activities.", "page": 23}, {"type": "heading", "level": 1, "content": "14.0 Court Awards and Compensations", "page": 23}, {"type": "paragraph", "content": "In 2016, government decentralized the payment/retirement of court awards from the Ministry of Justice and Constitutional Affairs (MOLG) to the Ministries, Departments, Agencies, Local governments and State Enterprises (MDALS) responsible for causing the obligations. The decentralization of court awards and compensation was adopted to curb the accumulation of arrears arising from court awards and compensation, starting with obligations for the financial year 2016/2017. However, my preliminary findings indicate that some MDALS’s still accumulate arrears from court awards even after decentralizing the payment/retirement of court awards.", "page": 23}, {"type": "paragraph", "content": "I undertook an assessment to identify risks causing the accumulation of court awards and compensation arrears in government. My initial findings pointed to issues such as; insufficient budget provisions, lack of criteria to guide payments, and lack of registers, among others. Based on the severity of the above risks, the OAG selected court awards and compensation as a focus area for the audit of selected entities for the financial year 2021/2022.", "page": 23}, {"type": "paragraph", "content": "From interviews conducted, management explained that the under-budgeting resulted from budget ceilings for domestic arrears set by the MoFPED during the planning and budgeting cycle.", "page": 24}, {"type": "paragraph", "content": "Failure to provide resources for the settlement of liabilities results in delayed settlement and further accumulation of interest on the outstanding debt.", "page": 24}, {"type": "paragraph", "content": "The Accounting Officer pledged to liaise with the various stakeholders to ensure adequate resources are allocated for the settlement of outstanding liabilities.", "page": 24}, {"type": "paragraph", "content": "I await the outcome of the Accounting Officer’s action to address the matter.", "page": 24}, {"type": "paragraph", "content": "14.2", "page": 24}, {"type": "heading", "level": 1, "content": "Lack of criteria for management of Court awards and compensations", "page": 24}, {"type": "paragraph", "content": "A policy guideline for compensation is an essential tool for a more rational prioritization and promotion of equal treatment and helps to explain decisions on cases that have been prioritised.", "page": 24}, {"type": "paragraph", "content": "I observed that Kampala Capital City Authority does not have formal criteria or guidelines to guide the settlement of court awards and compensations. Such guidelines would indicate priority aspects followed to guide the decision to settle an award, such as settlement criteria, payment/settlement plans, negotiations, first-in- first-out (FIFO), mandamus orders (certificate of orders), Human rights violation cases, public interest cases, and high-interest rate cases, among others.", "page": 24}, {"type": "paragraph", "content": "I further noted that the Authority paid cases without following documented criteria. Therefore, I could not confirm what criteria was being used to guide the settlement of court awards and compensations.", "page": 24}, {"type": "paragraph", "content": "The Accounting Officer explained that the guidelines were to be developed and approved by management by the beginning of the next financial year, 2023/2024.", "page": 24}, {"type": "paragraph", "content": "I advised the Accounting Officer to expedite the process of developing formal guidelines to streamline court awards and compensation management and settlement.", "page": 24}, {"type": "heading", "level": 1, "content": "15.1 Under budgeting for Pension liability: UGX.1,907,163,540", "page": 25}, {"type": "paragraph", "content": "Guideline 53 of the Budget Execution Circular for the FY 2021/2022 states that Accounting Officers are responsible for budgeting, management and payments of salaries, wages, pension, and gratuity under their votes to ensure that all Public Servants and Pensioners are paid by the 28 th day of every month in line with Government Policy.", "page": 25}, {"type": "paragraph", "content": "I noted that during the year, KCCA budgeted UGX.12,303,859,965 for payment of pension and gratuity for the financial year 2021/2022; however, a review of the closing balance of the pension and gratuity arrears revealed that the entity had an unpaid pension and gratuity arrears of UGX.14,211,023,505.", "page": 25}, {"type": "paragraph", "content": "This implies that there was an under budgeting to a tune of UGX.1,907,163,540 as shown in the table below;", "page": 25}, {"type": "heading", "level": 2, "content": "Table: Showing over/under budgeting for Pension expenditure", "page": 25}, {"type": "table", "content": [["**Details**", "**Total Budget (UGX)**", "**Balance FY-2021 (UGX)**", "**Variance (UGX)**"], ["**Pension/Gratuity arrears**", "0", "0", "0"], ["**Pension for the year**", "7,394,692,355", "10,090,095,023", "2,695,402,668"], ["**Gratuity for the year**", "4,909,167,610", "4,120,928,482", "(788,239,128)"], ["**Total**", "**12,303,859,965**", "**14,211,023,505**", ""]], "page": 25}, {"type": "paragraph", "content": "Failure to budget for pension and gratuity exposes the entity to litigation risks. It encourages mischarging of funds appropriated by Parliament, which negatively affects the delivery of services and negates the purpose of budgeting. Additionally, non-payment of pension and gratuity affects the livelihood of retired civil servants.", "page": 25}, {"type": "paragraph", "content": "The Accounting Officer explained that the planning for pensioners has often been done. However, in the period under review, there were more early retirements and death cases than anticipated, which resulted in increased pension payments, affecting the budget. In addition, the Authority has always requested the MoFPED for supplementary budget, and these requests have not been attended to timely many times, the releases from the MoFPED are based on historical figures, and this is usually insufficient", "page": 25}, {"type": "heading", "level": 2, "content": "Table showing absorption of Pension and gratuity funds", "page": 26}, {"type": "table", "content": [["**Approved estimate (A) (UGX billions)**", "**Release/Warr ant (B) (UGX billions)**", "**Expenditure**", "**Unspent**", "", "**% Absorption**"], [null, null, "**(C)** **billions)** **(UGX** 0", "**(B-C) billions)**", "", null], ["**Pension/Gratuity arrears**", null, null, null, "0", "0"], [null, null, null, null, null, null], [null, "", "", "", null, ""], ["**Pension for the year**", "10,090,095,023", "9,746,193,724", "343,901,299", null, "97%"], ["**Gratuity for the year**", "4,120,928,482", "4,120,928,259", "0", null, "0"], ["**Total**", "**14,211,023,5 05**", "**13,867,121,983**", "**343,901,299**", null, "**97%**"], ["", null, "", "", null, ""]], "page": 26}, {"type": "heading", "level": 2, "content": "(UGX", "page": 26}, {"type": "paragraph", "content": "Under absorption of released funds results in non-payment of pensioners, which affects the well-being of the affected pensioners", "page": 26}, {"type": "paragraph", "content": "The Accounting Officer explained that processing pensions requires verification and authentication from various external stakeholders, such as Administrator General for death, and NIRA for birth certificates which consumes time. In addition, there were cases of delays in the process of setting suppliers on the IFMS system.", "page": 26}, {"type": "paragraph", "content": "I advised the Accounting Officer to expedite the process of pension verification and setting up suppliers on IFMS to ensure that all pensioners are paid and on time.", "page": 26}, {"type": "heading", "level": 1, "content": "15.3 Timely access to the pension payrolls", "page": 26}, {"type": "paragraph", "content": "Paragraph 5.1 of establishment notice no. 1 of 2020 requires responsible officers to initiate and complete the processing of retirement benefits within six months of the mandatory retirement date. In case of death or early retirement, the process should be initiated immediately after the Letters of Administration are issued and/or the early retirement has been granted.", "page": 26}, {"type": "paragraph", "content": "I noted that thirty-two (32) pensioners were delayed accessing the pension payroll. The average delay was 119 days; some pensioners sometimes delayed for more than 300 days. Delayed access to the pension payroll denies retirees their pension and may result in unspent pension funds and accumulation of pension arrears.", "page": 26}, {"type": "heading", "level": 1, "content": "15.4 Payment of Pensioners without life certificates", "page": 27}, {"type": "paragraph", "content": "Paragraph 6.8 of Establishment notice no 3 of 2020 issued by the Ministry of Public Service states that responsible Officers must ensure that all pensioners on the payroll annually fill out life certificates before effecting payment. In case the survivors are entitled to benefits in accordance with the law, this category of survivors should also produce death certificates, letters of administration, and an estate account certified by the bank.", "page": 27}, {"type": "paragraph", "content": "I reviewed the Authority’s pensioners’ personal files and noted that twenty-five (25) pensioners above the age of 75 had no updated life certificates on their files to confirm their existence and justification for pension payment.", "page": 27}, {"type": "paragraph", "content": "Without these documents, I could not verify and confirm whether the Authority is paying bona fide pensioners.", "page": 27}, {"type": "paragraph", "content": "The Accounting Officer explained that the Authority always undertakes verification of pensioners every year to ensure that life certificates are obtained, until 2019, when COVID-19 made it impossible to undertake verification of pensioners. However, in May 2022, KCCA started the process, and over 95% of the pensioners have been verified and obtained a life certificate. The remaining few that had challenges of movements and those not reached were being followed up.", "page": 27}, {"type": "paragraph", "content": "I advised the Accounting Officer to expedite the follow-up of all unverified pensioners and send/circulate reminders to enable them to file their updated life certificates with the Authority as soon as possible.", "page": 27}, {"type": "paragraph", "content": "John F. S. Muwanga", "page": 27}, {"type": "heading", "level": 1, "content": "AUDITOR GENERAL", "page": 27}, {"type": "paragraph", "content": "Kampala  \n27 th December, 2022", "page": 27}, {"type": "heading", "level": 1, "content": "Appendices Appendix I: Delivery of services from implemented activities", "page": 28}, {"type": "table", "content": [["**No**", "**Activity inspected**", "**Total expenditure UGX “000”**", "**Summary of findings**", "**Pictorial evidence from Inspections**", ""], ["1", "Completed  Phase- 1renovation of a classroom block at Munyonyo", "500,000", " At the time of area inspection, the renovated  already developed cracks at the wall and floor. had", "Renovated wall developing cracks as the door", null], ["2", "Removed asbestos sheets and renovated 24 classrooms  at Kololo SS (Phase 2)", "541,566", " At the time of inspection, the construction of the 24-classroom block was not complete and the classes were not in use.   The other classes in use were not replaced with iron sheets. The classes still had the old asbestos roofing’s.", "Kololo school still undergoing construction", "Kololo classes with asbestos still on the roof"]], "page": 28}, {"type": "paragraph", "content": "26", "page": 28}, {"type": "table", "content": [["3", "Renovated  a classroom block at Uganda School for the Deaf- Ntinda under the auspices  of PIFUD  (100% complete", "6,000", "  the classes, Although management had painted  the classes were leaking and hence damaging the painted walls.", "Ntinda school of the deaf painted but with leaking roof.", ""], ["", "Completed renovation works at Luzira C/U Primary School with a donation by the schools friends  in Netherlands", "68,987", " At time of inspection 7 th November 2022, all painted areas had lost color because of application of only one coating", "", ""], ["", "Construction of Kiswa  Health centre Phase I works  were 100% Completed", "1,565,397", " At the time of inspection phase 1- works of casting the floor, poles, double shafts and block work purported to have been completed were not yet complete", "Kiswa health centre three first level without columns", "Partitioning wall, which is part of first phases have not been completed"]], "page": 29}, {"type": "paragraph", "content": "27", "page": 29}, {"type": "table", "content": [["", "Completed Phase 1 construction of MTN  Phillip Omondi stadium.", "4,100,000", " At the time of inspection, the phase 1 purported to have been completed had not been completed, activities such as the structural works, columns, slab, stairs and foundation were not complete.", "", "", "", "Entrance to the stadium. The delay to complete may lead to delayed utilization of the stadium for the generation of revenue for the club."], [null, null, null, null, "Phillip Omondi stadium still undergoing first phase of construction", null, null, null]], "page": 30}, {"type": "paragraph", "content": "28", "page": 30}]