[{"type": "heading", "level": 4, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF MULTINATIONAL: UGANDA/RWANDA; BUSEGA-MPIGI AND KAGITUMBA –KAYONZA -RUSUMO ROADS PROJECT (ID No: P-ZI-DB0-105; LOAN No.2100150035493) IMPLEMENTED BY UGANDA NATIONAL ROADS AUTHORITY FOR THE FINANCIAL", "page": 0}, {"type": "paragraph", "content": "YEAR ENDED 30 TH JUNE 2021", "page": 0}, {"type": "heading", "level": 2, "content": "OFFICE OF THE AUDITOR GENERAL", "page": 0}, {"type": "heading", "level": 2, "content": "UGANDA", "page": 0}, {"type": "heading", "level": 2, "content": "TABLE OF CONTENTS", "page": 1}, {"type": "tableOfContent", "content": ["Opinion - 4", "Basis for Opinion - 4", "Key Audit Matters - 4", "Other Matter - 4", "Slow progress in Construction works and accumulation of loan charges - 4", "Failure to procure or produce and supply Prefabricated Pipe Culvert Units to the project - 5", "Delayed payments to the Contractor - 5", "Delayed possession of site and land take over - 6", "Reallocation of GOU Counterpart funding - 7", "Other Information - 7", "Management’s Responsibility for the Financial Statements - 8", "Auditor’s Responsibilities for the Audit of the Financial Statements - 8"], "page": 1}, {"type": "paragraph", "content": "LIST OF ACRONYMS", "page": 2}, {"type": "table", "content": [["**Acronym**", "**Meaning**"], ["**AfDB**", "African Development Bank"], ["**GoU**", "Government of Uganda"], ["**IESBA**", "International Ethics Standards Board for Accountants"], ["**ISAIs**", "International Standards on Auditing"], ["**IPC**", "Interim Payment Certificate"], ["**MoFPED**", "Ministry of Finance, Planning and Economic Development"], ["**NAA**", "National Audit Act"], ["**OAG**", "Office of the Auditor General"], ["**PAPs**", "Project Affected Persons"], ["**ROW**", "Right of Way"], ["**UGX**", "Uganda Shilling"], ["**UNRA**", "Uganda National Roads Authority"], ["**USD**", "United States Dollars"]], "page": 2}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF MULTINATIONAL: UGANDA/RWANDA; BUSEGA-MPIGI AND KAGITUMBA – KAYONZA – RUSUMO ROADS PROJECT ID NO: P-ZI-DB0-105; LOAN NO:", "page": 3}, {"type": "paragraph", "content": "2100150035493 FOR THE YEAR ENDED 30 TH JUNE, 2021", "page": 3}, {"type": "heading", "level": 2, "content": "THE RT. HON. SPEAKER OF PARLIAMENT", "page": 3}, {"type": "heading", "level": 2, "content": "Opinion", "page": 3}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Multinational: Uganda/ Rwanda; Busega – Mpigi and Kagitumba – Kayonza – Rusumo Roads Project implemented by Uganda National Roads Authority (UNRA); Project ID No: P-ZI-DB0-105; Loan No: 2100150035493 for the year ended 30 th June 2021. These financial statements comprise the Statement of Income and Expenditure, Statement of Financial Position for the year then ended and notes to the financial statements, including a summary of significant accounting policies and other explanatory notes.", "page": 3}, {"type": "paragraph", "content": "In my opinion, the accompanying financial statements present fairly in all material respects the financial position of Multinational: Uganda/ Rwanda; Busega – Mpigi and Kagitumba – Kayonza", "page": 3}, {"type": "list", "content": "- Rusumo Roads Project ID No:P-ZI-DB0-105; Loan No: 2100150035493 as at June 30, 2021 and its financial performance for the year then ended in accordance with the basis of accounting described under the Notes (section 8.0) to the financial statements and the terms and conditions of the AfDB Financing Agreement.", "page": 3}, {"type": "heading", "level": 2, "content": "Basis for Opinion", "page": 3}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards on Auditing (ISAs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of Project Management in accordance with the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act 2008, the International Ethics Standards Board for Accountants’ Code of Ethics for Professional Accountants (IESBA Code) together with the ethical requirements that are relevant to my audit of the financial statements in Uganda, and I have fulfilled my other ethical responsibilities in accordance with these requirements and the IESBA Code. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "heading", "level": 2, "content": "Key Audit Matters", "page": 3}, {"type": "paragraph", "content": "Key audit matters are those matters that, in my professional judgment, are of most significance in my audit of the financial statements of the period. I have determined that there are no Key Audit Matters to communicate in my report.", "page": 3}, {"type": "heading", "level": 2, "content": "Other Matter", "page": 3}, {"type": "paragraph", "content": "I consider it necessary to communicate the following matters other than those presented or disclosed in the Financial Statements:", "page": 3}, {"type": "paragraph", "content": "1.0", "page": 3}, {"type": "heading", "level": 2, "content": "Slow progress in Construction works and accumulation of loan charges", "page": 3}, {"type": "paragraph", "content": "I noted that as of June 30 th 2021, the contractor had only achieved 3.42% against 29.18% planned cumulative progress. The total time lapse since commencement of the construction works was 19 months constituting 64.01% of the total contract duration yet only 3.42% construction work had been achieved.", "page": 3}, {"type": "paragraph", "content": "Slow progress in Construction works has led to continued accumulation of both Commitment and Service Charges that amounted to UGX 3,224,867,623 and UGX 7,140,345,245 respectively as at the reporting date.", "page": 4}, {"type": "paragraph", "content": "The Accounting Officer explained that the project was constrained by a number of challenges that affected the progress of works, that is; the project commenced during the outbreak of COVID 19 and this affected mobilization of the contractor’s resources such as equipment and personnel to undertake the works. However, following the lifting of global lockdown restrictions in October 2020 the contractor has substantially mobilized the required equipment and personnel for the project. The Accounting Officer further explained that the design review delayed the progress of works because the road was realigned to improve functionality of the expressway and minimizing conflict with existing infrastructure such as the Kampala - Kasese Railway Right Of Way (ROW) and disruption of community settlements.", "page": 4}, {"type": "paragraph", "content": "I advised Management to ensure that construction works by the contractor follows the approved work programme to avoid further project delays and the possibility of commencing the loan repayment charges before completion and operation of the project.", "page": 4}, {"type": "paragraph", "content": "2.0", "page": 4}, {"type": "heading", "level": 2, "content": "Failure to procure or produce and supply Prefabricated Pipe Culvert Units to the project", "page": 4}, {"type": "paragraph", "content": "I noted that production of the Prefabricated Pipe Culvert Units has not yet commenced. According to the progress report No.16 of June, 2021, “the consultant noted that the contractor had been trying to produce on Site Prefabricated Pipe Culvert Units despite repeated failures to achieve the minimum crushing load requirement”.", "page": 4}, {"type": "paragraph", "content": "In the month of April 2021, the contractor succeeded in producing a sample pipe culvert with an internal diameter of 1200mm which could satisfy the minimum crushing load requirement. However, production of the pipe culvert units has not commenced despite the consultant’s advice to produce the same or procure from a reputable factory. The project requires an estimated total of 1,829m length of pipe culvert units.", "page": 4}, {"type": "paragraph", "content": "The contractor could not progress through pipe culvert installation due to lack of produced or procured pipe culverts, which will ultimately affect the project completion time.", "page": 4}, {"type": "paragraph", "content": "The Accounting Officer explained that the contractor has been instructed to procure factory produced pipe culverts from reputable manufacturers in accordance sub-clause 2203 of the General Specifications. In the alternative, the contractor must demonstrate that he is able to consistently produce pipe culverts on site complying with the contract specifications i.e., BS 5911-1:2002 and BS EN 1916:2002 or BS 5911-110:1992. The Accounting Officer further explained that these instructions have been issued to the contractor.", "page": 4}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that the contractor either procures or produces and supplies to the project pipe culvert units that meet the quality requirement.", "page": 4}, {"type": "paragraph", "content": "3.0", "page": 4}, {"type": "heading", "level": 2, "content": "Delayed payments to the Contractor", "page": 4}, {"type": "paragraph", "content": "I observed that on 2 nd June 2021, the contractor issued IPC No. 3 amounting to UGX 8,303,000,336 which was unpaid by 30 th June, 2021 and interest on the late payment was due to commence on 28 th July 2021. During a meeting with the Project consultant on 6 th October, 2021; I was informed that the contractor submitted a Notice of Claim for", "page": 4}, {"type": "paragraph", "content": "Reduced Rate of Work due to delayed payment of IPC No. 3. The payment for IPC No. 3 was made on 17 th September, 2021 after the due date and it is likely that the contractor will succeed in its claim in accordance with clause 14.8.1 and 14.7.1(b) of the General Conditions to the Contract Agreement.", "page": 5}, {"type": "paragraph", "content": "Delayed payments to contractors attract penalties in form of interests on late payments. In addition, delayed payments negatively impact on the contractor’s activities and therefore causing the construction progress to lag behind the contractor’s construction work schedule.", "page": 5}, {"type": "paragraph", "content": "The Accounting Officer explained that this delay was an exceptional case. COVID-19 restrictions reduced UNRA’s usual close interaction with the team at MOFPED which resulted in bouncing the withdrawal applications out of a misunderstanding of reference numbers used and hence the delay in effecting the payment.", "page": 5}, {"type": "paragraph", "content": "I advised UNRA Management to put in place a mechanism that ensures speedy processing of payments to the contractor.", "page": 5}, {"type": "paragraph", "content": "4.0", "page": 5}, {"type": "heading", "level": 2, "content": "Delayed possession of site and land take over", "page": 5}, {"type": "paragraph", "content": "I noted that as of 30 th June, 2021, land acquisition was at 54.8% or 14.605 km of the main expressway where access to and possession was granted. It is to be noted that 100% access to and possession should have been formally handed over after 18 months (that is; 22 nd May 2021) from commencement. Access to and possession were granted in stages where 34% of the main expressway (9.1 kilometres from Km 26+500 – Km 35+605) was granted at commencement date of the project. Another 5.1 km, from Km 21+000 to Km 26+100, were handed over to the contractor on the 10 th September,", "page": 5}, {"type": "list", "content": "2021. Then, another 0.4 km was handed over on 19 th April 2021. By 30 th June, 2021; there were a number of obstructions in the possessed section that made it difficult for the contractor to perform construction activities smoothly.", "page": 5}, {"type": "paragraph", "content": "The Contractor was advised by Management to work around the encumbrances in the possessed sections. However, the work programme and construction activities are clearly affected by the obstructions and the delayed handover. Some of the challenges related to site access are summarized below;", "page": 5}, {"type": "table", "content": [["**Name of PAP/Category**", "**Chainage**", "**Side**", "**Concern**"], ["Ssengooba Johnson", "km 24+820", "RHS", "PAP Not yet compensated"], ["Ddungu Robert", "Km 24+860", "RHS", "PAP Not yet compensated"], ["Water Resource", "Km 25+080", "RHS", "Not relocated"], ["Water Resource", "Km 25+180", "LHS", "Not relocated"], ["Nabukalu cultural tree and garden", "Km 25+620-660", "RHS", "Not yet paid case still in court"], ["Pine trees and Land", "Km27+700-910", "FW", "Not yet compensated"], ["House, garden, trees, land, grave & toilet", "IC4 & link road 4", "FW", "Number of land issues not yet resolved"], ["Ssemuyoba Tonny", "Km 32+300", "LHS", "PAP Not yet compensated"], ["Ahmed Kaboggoza", "Near Km 32+600", "LHS", "PAP Not yet compensated"], ["House", "km 32+820", "RHS", "PAP Not yet compensated"], ["Lule Aramanzani", "Km 32+920", "RHS", "PAP Not yet compensated"], ["House, Land, Garden, Trees, Grave and Toilet", "Km33+020-280", "RHS", "Number of land issues not yet resolved"], ["House, Land, Garden,", "IC5", "FW", "Number of land issues not yet resolved"], ["House, Land, Garden, shop, Grave and Toilet", "Km35+240 - End", "LHS", "Number of land issues not yet resolved"]], "page": 5}, {"type": "paragraph", "content": "Delayed handover of access to and possession of project site land to the contractor has negatively impacted on the contractor’s activities and will ultimately negatively affect the project completion time.", "page": 6}, {"type": "paragraph", "content": "The Accounting Officer explained that PAPs with disputes could not be paid as UNRA awaits court resolution of the matters. The Accounting Officer explained that she has made application to have monies deposited in court in order to allow works proceed unhindered. Court hearing on the matters is awaited.", "page": 6}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that project site land issues are resolved and 100% access to and possession of project site land is granted to the contractor.", "page": 6}, {"type": "paragraph", "content": "5.0", "page": 6}, {"type": "heading", "level": 2, "content": "Reallocation of GOU Counterpart funding", "page": 6}, {"type": "paragraph", "content": "During the audit, I noted that UNRA reallocated GOU counterpart funding to other projects for the year ended 30 th June, 2021 as shown below;", "page": 6}, {"type": "table", "content": [["", "**30-Jun-21**", null, null, null], ["**UGX**", "", "**USD**", "", null], ["GOU - Releases to the project during the year", "51,951,087,621", "", "14,384,369", ""], ["Re-allocations to other projects", "(1,956,237,995)", "", "(557,371)", ""], ["**GOU Counterpart funding to the project**", "**49,994,849,626**", "", "**13,826,999**", ""]], "page": 6}, {"type": "paragraph", "content": "I did not verify the reasonableness of the supporting documents in relation to the re- allocated expenditures.", "page": 6}, {"type": "paragraph", "content": "Reallocations of the project’s funds to other projects may lead to delays in compensation of the PAPs which negatively impact on the contractor’s activities and therefore causing the construction progress to lag behind the contractor’s work schedule.", "page": 6}, {"type": "paragraph", "content": "The Accounting Officer explained that in order to meet Government counterpart obligations, a budget estimate is provided. However, some funds remained unspent at the end of the Financial Year due to external constraints during budget execution. In consultations with the Ministry of Finance, the excess funds were reallocated to other projects that had funding deficit.", "page": 6}, {"type": "paragraph", "content": "I advised that Management should always ensure that GOU Project counterpart funding is spent on the intended purpose to avoid unnecessary delays in the contractor’s construction work that can lead to delays in the completion of the project.", "page": 6}, {"type": "heading", "level": 2, "content": "Other Information", "page": 6}, {"type": "paragraph", "content": "Management is responsible for the other information. The other information comprises the Annual Report. The other information does not include the financial statements and my audit report thereon. My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 6}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact.", "page": 6}, {"type": "paragraph", "content": "I have nothing to report in this regard.", "page": 7}, {"type": "heading", "level": 2, "content": "Management’s Responsibility for the Financial Statements", "page": 7}, {"type": "paragraph", "content": "Management is responsible for the preparation and fair presentation of the Project financial statements in accordance with the in accordance with Government of Uganda and African Development Bank Guidelines, and the basis of accounting as described under note 8.0 to the financial statements and for maintenance of such internal controls as management determines is necessary for the preparation and fair presentation of the Project financial statements that are free from material misstatement, whether due to fraud or error.", "page": 7}, {"type": "paragraph", "content": "In preparing the financial statements, Management is responsible for assessing the Project’s ability to achieve its core objectives, disclosing, as applicable, matters related to the achievement of its objectives, unless management either intends to close the project or to cease operations, or have no realistic alternative but to do so.", "page": 7}, {"type": "paragraph", "content": "Management is responsible for overseeing the Project’s financial reporting process.", "page": 7}, {"type": "heading", "level": 2, "content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 7}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISAs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.", "page": 7}, {"type": "paragraph", "content": "As part of an audit in accordance with ISAs, I exercise professional judgment and maintain professional skepticism throughout the audit. I also:", "page": 7}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 7}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Project’s internal control.", "page": 7}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by management.", "page": 7}, {"type": "list", "content": "- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Project’s ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Project to fail to deliver on its mandate.", "page": 7}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 8}, {"type": "paragraph", "content": "I communicate with Management regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 8}, {"type": "paragraph", "content": "I also provide Management with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with him/her all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 8}, {"type": "paragraph", "content": "From the matters communicated with the Management, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 8}, {"type": "heading", "level": 2, "content": "Other Regulatory and Reporting Requirements", "page": 8}, {"type": "paragraph", "content": "I consider it necessary to communicate the following matters other than those presented or disclosed in the financial statements:", "page": 8}, {"type": "heading", "level": 2, "content": "Compliance with the Provisions of the Loan Agreement Obligations", "page": 8}, {"type": "paragraph", "content": "UNRA complied with the loan agreement covenants. I have obtained all the information and explanations, and all expenses were eligible.", "page": 8}, {"type": "heading", "level": 2, "content": "GoU Counterpart Funding", "page": 8}, {"type": "paragraph", "content": "I confirm that the Government of Uganda has fulfilled its counterpart obligations of the project for the year ended 30 th June 2021.", "page": 8}, {"type": "heading", "level": 2, "content": "Internal Controls", "page": 8}, {"type": "paragraph", "content": "As part of my audit scope and in accordance with International Standards on Auditing, I considered internal controls relevant to UNRA in the preparation and fair presentation of Uganda/ Rwanda; Busega – Mpigi and Kagitumba – Kayonza – Rusumo Roads Project financial statements for the year ended 30 th June 2021, in order to design audit procedures that are appropriate. Other than the matters referred to in the report, the Internal Control structure for Uganda/ Rwanda; Busega – Mpigi and Kagitumba – Kayonza – Rusumo Roads Project, was found to be appropriate.", "page": 8}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 8}, {"type": "heading", "level": 2, "content": "AUDITOR GENERAL", "page": 8}, {"type": "paragraph", "content": "09 th December, 2021", "page": 8}, {"type": "heading", "level": 2, "content": "APPENDIX I FINANCIAL STATEMENTS", "page": 10}]