[{"type": "heading", "level": 5, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL", "page": 0}, {"type": "paragraph", "content": "ON THE FINANCIAL STATEMENTS OF KALANGALA DISTRICT", "page": 0}, {"type": "heading", "level": 1, "content": "LOCAL GOVERNMENT", "page": 0}, {"type": "paragraph", "content": "FOR THE YEAR ENDED 30 TH JUNE 2019", "page": 0}, {"type": "heading", "level": 1, "content": "OFFICE OF THE AUDITOR GENERAL UGANDA", "page": 0}, {"type": "paragraph", "content": "Table of Contents", "page": 1}, {"type": "tableOfContent", "content": ["List of Acronyms - iii", "Opinion - 1", "Basis for Opinion - 1", "Key Audit Matters - 1", "  1.0 Implementation of Budget approved by Parliament - 1", "Other Information - 4", "Management’s Responsibility for the Financial Statements - 4", "Auditor’s Responsibility - 4", "Other Reporting Responsibilities - 5", "Report on the Audit of Compliance with Legislation - 5", "  2.0 Implementation of Uganda Inter-Governmental Fiscal Transfer Programme - 5", "  3.0 Uganda Road Fund - 6", "  4.0 Implementation of the Youth Livelihood Program - 8", "APPENDICES: - 12", "Appendix 1: Partially Implemented Development Infrastructure in Education Sector - 12", "Appendix 2: Comparison of approved annual budget with outputs – URF - 13", "Appendix 3: Low recovery of YLP funds - 14"], "page": 1}, {"type": "paragraph", "content": "List of Acronyms", "page": 2}, {"type": "table", "content": [["CoC", "Certificates of Compliance"], ["GoU", "Government of Uganda"], ["IESBA", "International Ethics Standards Board for Accountants"], ["INTOSAI", "International Organisation of Supreme Audit Institutions"], ["ISSAIs", "International Standards of Supreme Audit Institutions"], ["LGFAM", "Local Government Financial and Accounting Manual"], ["NDP", "National Development Plan"], ["NPA", "National Planning Authority"], ["NUSAF", "Northern Uganda Social Action Fund"], ["PFMA", "Public Finance Management Act"], ["TSA", "Single Treasury Account"], ["TSSA", "Sub Single Treasury Account"], ["UgIFT", "Uganda Intergovernmental Fiscal Transfers Program for Results"], ["UGX", "Uganda Shillings"], ["URF", "Uganda Road Fund"]], "page": 2}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL", "page": 3}, {"type": "paragraph", "content": "ON THE FINANCIAL STATEMENTS OF KALANGALA DISTRICT", "page": 3}, {"type": "heading", "level": 1, "content": "LOCAL GOVERNMENT", "page": 3}, {"type": "paragraph", "content": "FOR THE YEAR ENDED 30 TH JUNE 2019", "page": 3}, {"type": "heading", "level": 1, "content": "THE RT. HON. SPEAKER OF PARLIAMENT", "page": 3}, {"type": "heading", "level": 1, "content": "Opinion", "page": 3}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Kalangala District Local Government, which comprise the Statement of Financial Position as at 30 th June 2019, the Statement of Financial Performance, Statement of Changes in Equity, Statement of Cash Flows, together with other accompanying statements for the year then ended, and notes to the financial statements, including a summary of significant accounting policies.", "page": 3}, {"type": "paragraph", "content": "In my opinion, the financial statements of Kalangala District Local Government for the year ended 30 th June 2019 are prepared, in all material respects, following section 51 of the Public Finance Management Act (PFMA), 2015 and the Local Government Financial and Accounting Manual (LGFAM), 2007.", "page": 3}, {"type": "paragraph", "content": "Basis for Opinion  \nI conducted my audit following the International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of the District following the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act, 2008, the International Organisation of Supreme Audit Institutions (INTOSAI) Code of Ethics, the International Ethics Standards Board for Accountants’ Code of Ethics for Professional Accountants (IESBA Code) and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my ethical responsibilities following the other requirements and the IESBA Code. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "paragraph", "content": "Key Audit Matters  \nKey audit matters are those matters that, in my professional judgment, were of most significance in my audit of the financial statements of the current period. These matters were addressed in the context of my audit of the financial statements as a whole, and when forming my opinion thereon, and I do not provide a separate opinion on these matters.", "page": 3}, {"type": "paragraph", "content": "I have determined the matters described below as the key audit matters to be communicated in my report:", "page": 3}, {"type": "paragraph", "content": "1.0", "page": 3}, {"type": "heading", "level": 1, "content": "Implementation of Budget approved by Parliament", "page": 3}, {"type": "paragraph", "content": "It has been observed over years that activities that are planned and budgeted for by Local Governments are either poorly implemented or not implemented at all, which affects service delivery, the improvement of the people’s wellbeing and the country’s ability to attain the National Development Plan (NDP) II goals. Also, there have been increased requests from Parliament, Local Leaders and the citizenry in general for special audits, all pointing to the ineffective implementation of various programmes. I, therefore, considered the risk that there may be challenges in budget and programme implementation.", "page": 3}, {"type": "paragraph", "content": "It is against this background that budget implementation was considered as a key audit matter for the audit year. The focus was on the attainment of planned outputs,", "page": 3}, {"type": "paragraph", "content": "which greatly affect the wellbeing of communities and have a bearing on the attainment of programme objectives.", "page": 4}, {"type": "paragraph", "content": "Consequently, I developed specific audit procedures to;", "page": 4}, {"type": "list", "content": "- Establish the revenue performance for the year under review (extent of revenue collection, including local revenue).\n- Ascertain the extent of absorption of released funds, including conditional grants and donor funds.\n- Assess the extent of attainment of key planned outputs.", "page": 4}, {"type": "paragraph", "content": "Based on the procedures performed, I made the following observations;", "page": 4}, {"type": "table", "content": [["**Issue/Observation**", null, null, null, null, null, null, null, "**Recommendation**"], ["**1.0 Budget performance**", null, null, null, null, null, null, null, ""], ["**1.1 Revenue Performance**  I advised the", null, null, null, null, null, null, null, null], ["Accounting Officer to engage the relevant ministries and  the development partners to honour their  obligations and  initiate measures to ensure that all budgeted local  is realised. revenue Paragraph 3.3(1) of the Local Government Financial and Accounting Manual (LGFAM), 2007, under budget principles guides that estimates must reflect revenue, which can be realized from anticipated conditions. Paragraph 3.4.1(4) further requires realistic revenue forecasting as a precondition for successful budgeting. I reviewed the Statement of Appropriation account and noted that out of the budgeted total revenue of UGX.19,419,741,000, for the year 2018/2019, only UGX.15,247,976,182 was realized representing a performance of 79% of the target. The performance of each revenue source is summarised in the **table** below;", null, null, null, null, null, null, null, null], ["**No Revenue Source**", null, "**Revised**", null, "**Warrants/Releases**", "**Variance (UGX) % of**", null, "or", null], [null, null, "**Approved**", null, "**(UGX)** performance**", null, null, null, null], [null, null, "**Budget (UGX)**", null, null, null, null, null, null], ["1 Local 922,565,000 643,692,878 278,872,122 70 Revenue", null, null, null, null, null, null, null, null], ["2 Central 10,123,770,000 8,196,133,805 1,927,636,195 81 Government  Grants", null, null, null, null, null, null, null, null], ["3 Donor Funds 6,883,274,000 5,538,137,727 1,345,136,273 80", null, null, null, null, null, null, null, null], ["4 Transfers 1,490,132,000 870,011,772 620,120,228 58 received from  other  Government  Units", null, null, null, null, null, null, null, null], ["**Total**", null, "**19,419,741,000**", null, "**15,247,976,182**", "**4,171,764,818** 79**", null, null, null], ["table above indicates under-performance in all sources of revenue. Consequently, major planned activities/outputs remained unimplemented or partially implemented; as summarized in the **Table** below. The", null, null, null, null, null, null, null, null], ["**Lot No**", "**Activity/output Contract Sum Cumulative Certificates**", null, null, null, null, "**Value of Un-**", null, null], ["**(UGX) Paid (UGX)**", null, null, null, null, null, "**implemented Works**", null, null], [null, null, null, null, null, null, "**(UGX)**", null, null], ["Construction of Staff houses & Pit Latrines 1 653,623,498 220,208,916 433,414,582", null, null, null, null, null, null, null, null], ["Construction of Staff houses, dormitory, kitchen & Pit Latrines 2 847,131,642 468,669,393 378,462,249", null, null, null, null, null, null, null, null], ["Construction of kitchen with store 3 331,638,833 139,422,960 192,215,873", null, null, null, null, null, null, null, null], ["Construction of kitchen with store, Staff houses & Pit Latrines 4 497,867,971 231,557,256 266,310,715", null, null, null, null, null, null, null, null], ["5 Construction of 5 stance Pit 79,992,632 76,152,972 3,839,660", null, null, null, null, null, null, null, null]], "page": 4}, {"type": "table", "content": [["579,754,570 262,377,630 317,376,940 251,326,805 156,778,547 94,548,258 **Total 3,241,335,951 1,555,167,674 1,686,168,277** accounting officer explained that the shortfall in revenue was as a result of the a) Continuous withdrawal of established taxes from the Local Government by the Uganda Revenue Authority; like boat licensing which affected Local Revenues performance.  b) Failure by Ministry of Gender, Labor and Social Development to transfer funds for YLP amounting to UGX.200,000,000, c)  Budget cuts by the Ministry of Finance, Planning and Economic Development (MoFPED). Latrines Construction of Staff houses, Pit Latrines & kitchen with store Construction of kitchen with stores & 5 stance Pit Latrines following; 6 7 The", null, null, null, null, null, null, null, null, ""], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], ["Section 15 (1) of the Public Finance and Management Act, 2015 states that after approval of the annual budget by Parliament, the Secretary to Treasury shall issue the annual cash flow plan of Government, based on the procurement plans, work plans and recruitment plans approved by Parliament. Section 15 (2) states that the annual cash flow plan issued under subsection (1) shall be the basis for release of funds by the Accountant General to the Accounting Officers. Further to this, section 15 (3) requires an Accounting Officer to commit the budget of a vote, based on the annual cash flow plan issued under this section. I noted that out of the total warrants of UGX.15,247,976,182, UGX.15,167,287,386 was absorbed by the entity representing an absorption level of 99.47% as shown in the **Table** below;  **Released Funds [A] Expenditure [B]** Unspent [A-B]** **Billion** **15.247** **Billion** **15.167** **Billion 0.08** implies that the entity nearly absorbed all the released funds. However, the amount of UGX.80,000,000 remained unspent and relates to general staff salaries. Accounting Officer acknowledged the shortcoming and promised to implement the recommendation. **1.2 Absorption of funds** This The", null, null, null, null, null, null, null, null, "I noted the performance and advised  the accounting officer to ensure all funds are absorbed within the financial year."], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null, null], ["**1.3 Implementation of Key Outputs**  Section 45 (3) of the PFMA, 2015 states that, an Accounting Officer shall enter into an annual budget performance contract with the Secretary to the Treasury which shall bind the Accounting Officer to deliver on the activities in the work plan. achieve its mandate, the district planned to implement and achieve both recurrent and development activities under various programme and projects. A review of the statement of performance on page 31 of the financial statements and Education sector work plans revealed that most of the planned key outputs were implemented except for the construction of teacher’s house and latrines at Sserwanga Lwanga senior secondary school, Kibanga and Kachanga primary schools which were still work in progress at the end of the financial year as shown in **appendix 1.** I also noted that 14 youth groups’ projects were not supported. To", null, null, null, null, null, null, null, null, "I advised the Accounting Officer to engage the development partner to honour its obligation and ensure that projects are completed."], [null, null, null, null, null, null, null, null, null, null]], "page": 5}, {"type": "paragraph", "content": "The Accounting Officer explained that the partial implementations were a result of failure to receive all the planned funds from Iceland International Development Agency within the financial year.", "page": 6}, {"type": "heading", "level": 1, "content": "Other Information", "page": 6}, {"type": "paragraph", "content": "The Accounting Officer is responsible for the Other Information. The Other Information comprises the statement of responsibilities of the Accounting Officer and the commentaries by the Head of Accounts and the Accounting Officer, and other supplementary information.", "page": 6}, {"type": "paragraph", "content": "The Other Information does not include the financial statements and my auditors’ report thereon. My opinion on the financial statements does not cover the Other Information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 6}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the Other Information and, in doing so, consider whether the Other Information is materially consistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact. I have nothing to report in this regard.", "page": 6}, {"type": "heading", "level": 1, "content": "Management’s Responsibility for the Financial Statements", "page": 6}, {"type": "paragraph", "content": "Under Article 164 of the Constitution of the Republic of Uganda, 1995 (as amended) and Section 45 of the PFMA, 2015, the Accounting Officer is accountable to Parliament for the funds and resources of Mubende District Local Government.", "page": 6}, {"type": "paragraph", "content": "The Accounting Officer is also responsible for the preparation of financial statements following the requirements of the LGFAM, 2007 and the PFMA, 2015 and for such internal control as management determines necessary to enable the preparation of financial statements that are free from material misstatement whether due to fraud or error.", "page": 6}, {"type": "paragraph", "content": "In preparing the financial statements, the Accounting Officer is responsible for assessing the District’s ability to continue as a going concern, disclosing, as applicable, matters related to going concern and using the going concern basis of accounting, unless the Accounting Officer has a realistic alternative to the contrary.", "page": 6}, {"type": "paragraph", "content": "The Accounting Officer is responsible for overseeing the District’s financial reporting process.", "page": 6}, {"type": "heading", "level": 1, "content": "Auditor’s Responsibility", "page": 6}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance but is not a guarantee that an audit conducted following ISSAIs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken based on these financial statements.  \nAs part of an audit following ISSAI’s, I exercise professional judgment and maintain professional scepticism throughout the audit. I also:", "page": 6}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 6}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit to design audit procedures that are appropriate in the circumstances, but not to express an opinion on the effectiveness of the District’s internal control.\n- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by management.\n- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the District’s ability to deliver its mandate. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the District to fail to deliver its mandate.\n- Evaluate the overall presentation, structure, and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 7}, {"type": "paragraph", "content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 7}, {"type": "paragraph", "content": "I also provide the Accounting Officer with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with him/her all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 7}, {"type": "paragraph", "content": "From the matters communicated with the Accounting Officer, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 7}, {"type": "paragraph", "content": "Other Reporting Responsibilities  \nFollowing Section 19 (1) of the National Audit Act, 2008, I report to you, based on my work described on the audit of Financial Statements, that; except for the matters raised in compliance with legislation section below, and whose effect has been considered in forming my opinion on financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 7}, {"type": "heading", "level": 1, "content": "Report on the Audit of Compliance with Legislation", "page": 7}, {"type": "paragraph", "content": "The material findings in respect of the compliance criteria for the applicable subject matters are as follows;", "page": 7}, {"type": "paragraph", "content": "2.0  \nImplementation of Uganda Inter-Governmental Fiscal Transfer Programme The Uganda Intergovernmental Fiscal Transfers Program for Results (UgIFT) is a Government Program being implemented under the Ministries of Health and Education through the Districts and Municipal Councils. The program which started in the financial year 2018/19 was designed to address the financing gaps in service delivery specifically in the Health and Education Sectors.", "page": 7}, {"type": "paragraph", "content": "The District budgeted to receive UGX.2,125,417,275 Central Government Grant for the construction of Kachanga Seed School in Bufumira Sub-county and there was no funding to upgrade the Health Centre II.", "page": 8}, {"type": "paragraph", "content": "The audit objective was to establish whether; Project funds were budgeted, disbursed and utilized in the implementation of planned project activities.", "page": 8}, {"type": "paragraph", "content": "2.1", "page": 8}, {"type": "heading", "level": 1, "content": "Delayed implementation of the Construction of Kachanga Seed School", "page": 8}, {"type": "paragraph", "content": "The district awarded a contract to construct Kachanga Seed school to Mmacks Investment Ltd on 25 th May, 2019 at a contract sum of UGX.2,125,417,275. Audit evaluated the project and noted the following;", "page": 8}, {"type": "paragraph", "content": "A documentation review revealed that the construction works at the seed school had not commenced although the contractor was advanced UGX.312,551,284 (15%) on 13 th of June 2019.", "page": 8}, {"type": "paragraph", "content": "Delays in the commencement of the construction work negatively affect service delivery to the community.", "page": 8}, {"type": "paragraph", "content": "The Accounting Officer explained that failure to commence the works on the Seed School was caused by delays in the procurement process, land acquisition and late receipt of funds.", "page": 8}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that funds released are utilized within the financial year for which it is released.", "page": 8}, {"type": "heading", "level": 1, "content": "3.0 Uganda Road Fund", "page": 8}, {"type": "paragraph", "content": "Uganda Road Fund (URF) is a Government of Uganda programme with an overall purpose of ensuring that all public roads are maintained at all times through the provision of adequate and stable financing for routine and periodic maintenance undertaken by designated agencies. Road maintenance is essential to: preserve the roads in their originally constructed condition; protect adjacent resources; provide reliable transport at reduced costs along the routes and contribute to economic welfare of the communities.", "page": 8}, {"type": "paragraph", "content": "The objectives of my audit were to ascertain whether the budgeted amounts were fully released and spent in line with the intended purposes and assess whether the programme activities were implemented following the work plan and to the desired quality. The following was noted;", "page": 8}, {"type": "paragraph", "content": "3.1", "page": 8}, {"type": "heading", "level": 1, "content": "Budget Performance of URF", "page": 8}, {"type": "paragraph", "content": "Regulation 18 (3) of Local Government Financial Accounting and Regulations, 2007 states that the budget estimates shall be based on the objectives to be achieved for the financial year and during implementation efforts shall be made to achieve the agreed Objectives or targets, as the Programme of the Council.", "page": 8}, {"type": "paragraph", "content": "I observed that the Council budgeted and received UGX.746,389,536 for maintenance of District, Urban and Community access roads as shown in Appendix 2.", "page": 8}, {"type": "paragraph", "content": "3.2 Unrepaired road equipment  \nI noted that some two road maintenance equipment with mechanical problems were not repaired although UGX.68,202,000 was received for Plant/Vehicle repairs during the year as shown below;", "page": 9}, {"type": "table", "content": [["", ""], ["The Truck has been packed for the last 3 Years without being repaired", "This Truck has been packed since 2018 but not repaired"]], "page": 9}, {"type": "paragraph", "content": "Failure to maintain plants/vehicles affects implementation of planned road works and exposes the equipment to deterioration.", "page": 9}, {"type": "paragraph", "content": "The Accounting Officer explained that a request for additional funds for the repairs was sent to URF.", "page": 9}, {"type": "paragraph", "content": "I await the outcome of the Accounting Officer’s actions.", "page": 9}, {"type": "heading", "level": 1, "content": "3.3 Status of Implementation", "page": 9}, {"type": "paragraph", "content": "A review of planned outputs against actual performance and other underlying activities revealed the following anomalies:", "page": 9}, {"type": "heading", "level": 1, "content": "3.1.1 Routine Mechanized Maintenance of Kibale - Kasekulo - Ttubi Road", "page": 9}, {"type": "paragraph", "content": "Section 23 (1) of URF Act, 2008 as amended; requires each designated agency to prepare, annually, and at least three months before the start of each financial year, an Annual Road Maintenance Programme in such form and containing such details as may be prescribed by the Board.", "page": 9}, {"type": "paragraph", "content": "During the year, the district budgeted and spent a sum of UGX.88,163,680 on routine mechanized maintenance of Kibale - Kasekulo - Ttubi Road of 10 Kms.", "page": 9}, {"type": "paragraph", "content": "I observed that the section of the road indicated in the picture below required culverts for proper drainage; however, they were not installed.", "page": 9}, {"type": "paragraph", "content": "The Road Section that required culverts to make it easily passable.", "page": 10}, {"type": "paragraph", "content": "There is a risk that the condition of the road section may deteriorate making it completely inaccessible for the community.", "page": 10}, {"type": "paragraph", "content": "Management explained that the road section is on the sinking low land, where the culvert line could not be installed as it cannot dissipate off the storm water. The section was scarified, formed, raised with additional imported earth, compacted and is currently passable. However, Kibaale-Kasekulo-Tubi road was included under Mechanized Routine Maintenance in the work plan of FY 2019/20 for further improvement.", "page": 10}, {"type": "paragraph", "content": "I await the outcome of the accounting officer’s decisions.", "page": 10}, {"type": "paragraph", "content": "4.0", "page": 10}, {"type": "heading", "level": 1, "content": "Implementation of the Youth Livelihood Program", "page": 10}, {"type": "paragraph", "content": "The Youth Livelihood Programme (YLP) is a Government Programme implemented under the Ministry of Gender, Labour and Social Development (MoGLSD), aimed at responding to the existing challenge of unemployment among the Youths.  \nThe programme provides support to the vulnerable youth in form of revolving funds for skills development projects and income generating activities initiated by youth groups.", "page": 10}, {"type": "paragraph", "content": "The audit objective was to establish whether all funds budgeted for YLP during the period under review were released and used only for the program, outstanding advances to the youth groups were repaid following the agreed repayment schedule and to establish reasons for failure or delays to repay the funds.  \nThe following observations were made;", "page": 10}, {"type": "paragraph", "content": "4.1", "page": 10}, {"type": "heading", "level": 1, "content": "Low recovery of YLP funds", "page": 10}, {"type": "paragraph", "content": "Guideline 6.0 of the Ministry of Gender Youth Livelihood programme document (2013) requires Youth Grants under YLP to be administered as Interest-free revolving Funds to ensure the sustainability of the Programme. The grace period and repayment period will depend on the nature of the enterprise. Any repayment that goes beyond one year will attract a Service fee of 5% to cater for inflation. Overall, the Principal and Service fee will be paid within a period not exceeding 3 years.", "page": 10}, {"type": "paragraph", "content": "A review of payment schedules revealed that only UGX.129,590,500 out of UGX.631,253,500 disbursed to the youth groups for the financial year 2014/15 to 2016/17 has been recovered resulting to an outstanding balance of UGX.504,395,250.", "page": 10}, {"type": "paragraph", "content": "Failure to repay timely denies other eligible groups’ access to the funds.", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer explained that the default rate has not allowed Council to account for interest since groups are under-performing.", "page": 11}, {"type": "paragraph", "content": "I advised the Accounting Officer to initiate measures to recover all outstanding funds.", "page": 11}, {"type": "paragraph", "content": "4.2", "page": 11}, {"type": "heading", "level": 1, "content": "Performance of YLP Groups", "page": 11}, {"type": "paragraph", "content": "Physical inspection was carried out on six selected youth projects; that were funded in FY 2014/2015, to ascertain whether they were being implemented in accordance with the operational guidelines. I made the following observations;", "page": 11}, {"type": "table", "content": [["**S/N**", "**Name of group**", "**Audit Observation**", null, "**Managements explanation**"], ["**(a)**", "**Kalangala photographic Training Centre** **and**", " The group received UGX.6,500,000 in FY 2014/15 to engage in photography   There was no physical activity taking place at the time of inspections.   Members expressed in business due to advancement in phone cameras loss **Premises of Kalangala Photographic group.**", null, "This operational business is"], [null, null, null, null, ""], [null, null, null, null, null]], "page": 11}, {"type": "table", "content": [["**(b)**", "**Bugoma** **Builders** **Boat**", " The group received funding of UGX.9,000,000 in FY 2014/15 for Boat making business   At the time of audit inspection in August, 2019; Boat making had stopped because the fishermen no longer bought the boats due to the security patrols to curb illegal fishing on the lake   The Group members stated that they were unable to payback due to security operation on illegal fishing on the lake that has pushed away fishermen who could have bought the boats. **Unsold Boat made by the group**", ""], ["**(C)**", "**Lulindi** **Group** **B Youth**", " The group received funding of UGX.6,000,000 in FY 2015/16 for fishing business   The group had 15 members but migrated to unknown places due to closure of the landing site by the security personnel in charge of water bodies.", ""], ["**(d)**", "**Youth** **Uganda** **Enterprise**", " The group received funding of UGX.12,500,000 in FY 2014/15 for industrial equipment but members stated that the money was not enough to start the business.   Some machinery was purchased and it is lying in the group compound.   The group has requested the Chief Administrative Officer for further assistance however, there was no response yet.", "The group misused the funds and never showed  clear accountability"], ["**(e)**", "**Bungo Tusitukiremu Boda – Boda**", " The group received sum of UGX.8,000,000 in FY 2014/15 for Boda-Boda business.   Total sum of UGX.3,470,000, had so far been recovered from the Group although the Group Chairman disputed the reported amount recovered; claiming", "Management  attributed this to the poor banking records on the bank statement as different groups don’t deposit moneys in the group names. They use personal"]], "page": 12}, {"type": "table", "content": [["", "that more money recovered than reported. was", "names that affect the quality of reporting.", null], ["**(f)**", "**Mutambala** **Fishing** **Youth**", " This group had received sum of UGX.8,978,000 in FY 2014/15 to engage in fishing business.   Members alleged that nets were stolen and issue was reported to the CDO. the  Out of the 10 members who received the financial resources; 8 left the landing site.", "We are in touch with the  remaining members. Who always trace for their group members  for repayment"]], "page": 13}, {"type": "paragraph", "content": "In view of the various challenges observed above, there is risk of failure to recover all the funds that were disbursed to the groups.", "page": 13}, {"type": "paragraph", "content": "The Accounting Officer explained that strategies have been devised to mitigate the challenges of non-recovery. The strategies are;", "page": 13}, {"type": "paragraph", "content": "a) Use of National Identification Numbers (NIN) for registering and tracking of group members on subsequent disbursements.  \nb) Liaise with Stanbic Bank and code all projects to enable the youth banking recoveries to use project codes to eliminate un-explained deposits.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to initiate measures to recover all the outstanding funds.", "page": 13}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 13}, {"type": "heading", "level": 1, "content": "AUDITOR GENERAL", "page": 13}, {"type": "paragraph", "content": "KAMPALA  \n12 th December, 2019", "page": 13}, {"type": "heading", "level": 1, "content": "APPENDICES: Appendix 1: Partially Implemented Development Infrastructure in Education Sector", "page": 14}, {"type": "table", "content": [["**S / n**", "**Code**", "**Project**", "**Contract or**", "**Contract amount**", "**Cumulative Payments**", "**Balance**"], ["1", "KE120-2-1", "Construction of new staff house with latrine at Mulabana P/S", "Bekabye", "301,544,344", "98,854,116", "202,690,228"], ["2", "KE140-3-1", "Construction of new staff house with latrine at Bishop Danstan SS", "Bekabye", "290,804,850", "95,384,400", "195,420,450"], ["3", "KE120-4-2", "Construction of a 5 stance pit latrine at Kinyamira P/S", "Bekabye", "61,274,304", "25,970,400", "35,303,904"], ["", "**Lot 1**", "**Sub total**", "", "**653,623,498**", "**220,208,916**", "**433,414,582**"], ["4", "KE120-3-5", "Construction of school kitchen with store at Bridge of hope", "Norrkopin g", "155,145,749", "", ""], ["5", "KE120-2-3", "Construction of new staff house with latrine at Lake Victoria", "Norrkopin g", "284,162,978", "", ""], ["6", "KE160-1-1", "Construction of 1 dormitory for girls at Bumangi Community Polytechnic", "Norrkopin g", "407,822,915", "", ""], ["", "**Lot 2**", "**Sub total**", "", "**847,131,642**", "**468,669,393** less supervision", "**378,462,249** less supervision"], ["7", "KE120-3-3", "Construction of school kitchen with store at Bunyama P/S", "Banya Gardens LTD", "180,921,518", "", ""], ["8", "KE120-3-4", "Construction of school kitchen with store at Lwabaswa P/S", "Banya Gardens LTD", "150,717,315", "", ""], ["", "**Lot 3**", "**Sub total**", "", "**331,638,833**", "**139,422,960**", "**192,215,873**"], ["9", "KE120-3-1", "Construction of school kitchen with store at Jjaana P/S", "Azom", "176,615,145", "", ""], ["1 0", "KE120-2-4", "Construction of new staff house with latrine at Kachanga P/S", "Azom", "319,334,131", "", ""], ["", "**Lot 4**", "**Sub total**", "", "**497,867,971**", "**231,557,256**", "**266,310,715**"], ["1 1", "KE120-4-1", "Construction of a 5 stance pit latrine at Mazinga P/S", "Hippo Con Limited", "79,992,632", "76,152,972", "3,839,660"]], "page": 14}, {"type": "table", "content": [["**S / n**", "**Code**", "**Project**", "**Contract or**", "**Contract amount**", "**Cumulative Payments**", "**Balance**"], ["Co.", "", "", "", null, null, null], ["", "**Lot 5**", "**Sub total**", "", "**79,992,632**", "**76,152,972**", "**3,839,660** (Retention)"], ["1 2", "KE140-3-2", "Construction of new staff house with latrine at Sserwanga Lwanga SS", "Nkambo Services", "348,712,713", "168,487,200", "180,225,513"], ["1 3", "KE120-3-6", "Construction of school kitchen with store at Bumangi P/S", "Nkambo Services", "157,143,614", "71,683,380", "85,460,234"], ["1 4", "N/A", "Construction of a 5 stance pit latrine at Sserwanga Lwanga SS", "Nkambo Services", "73,898,243", "22,207,050", "51,691,193"], ["", "**Lot 6**", "**Sub total**", "", "**579,754,570**", "**262,377,630**", "**317,376,940**"], ["1 5", "KE120-3-2", "Construction of school kitchen with store at Sserinnya P/S", "Water Front Holdings", "179,656,143", "-", ""], ["1 6", "N/A", "Construction of a 5 stance pit latrine at Bukasa SS", "Water Front Holdings", "71,670,662", "-", ""], ["", "**Lot 7**", "", "", "**251,326,805**", "**156,778,547**", "**94,548,258**"], ["", "", "**Total Lot 1-7**", "", "", "", "**1,686,168,277**"]], "page": 15}, {"type": "heading", "level": 1, "content": "Appendix 2: Comparison of approved annual budget with outputs – URF", "page": 15}, {"type": "table", "content": [["**Item Description**", "**Planned Output/ Quantity**", "**Actual Output/ Quantity**", "**Annual Budgeted (UGX)**", "**Amount Released (UGX)**", "**Amount spent (UGX)**", "**Management Explanation(particulars of road &Distance)**"], ["**Routine Manual Maintenance**", "47km", "47km", "85,200,000", "85,200,000", "85,200,000", "Kachanga-Kammese- Luwungulu 10km, Kawafu-Namisoke 6km, Kaagonya-Misonzi Kaaya 6.5km, Kiwungu- Lwanabatya-Nakibanga 18km, Semawundo Lulindi 6.5km"], ["**Mechanized Routine Maintenance**", "38km", "38km", "335,022,000", "335,022,000", "335,022,000", "Lusozi-Buziga 5km, Kibaale-Kasekulo-Tubi 10km, Beta-Senero 5km, Beta-Mutambala 3km, Kagolomolo-Banga 3km, Bumangi-Njoga 7km,Bweza-Dajje 5km"], ["**Operational Costs and Supervision**", "Supervision Reports, Meetings/Works hops,  Stationery, Computer repairs/consuma bles", "Supervision  Reports, Meetings/Workshops, Stationery, Computer repairs/consumables", "26,456,000", "26,456,000", "26,456,000", "Reports, Meetings/Workshops, Stationery, Computer repairs/consumables Supervision"], ["**District**", "4", "4 sittings", "8,000,000", "8,000,000", "8,000,000", "Reports /Minutes availed"]], "page": 15}, {"type": "table", "content": [["**Roads Committee Operations**", "sittings/minutes", "reports/minutes", "", "", "", ""], ["**Emergency works**", "-", "-", "0", "0", "0", "0"], ["**Transfer to Town Council**", "Quarterly transfers", "Acknowledgment receipts", "128,027,983", "128,005,219", "128,005,219", "Transfers done"], ["**Plant/Vehicle repairs**", "Road Unit, 3supervision vehicles, 6 Trucks maintenance, consumables eg, blades, batteries etc", "Road Unit, 3supervision vehicles, 6 Trucks maintenance, consumables eg, blades, batteries etc", "68,202,000", "68,202,000", "68,202,000", "2 graders, 2 vibro rollers, 4 trucks, and supervision vehicles are in motorable condition"], ["**Transfer to Sub Counties**", "Q2 Transfer", "Acknowledgement receipts", "95,481,553", "95,481,553", "95,481,553", "Transfer done"], ["**Total**", "", "", "**746,389,536**", "**746,366,772**", "**746,366,772**", ""]], "page": 16}, {"type": "heading", "level": 1, "content": "Appendix 3: Low recovery of YLP funds", "page": 16}, {"type": "table", "content": [["**S/N**", "**Project name**", "**Date of disbursed**", "**Amount disbursed**", "**5% services fee where applicable**", "**Amount Recovered**", "**Amount due**", "**Remarks**"], ["1", "Kalangala Photographic and Training Centre", "2014/2015", "6,500,000", "325,000", "800,000", "6,025,000", "The business is still in place though struggles to pay back"], ["2", "Maranatha Youth -soap makers", "2014/2015", "6,100,000", "0", "6,100,000", "0", "The group paid all its funds back"], ["3", "Kalangala Youth Vision -fish farmers", "2014/2015", "6,500,000", "325,000", "500,000", "6,325,000", ""], ["4", "Hope Youth Laundry services", "2014/2015", "7,500,000", "375000", "265,000", "7,610,000", "The group collapsed"], ["5", "Youth Enterprise grain milling", "2014/2015", "12,500,000", "0", "0", "12,500,000", "The group never started implementation of the proect."], ["6", "Buggala Kalangala Young youth hardware", "2015/2016", "8,000,000", "", "200,000", "7,800,000", "The group changed the business due to failure of the trade they had started."], ["7", "Lutoboka Youth cage fish farmers", "2015/2016", "7,300,000", "", "500,000", "6,800,000", "implementing. Still"], ["8", "Mulole Youth Diary", "2014/2015", "9,500,000", "", "530,000", "8,970,000", ""], ["9", "Young and Powerful Poultry", "2014/2015", "10,000,000", "290,250", "4,195,000", "6,095,250", ""], ["10", "Mutambala Youth Fishing", "2015/2016", "8,978,000", "", "2,680,000", "6,298,000", ""]], "page": 16}, {"type": "table", "content": [["11", "Akwata Empolaa Diary", "2014/2015", "11,000,000", "500,000", "1,000,000", "10,500,000", ""], ["12", "Kagulube Youth Diary", "2014/2015", "10,800,000", "", "610,000", "10,190,000", "collapsed Group"], ["13", "Bumangi youth Diary farmers", "2014/2015", "9,000,000", "450,000", "0", "9,450,000", "chairperson sold the animals and run away with the funds The"], ["14", "Buyindi Twezimbe Diary", "2014/2015", "9,292,000", "467000", "0", "9,759,000", "collapsed Group"], ["15", "Bungo Tusitukirewamu youth boda boda", "2015/2016", "8,000,000", "", "3,470,000", "4,530,000", "Paying well"], ["16", "Kasenyi bwavu mpologoma", "2015/2016", "6,000,000", "", "2,310,000", "3,690,000", ""], ["17", "Kasekulo tulibumu bodaboda", "2015/2016", "8,000,000", "", "6,650,000", "1,350,000", ""], ["18", "Bugoma youth silverfish", "2014/2015", "6,500,000", "", "570,000", "5,930,000", ""], ["19", "Bugoma boat builders", "2014/2015", "9,000,000", "", "1,715,000", "7,285,000", ""], ["20", "Bbeta youth bodaboda", "2015/2016", "8,000,000", "", "4,810,000", "3,190,000", ""], ["21", "Buswa youth Diary", "2014/205", "10,700,000", "", "2,800,000", "7,900,000", ""], ["22", "Bwavu mpologoma youth Diary", "2014/2015", "8,500,000", "", "2,100,000", "6,400,000", ""], ["23", "Kyosimba onaanya youth silverfish", "2015/2016", "6,000,000", "", "600,000", "5,400,000", ""], ["24", "Kasisa Passion fruit growers", "2015/2016", "4,500,000", "", "2,310,000", "2,190,000", ""], ["25", "Bavubuka Twekembe Diary", "2014/2015", "8,628,000", "", "520,000", "8,108,000", ""], ["26", "Bujumba Carpentry", "2015/2016", "7,550,000", "", "1,960,000", "5,590,000", ""], ["27", "Bavubuka Twezimbe Diary", "2014/2015", "9,837,000", "", "1,150,000", "8,687,000", ""], ["28", "Agali awamu youth silverfish", "2014/2015", "8,330,000", "", "680,000", "7,650,000", ""], ["29", "Buyigi sessolye silverfish", "2015/2016", "9,910,000", "", "3,500,000", "6,410,000", ""], ["30", "Kisujju akezimbira Youth mukene", "2015/2016", "6,250,000", "", "5,000,000", "1,250,000", ""], ["31", "Kaazi malanga eyeterekera bakery", "2014/2015", "8,927,500", "", "3,100,000", "5,827,500", ""], ["32", "Bweza dajje youth silverfish", "2014/2015", "7,000,000", "", "6,720,000", "280,000", ""], ["33", "Kananansi KAYODA cage fish farmers", "2015/2016", "11,902,000", "", "0", "11,902,000", ""]], "page": 17}, {"type": "table", "content": [["34", "Joined youth Piggery", "2014/2015", "8,800,000", "", "500,000", "8,300,000", ""], ["35", "Kitobo Youth Poultry", "214/2015", "8,150,000", "", "1,002,000", "7,148,000", ""], ["36", "Kaazi Bugaba youth silverfish", "2014/2015", "7,040,000", "", "742,750", "6,297,250", ""], ["37", "Kitobo United Youth Silverfish", "2014/2015", "7,375,000", "", "0", "7,375,000", ""], ["38", "Bbosa youth Piggery", "2014/2015", "7,375,000", "", "200,000", "7,175,000", ""], ["39", "Bufumira Kagoonya poultry", "2014/2015", "6,540,000", "", "0", "6,540,000", ""], ["40", "Together we can youth poultry", "2015/2016", "7,599,000", "", "0", "7,599,000", ""], ["41", "Lulindi B TwekembeYouth Rice growing", "2015/2016", "6,000,000", "", "870,000", "5,130,000", ""], ["42", "Lulindi A youth Rice growing", "2015/2016", "5,500,000", "", "500,000", "5,000,000", ""], ["43", "Bufumira Kisa Kya Maria mukene trading", "2015/2016", "4,600,000", "", "404,000", "4,196,000", ""], ["44", "Semawundo youth produce buying and selling", "2015/2016", "70,000,000", "", "600,000", "69,400,000", ""], ["45", "Misonzi Kwekulakulanya youth mukene", "2015/2016", "4,871,000", "", "0", "4,871,000", ""], ["46", "Kande youth Transient hostel", "2014/2015", "9,340,000", "", "200,000", "9,140,000", ""], ["47", "Bulega Youth Poultry", "2014/2015", "7,850,000", "", "850,000", "7,000,000", ""], ["48", "Lwazi silverfish buying/selling", "2015/2016", "6,000,000", "", "1,810,000", "4,190,000", ""], ["49", "NamisokeYouth Poultry", "2014/2015", "4,180,000", "", "200,000", "3,980,000", ""], ["50", "Jjaana Youth General Marchandise", "2014/2015", "6,750,000", "", "600,000", "6,150,000", ""], ["51", "Youth Empowerment Oe Perch", "2015/2016", "7,500,000", "", "1,420,000", "6,080,000", ""], ["52", "Buyange me and you silverfish", "2015/2016", "5,500,000", "", "2,750,000", "2,750,000", ""], ["53", "Misisi Youth silverfish", "2015/2016", "5,785,000", "", "1,018,000", "4,767,000", ""], ["54", "Buyange Together we can silverfish", "2015/2016", "5,850,000", "", "1,900,00", "3,950,000", ""], ["55", "Buyange kwewayo hairdressing and saloon", "2014/2015", "6,150,000", "", "850,000", "5,300,000", ""], ["56", "Buzingo youth Piggery", "2014/2015", "5,000,000", "", "2,640,000", "2,360,000", ""]], "page": 18}, {"type": "table", "content": [["57", "Buwanga youth silverfish", "2014/2015", "5,000,000", "", "1,693,000", "3,307,000", ""], ["58", "Buwazi animal feeds", "2014/2015", "11,668,000", "", "800,000", "10,868,000", ""], ["59", "Kyamuswa Youth Bakery", "2014/2015", "10,256,000", "", "2,410,000", "7,846,000", ""], ["60", "Tukolere wamu piggery", "2015/2016", "6,000,000", "", "420,000", "5,580,000", ""], ["61", "Bivamuntuuyo youth Diary", "2015/2016", "5,400,000", "", "652,000", "4,748,000", ""], ["62", "Twekembe Lwanabatya youth silverfish", "2015/2016", "5,000,000", "", "3,500,000", "1,500,000", ""], ["63", "Lwanabatya Kateyanira Youth Silverfsh", "2015/2016", "5,000,", "", "440,000", "4,560,000", ""], ["64", "Buswaga agali awamu bodaboa", "2015/2016", "7,500,000", "", "733,000", "6,767,000", ""], ["65", "Bukasa youth Devt saloon", "2015/2016", "6,815,000", "", "1,200,000", "5,615,000", ""], ["66", "Buwanga youth produce buying", "2016/2017", "6,500,000", "", "225,000", "6,275,000", ""], ["67", "Butulume Youth Fishing", "2014/2015", "5,300,000", "", "680,000", "4,620,000", ""], ["68", "Kyeserwa youth Poultry", "2014/2015", "5,000,000", "", "500,000", "4,500,000", ""], ["70", "Busindi Youth Piggery", "2014/2015", "5,000,000", "", "1,900,000", "3,100,000", ""], ["71", "Mirindi silverfish", "2014/2015", "5,000,000", "", "2,750,000", "2,250,000", ""], ["72", "Mawaala Community Youth silverfish", "2014/2015", "6,500,000", "", "2,200,000", "4,300,000", ""], ["73", "Nkose Youth Agri-tech Poultry", "2014/2015", "6,400,000", "", "783,000", "5,617,000", ""], ["74", "Kwekulakulanya Youth Poultry", "2014/2015", "6,250,000", "", "0", "6,250,000", ""], ["75", "Katookemukene value addition", "2015/2016", "6,000,000", "", "0", "6,000,000", ""], ["76", "Bavubuka Twegatte Kikwayu Youth", "2016/2017", "8,000,000", "", "3,800,000", "4,200,000", ""], ["77", "Kibanga Buligo Youth Carpentry", "2017/2018", "7,900,000", "", "0", "7,900,000", ""], ["78", "Kiiku Oe perch Buying Association", "2016/2017", "8,200,000", "", "800,000", "7,400,000", ""], ["79", "Kakyanga One Heart Bakery Youth", "2016/2017", "7,300,000", "", "0", "7,300,000", "The group business was not managed well and it collapse within two months"], ["", "", "", "**631,253,500**", "**2,732,250**", "**129,590,500**", "**527,093,000**", ""]], "page": 19}]