[{"type": "paragraph", "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 2, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF THE MULTINATIONAL LAKE VICTORIA MARITIME COMMUNICATIONS AND", "page": 0}, {"type": "paragraph", "content": "TRANSPORT (MLVMCT) PROJECT – ADF LOAN 2100150036246 FOR THE YEAR ENDED 30 TH JUNE 2020", "page": 0}, {"type": "paragraph", "content": "OFFICE OF THE AUDITOR GENERAL", "page": 0}, {"type": "heading", "level": 2, "content": "UGANDA", "page": 0}, {"type": "tableOfContent", "content": ["TABLE OF CONTENTS", "LIST OF ACRONYMS - 2", "Opinion - 3", "Basis of Opinion - 3", "Key Audit Matters - 3", "Other Information - 3", "Management Responsibilities for the Financial Statements - 4", "Auditor’s Responsibilities for the Audit of the Financial Statements - 4", "Other Reporting Responsibilities - 5", "Report on Compliance with Legislation and Funding Requirements - 6", "  1.0 Project performance - 6", "  1.1 Low rate of disbursement - 6", "REPORT OF THE AUDITOR GENERAL ON THE INTERNAL CONTROL STRUCTURE - 9", "REPORT OF THE AUDITOR GENERAL ON THE SPECIAL ACCOUNT OPERATIONS - 10"], "page": 1}, {"type": "heading", "level": 2, "content": "LIST OF ACRONYMS", "page": 2}, {"type": "table", "content": [["**Acronym**", "**Meaning**"], ["ADB", "African Development Bank"], ["ADF", "African Development Fund"], ["GOU", "Government of Uganda"], ["IESBA", "International Ethics Standards Board for Accountants"], ["ISA", "International Standards on Auditing"], ["ISSAIs", "International Standards of Supreme Audit Institutions"], ["LVBC", "Lake Victoria Basin Commission"], ["MOFPED", "Ministry of Finance, Planning and Economic Development"], ["MoWT", "Ministry of Works and Transport"], ["MLVMCT", "Multinational Lake Victoria Maritime Communications and Transport"], ["UA", "Unit of Account"], ["UG", "Uganda"], ["UGX", "Uganda Shillings"]], "page": 2}, {"type": "heading", "level": 2, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF THE MULTINATIONAL LAKE VICTORIA MARITIME COMMUNICATIONS AND", "page": 3}, {"type": "paragraph", "content": "TRANSPORT (MLVMCT) PROJECT, ADF LOAN 2100150036246 FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2020", "page": 3}, {"type": "heading", "level": 2, "content": "THE RT. HON. SPEAKER OF PARLIAMENT Opinion", "page": 3}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246 which comprise of the Statement of Receipts and Payments for the year ended 30 th June 2020, Statement of Comparative Budget and Actual Amounts, Statement of Cash flows, Statement of ADB Special Account Movement, Statement of ADB loan balances together with other accompanying statements for the year then ended, and notes to the financial statements, including a summary of significant accounting policies.", "page": 3}, {"type": "paragraph", "content": "In my opinion, the financial statements present fairly in all material respects, the financial performance of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246 and the Fund balances for the year ended 30 th June 2020, in accordance with the Project Funding guidelines and accounting policies stated in the notes to the financial statements.", "page": 3}, {"type": "heading", "level": 2, "content": "Basis of Opinion", "page": 3}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statement’s section of my report. I am independent of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) project, ADF loan 2100150036246 in accordance with the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act, 2008, the International Ethics Standards Board for Accountants Code of Ethics for Professional Accountants (Parts A and B) (IESBA Code), the International Organization of Supreme Audit Institutions (INTOSAI) Code of Ethics and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "heading", "level": 2, "content": "Key Audit Matters", "page": 3}, {"type": "paragraph", "content": "Key audit matters are those matters that, in my professional judgment, are of most significance in my audit of the financial statements of the current period. I have determined that there are no Key Audit Matters to communicate in my report.", "page": 3}, {"type": "heading", "level": 2, "content": "Other Information", "page": 3}, {"type": "paragraph", "content": "The Accounting Officer is responsible for the other information. The other information comprises the statement of responsibilities of the Accounting Officer and the commentaries by the Head of Accounts and the Accounting Officer, and other supplementary information. The other information does not include the financial statements and my auditors’ report thereon.", "page": 3}, {"type": "paragraph", "content": "My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 4}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the other information and, in doing so, consider whether the other information is materially consistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact. I have nothing to report in this regard.", "page": 4}, {"type": "heading", "level": 2, "content": "Management Responsibilities for the Financial Statements", "page": 4}, {"type": "paragraph", "content": "Under Article 164 of the Constitution of the Republic of Uganda, 1995 (as amended) and Section 45 of the Public Finance Management Act, 2015, the Accounting Officer is accountable to Parliament for the funds and resources of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246.", "page": 4}, {"type": "paragraph", "content": "The Accounting Officer is also responsible for the preparation of financial statements in accordance with the requirements of the Public Finance Management Act 2015, ADB guidelines and the basis of accounting described in the notes to the financial statements, and for such internal control as management determines is necessary to enable the preparation of financial statements that are free from material misstatements, whether due to fraud or error.", "page": 4}, {"type": "paragraph", "content": "In preparing the financial statements, the Accounting Officer is responsible for assessing the Project’s ability to continue delivering its mandate, disclosing, as applicable, matters related to affecting the delivery of the mandate of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246, and using the ADB Guidelines and Government of Uganda Regulations, unless the Accounting Officer has a realistic alternative to the contrary.", "page": 4}, {"type": "paragraph", "content": "The Accounting Officer is responsible for overseeing the Project’s financial reporting process.", "page": 4}, {"type": "heading", "level": 2, "content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 4}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISSAIs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.", "page": 4}, {"type": "paragraph", "content": "As part of an audit in accordance with ISSAIs, I exercise professional judgment and maintain professional skepticism throughout the audit. I also:", "page": 4}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for our opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 4}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Project’s internal control.", "page": 5}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by Management.", "page": 5}, {"type": "list", "content": "- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Project’s ability to deliver its mandate. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246to fail to deliver its mandate.", "page": 5}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 5}, {"type": "paragraph", "content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 5}, {"type": "paragraph", "content": "I also provide the Accounting Officer with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with him/her all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 5}, {"type": "paragraph", "content": "From the matters communicated with the Accounting Officer, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 5}, {"type": "heading", "level": 2, "content": "Other Reporting Responsibilities", "page": 5}, {"type": "paragraph", "content": "In accordance with sections 19(1) of the National Audit Act, 2008, I report to you, based on my work described on the audit of Financial Statements that;", "page": 5}, {"type": "paragraph", "content": "Except for the matter raised in the compliance with legislation and funding requirements section below, and whose effect has been considered in forming my opinion on the financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 5}, {"type": "paragraph", "content": "Report on Compliance with Legislation and Funding Requirements", "page": 6}, {"type": "paragraph", "content": "The material finding in respect of the compliance criteria for the applicable subject matter is as follows;", "page": 6}, {"type": "heading", "level": 2, "content": "1.0 Project performance", "page": 6}, {"type": "paragraph", "content": "1.1", "page": 6}, {"type": "heading", "level": 2, "content": "Low rate of disbursement", "page": 6}, {"type": "paragraph", "content": "During the financial year 2019/20 the Bank disbursed a total of USD.390,000 for project activities. This brings the total loan disbursement to USD 503,313 to date out of the expected project costs of USD$.14,400,000. The table below refers:", "page": 6}, {"type": "paragraph", "content": "Table 1: Showing Loan Financial performance", "page": 6}, {"type": "table", "content": [["**Item**", "**Amount disbursed 2018/19 USD**", "**Amount Disbursed 2019/20 USD**", "**Total Loan Amount USD**", "**% Disbursed funds to date**"], ["Disbursement", "113,390.33", "390,000", "503,313", "3.5"], ["Total amount Utilized", "100,077", "360,551", "473,864", "3.3"], ["Unutilized funds", "13,313.33", "29,449", "29,449", "5.9"]], "page": 6}, {"type": "paragraph", "content": "The project has so far utilized 3.3% of the total loan disbursed funds with a physical performance of 4%. Out of the planned target of 30% expected cumulative physical progress, only 4% was achieved by the end of year two of the project existence which puts the project at a risk of not attaining 100% disbursement by the deadline for the final disbursement.", "page": 6}, {"type": "paragraph", "content": "Low disbursement rate exposes the project to loss of funds due to foreign exchange fluctuations. Furthermore, the project is at risk of having incomplete project components and unpaid obligations at project closure.", "page": 6}, {"type": "paragraph", "content": "Management attributed the low disbursements to slow progress in the implementation of activities; challenges with different Government Standard Operating procedures; lack of budget line for the oil spill and toxic chemical plans; unprecedented rising of water levels on Lake Victoria and delays in release of counterpart funding.", "page": 6}, {"type": "paragraph", "content": "Management further explained that as a way of improving implementation in the disbursements for the procurements, the Bank organized Missions from August - September 2019, which conducted Fiduciary training for the implementing agencies (both National and Regional), guided the Project Implementing Team in preparation of new work plans, issued no objections for major activities like Design and Build contract and approved signing of Contracts for designs consultancies. The situation is likely to improve.", "page": 6}, {"type": "paragraph", "content": "I advised the Accounting Officer to continue exploring workable measures of fast tracking the implementation of the project.", "page": 6}, {"type": "paragraph", "content": "1.2  \nDelayed Implementation of Project activities", "page": 6}, {"type": "paragraph", "content": "A review of the project work plan most of the activities planned for the year had not been undertaken. Table 2 refers;", "page": 6}, {"type": "paragraph", "content": "Table 2: Showing status of project planned activities for the FY 2019/2020:", "page": 7}, {"type": "table", "content": [["**SN**", "**Activity**", "**Status**", "**Reasons for delay of implementation**", "**Budget USD**", "**Actual USD**"], ["1", "Extending coverage and functionality of MCN (Non-Consulting Services)", "Inception report for scoping exercise submitted", "It is still awaiting the final report of the Consultant", "708,467", "0"], ["2", "Installation of SAR software equipment and License", "**Not yet implemented**", "Awaiting the construction of SARs", "217,267", "0"], ["3", "Installation of weather forecast systems", "**Not yet implemented**", "Awaiting the construction of SARs", "652,675", "0"], ["4", "Undertake maritime safety promotion", "Ongoing", "On schedule", "12,313", "9,849"], ["5", "Remodeling and renovation of MRCC Sub-center, Entebbe", "**Not yet implemented**", "Procurement has just been awarded ( delays in obtaining no objections from the bank)", "135,000", "0"], ["6", "Renovation and expansion of FTI Training lab Entebbe", "**Not yet implemented**", "Procurement has just been awarded", "890,000", "0"], ["7", "SAR Station construction of shades and civil works (jetty/dredging) 3+6 sites", "**Not yet implemented**", "Procurement delays", "1,133,333", "0"], ["8", "Civil works - women shades, drying racks, women group at BMUs/SARs", "Receiving bids for the financial and technical proposals", "Procurement delays", "236,250", "0"], ["9", "SARs equipment and software", "**Not yet implemented**", "To be implemented after construction of SAR facilities", "0", "0"], ["10", "SARs furniture and office equipment and software", "Partially Completed", "No objection obtained from the bank to procure Start-up equipment and furniture.", "0", "67,329"], ["11", "SARs boats(16-RIB 8m; 3 metal door- 11metres)", "**Not yet Implemented**", "Procurement delays ( Due to lack of harmonization of Standards in the region)", "1,733,000", "0"], ["12", "Weather forecast systems (9 units) and 12 Aids to Navigation systems", "Procurement  at initial stages", "Awaiting construction of the SARs", "1,611,291", "0"], ["13", "Purchase of project vehicle", "Completed", "", "70,000", "64,038"], ["14", "Operation of  PIT/NPUs (Logistics, workshops, ESMP admin costs ,meetings", "Commenced- ongoing", "", "169,000", "154,625"], ["15", "Capacity building of projects staff PIU/NPUs and stakeholders", "Partially Implemented", "Staff enrolled at World Maritime University", "8,000", "6,100"], ["19", "Life jackets manufacturing -", "Completed", "", "180,000", "144,000"]], "page": 7}, {"type": "table", "content": [["", "women groups- equipment and materials", "", "", "", ""], ["", "**Totals**", "", "", "**7,756,596**", "**445,941**"]], "page": 8}, {"type": "paragraph", "content": "From Table 2 above, delays in implementation of the project planned activities for the year 2019/2020 were mainly attributed to lengthy procurement processes, coupled with delays in securing “No-objections” at crucial stages in the procurement process from the funders.", "page": 8}, {"type": "paragraph", "content": "This implies that the project agreed timelines may not be attained. The implementation delays could result in extra costs in form of allowances of the Project Implementation Unit (PIU) and delays in provision of services.", "page": 8}, {"type": "paragraph", "content": "Management explained that there were significant delays in procurement. A case in point is of Renovation and expansion of Fisheries Training Institute (FTI) at Entebbe; this was a complex procurement which needed some lengthy consultations from the design brief to an approved Solicitation Document accepted by the Bank Standards. It should be noted that it is the first procurement in the category to use the Design and Build concept for delivery. Therefore there was need to spend some more time to prepare it and be able to achieve the objectives for a renovated and expanded facility at Entebbe.", "page": 8}, {"type": "paragraph", "content": "I advised Management to devise clear strategies to fast track implementation of the project activities and ensure that the activities are completed within the project time frame. I also advised Management that procurements should be commenced early in time and fast tracked to be finalized within the planned timelines.", "page": 8}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 8}, {"type": "heading", "level": 2, "content": "AUDITOR GENERAL", "page": 8}, {"type": "heading", "level": 2, "content": "Kampala", "page": 8}, {"type": "paragraph", "content": "5 th March, 2021", "page": 8}, {"type": "heading", "level": 2, "content": "REPORT OF THE AUDITOR GENERAL ON THE INTERNAL CONTROL STRUCTURE OF THE MULTINATIONAL LAKE VICTORIA MARITIME COMMUNICATIONS AND", "page": 9}, {"type": "paragraph", "content": "TRANSPORT (MLVMCT) PROJECT, ADF LOAN 2100150036246 FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2020", "page": 9}, {"type": "heading", "level": 2, "content": "Opinion", "page": 9}, {"type": "paragraph", "content": "I have audited the financial statements of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246, and reviewed the Internal Control procedures relevant to generation of accounting information presented in the financial statements, and those relevant to control over programme finances and the safeguard of its assets. I obtained all the information and explanation I considered necessary for the audit.", "page": 9}, {"type": "paragraph", "content": "In my opinion, Programme Management maintained an adequate internal control system for the preparation of reliable financial statements, control over finances and safeguard of the programme assets during the year ended 30 th June 2020.", "page": 9}, {"type": "heading", "level": 2, "content": "Management Responsibility", "page": 9}, {"type": "paragraph", "content": "Management is responsible for establishing and maintaining an internal control structure. In fulfilling this responsibility, estimates and judgment are required to assess the expected benefits and related costs of internal control structure policies and procedures.", "page": 9}, {"type": "heading", "level": 2, "content": "Auditor’s Responsibility", "page": 9}, {"type": "paragraph", "content": "My examination was made in accordance with ISSAIs and accordingly included such tests of the accounting records, verification of assets and liabilities and such other auditing procedures I considered necessary in the circumstances.", "page": 9}, {"type": "paragraph", "content": "For the purpose of this report, I classified the significant internal control structure policies and procedures in the following categories:-", "page": 9}, {"type": "list", "content": "- Control over preparation of withdrawal applications for funds from the project account\n- Bank and cash Purchases and payments,\n- Monitoring, evaluation and reporting.", "page": 9}, {"type": "paragraph", "content": "For all the internal control structure categories listed above, I obtained an understanding of the design of the relevant policies and procedures and whether they have been placed in operation and I assessed control risk.", "page": 9}, {"type": "paragraph", "content": "John F. S. Muwanga", "page": 9}, {"type": "heading", "level": 2, "content": "AUDITOR GENERAL", "page": 9}, {"type": "heading", "level": 2, "content": "Kampala", "page": 9}, {"type": "paragraph", "content": "5 th March, 2021", "page": 9}, {"type": "heading", "level": 2, "content": "REPORT OF THE AUDITOR GENERAL ON THE SPECIAL ACCOUNT OPERATIONS OF THE MULTINATIONAL LAKE VICTORIA MARITIME COMMUNICATIONS AND", "page": 10}, {"type": "paragraph", "content": "TRANSPORT (MLVMCT) PROJECT, ADF LOAN 2100150036246 FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2020", "page": 10}, {"type": "heading", "level": 2, "content": "Opinion", "page": 10}, {"type": "paragraph", "content": "I have audited the special account statement of the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246 for the year ended 30 th June, 2020 which is set out on page 18 of the financial statements.", "page": 10}, {"type": "paragraph", "content": "In my opinion, Project Management complied in all material respects with ADB rules and procedures and that the Special Account Statement for the Multinational Lake Victoria Maritime Communications and Transport (MLVMCT) Project, ADF Loan 2100150036246 for the year ended 30 th June, 2020 presents fairly in all material respects the account transactions and the closing balance as at 30 th June 2020.", "page": 10}, {"type": "heading", "level": 2, "content": "Management Responsibility for the Special Account Statement", "page": 10}, {"type": "paragraph", "content": "Project management is responsible for preparation of the special account statement and its fair presentation in accordance with the requirements of the Government of Uganda regulations and ADB guidelines. Management is also responsible for designing and implementing internal controls relevant to the preparation of the special account statement that is free from material misrepresentation, whether due to fraud or error and selecting and applying appropriate accounting policies and making accounting estimates that are reasonable in the circumstances.", "page": 10}, {"type": "heading", "level": 2, "content": "Auditor’s Responsibility", "page": 10}, {"type": "paragraph", "content": "My responsibility is to express an opinion on the Special Account Statement based on my audit. I conducted the audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs) and the ADB guidelines on auditing. Those standards and guidelines require that I plan and perform the audit to obtain reasonable assurance about whether the Special Account statement is free from material misstatements. I believe that my audit provides a reasonable basis for my opinion.", "page": 10}, {"type": "paragraph", "content": "John F. S. Muwanga", "page": 10}, {"type": "heading", "level": 2, "content": "AUDITOR GENERAL", "page": 10}, {"type": "heading", "level": 2, "content": "Kampala", "page": 10}, {"type": "paragraph", "content": "5 th March, 2021", "page": 10}]