{"paragraphs": [{"content": "FOR THE YEAR ENDED 30 TH JUNE 2018", "metadata": {"headings": [{"headings_0": {"content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF KAMPALA CAPITAL CITY AUTHORITY", "page": 0}}, {"headings_1": {"content": "THE REPUBLIC OF UGANDA", "page": 0}}], "page": 0, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 0}}, {"content": [["**COC**", "Certificate of Compliance"], ["**ISSAIs**  International Standards of Supreme Audit Institutions", null], ["**INTOSAI**", "International Organization of Supreme Audit Institutions"], ["**KCCA**  Kampala Capital City Authority", null], ["**KIIDP**", "Kampala Institutional And Infrastructure Development Project"], ["**MDA**  Ministries, Departments and Agencies", null], ["**NSSF**", "National Social Security Fund"], ["**NDP**  National Development Plan", null], ["**NTR**", "Non-Tax Revenue"], ["**PPDA**  Public Procurement and Disposal of Assets Authority", null], ["**PFMA**", "Public Finance Management Act, 2015"], ["**TAIs**  Treasury Accounting Instructions", null]], "metadata": {"headings": [{"headings_0": {"content": "LIST OF ACRONYMS", "page": 2}}, {"headings_1": {"content": "TABLE OF CONTENTS", "page": 1}}], "page": 2, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 1}}, {"content": "FOR THE YEAR ENDED 30 TH JUNE, 2018", "metadata": {"headings": [{"headings_0": {"content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF KAMPALA CAPITAL CITY AUTHORITY", "page": 3}}, {"headings_1": {"content": "LIST OF ACRONYMS", "page": 2}}], "page": 3, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 2}}, {"content": "I have audited the accompanying financial statements of Kampala Capital City Authority (KCCA) for the year ended 30 th June 2018. These financial statements comprise of the statement of financial position, the statement of financial performance, statement of budget performance, Statement of Changes in Equity, cash flow statement together with other accompanying statements, notes and accounting policies.", "metadata": {"headings": [{"headings_0": {"content": "Opinion", "page": 3}}, {"headings_1": {"content": "THE RT. HON. SPEAKER OF PARLIAMENT REPORT ON THE FINANCIAL STATEMENTS", "page": 3}}], "page": 3, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 3}}, {"content": "In my opinion, the financial statements present fairly, in all material respects, the financial position of Kampala Capital City Authority as at 30 th June 2018 and its financial performance and cash flows for the period then ended, in accordance with the provisions of the Public Finance Management Act, 2015, KCCA Act 2010 and International Public Sector Accounting Standards (IPSAS).", "metadata": {"headings": [{"headings_0": {"content": "Opinion", "page": 3}}, {"headings_1": {"content": "THE RT. HON. SPEAKER OF PARLIAMENT REPORT ON THE FINANCIAL STATEMENTS", "page": 3}}], "page": 3, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 4}}, {"content": "I conducted my audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statement’s section of my report. I am independent of the Authority in accordance with the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act, 2008, the International Ethics Standards Board for Accountants Code of Ethics for Professional Accountants (Parts A and B) (IESBA Code), the International Organization of Supreme Audit Institutions (INTOSAI) Code of Ethics and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda. I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "metadata": {"headings": [{"headings_0": {"content": "Basis of Opinion", "page": 3}}, {"headings_1": {"content": "Opinion", "page": 3}}], "page": 3, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 5}}, {"content": "Key audit matters are those matters that, in my professional judgment, were of most significance in my audit of the financial statements of the current period. These matters were addressed in the context of my audit of the financial statements as a whole, and in forming my opinion thereon, and I do not provide a separate opinion on these matters. I have determined the matters described below to be key audit matters communicated in my report.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 4, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 6}}, {"content": "- Implementation of Budget approved by Parliament  \nSection 45 (3) of the Public Finance Management Act, 2015 states that “ An Accounting Officer shall enter into an annual budget performance contract with the Secretary to the Treasury which shall bind the Accounting Officer to deliver on the activities in the work plan of the vote for a Financial year, submitted under section 13 (15)” of the said Act. . It has been observed over years that planned and budgeted for activities of a number of Government entities are not implemented thereby affecting service delivery. Planning, budgeting and implementation of planned activities was taken as a thematic area for the year.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 4, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 7}}, {"content": "In the overall office wide planning, I assessed risks like inadequate release of funds and failure to undertake budget monitoring and supervision that are likely to be the causes of failure to implement entity planned activities. The focus was put on the planned major outputs of the entities which greatly impact on the wellbeing of communities.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 4, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 8}}, {"content": "Consequently, I developed specific audit procedures which included the evaluation of the financial and annual physical performance by analysing government releases, testing consistency of planned outputs with the approved budget and verifying the accuracy and completeness of the reported actual outputs.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 4, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 9}}, {"content": "In implementing the Mandate of facilitating the delivery of quality services to the people in Uganda’s Capital City- Kampala in a manner that ensures value for money, management implemented a number of planned activities during the year. Implemented activities included; populating the Roads Management System (RMS) with traffic count data and training staff in RMS. Other activities include supporting 1269 farmers with inputs and knowledge, providing school infrastructure to Government aided secondary and primary schools, conducting Community Driven Development (CDD) program, registration of CBOs, registration of Birth and Deaths, support to People with Disability (PWD) Councils, Women's Council activities and Functional Adult Literacy (FAL) Program. KCCA also immunized children with measles vaccine, Pentavalent 3 (DPT3) vaccine, delivered drugs in KCCA health /NGO units and cared for OPD Patients in KCCA Operated Health Centers among others.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 5, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 10}}, {"content": "However, I noted that activities like construction of walkways and accesses on Kisaasi Kyanja, Kawa lane, Kataza road, Kinawataka road, coronation road and support of all famers targeted with inputs and technologies among others were not implemented. The non-implementation of planned activities impacts on the achievement of the KCCA mandate. The non-implementation of planned activities impacts on the achievement of the KCCA mandate.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 5, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 11}}, {"content": "The Accounting Office explained that efforts have been put in place to ensure that the budgeting process and implementation of activities are streamlined. Appendix 1 shows the budgeting for and implementation of planned activities, and the related Management responses.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 5, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 12}}, {"content": "- Domestic Arrears  \nDomestic arrears refer to the total value of unpaid bills for goods and services rendered to a Government entity, including wages and pension that remain outstanding at the closure of a financial year. There has been persistent accumulation of domestic arrears to unmanageable levels which has led to settlement of arrears that are not authorized, unbudgeted for, inadequately supported and in some instances there has been inadequate recognition and disclosure of the domestic arrears.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 5, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 13}}, {"content": "Consequently, domestic arrears were considered a key audit matter which needed to be examined to assess: the appropriateness of recording, recognition and disclosure of domestic arrears; the trend and the underlying factors; and the adequacy of the internal controls surrounding management of domestic arrears.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 14}}, {"content": "During audit planning, I focused on examination of domestic arrears in regard to goods and services, salaries and wages, and pension and gratuity. I undertook the following procedures in relation to domestic arrears: a trend analysis over a period of three years to ascertain the underlying causes of accumulation; reviewed budget and commitment control procedures to assess their effectiveness; ascertained the authenticity of the supporting documentation and assessed the appropriateness of the accounting treatment. I also engaged the Accounting Officer to enable me arrive at the audit conclusions.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 15}}, {"content": "Based on the procedure performed, I observed that trade creditors/payables totaling to UGX.43,880,243,429 remained unsettled at close of the year. Out of the amount, arears totalling to UGX.29,536,261,108 (67%) relate to 2016/17 financial year. The increasing arrears amount poses risks of litigation and related costs to the Authority", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 16}}, {"content": "The continuous existence of domestic arrears implies that the Accounting Officer has not adhered to the commitment control system of Government that is meant to stop entities from committing Government beyond the level of availed resources.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 17}}, {"content": "The Accounting Officer explained that payment of domestic arrears had been prioritized but was constrained due to shortfall in non-tax revenue and garnishee orders issued by court on KCCA/KIIDP 2 Accounts. The Accounting Officer further explained that the Authority was engaging the Ministry of Finance, Planning and Economic Development for a supplementary budget to enable settlement of the obligations.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 18}}, {"content": "- Non-remittance of Pay As You Earn (PAYE) and Valued Added Tax (VAT)  \nI observed that URA payables (VAT and PAYE) were UGX.21,422,284,868 as at 30 th June, 2018 broken down as follows; PAYE of UGX.20,745,588,266 and VAT of UGX.676,696,602.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 6, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 19}}, {"content": "These arrears had not been paid at the time of audit in November 2018. Violation of the Income Tax laws attracts fines and penalties thus reducing funding for planned activities.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 7, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 20}}, {"content": "Management explained that KCCA’s ability to clear its tax obligations has been constrained by low NTR collections in the FY 17/18. However payments during the first quarter of the FY 18/19 amounting to UGX.3,973,511,326 have been effected towards settlement of this obligation. Management further explained that they have also proposed a payment plan to Uganda Revenue Authority committing to clear this obligation by the end of the FY 2019/2020 for which an instalment has already been paid.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 7, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 21}}, {"content": "I advised the Accounting Officer to adhere to the requirements under the tax law to avoid fines and penalties. The proposed payment plan to Uganda Revenue Authority committing to clear this obligation should be embarked on so as to clear the tax obligation and avoid unnecessary costs in form of penalties.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 7, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 22}}, {"content": "- Outstanding trade and other receivables  \nThe trade and other receivables presented in the statement of financial position decreased from UGX.47,156,334,104 to UGX.44,095,770,425 (representing 6% decrease from the previous year’s balance). Out of the receivables amount, I noted that property rates decreased from UGX.37,541,703,512 to UGX.30,853,005,506 while ground rent increased from UGX.13,149,884,157 to UGX.15,841,166,975. Some of the outstanding receivables may necessitate writing off the debts thus causing financial loss to the Authority.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 7, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 23}}, {"content": "Management explained that the long outstanding receivables to difficulties in collection of the old roll for central and Nakawa divisions after publishing of the new roll, inadequate staff to follow up debtors, verifying owner-occupied properties, non-enforcement of lease agreements by KDLB on the basis of unpaid ground rent, cleaning up of ground rent register which lead to identification of new debtors and challenges in collection of Commercial road users’ fees.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 7, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 24}}, {"content": "The Accounting Officer is advised to ensure that overdue debts are identified for write off. Meanwhile, the Accounting Officer’s implementation of the stated response is awaited.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 8, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 25}}, {"content": "- Legal costs - UGX19,445,101,578  \nThe Authority spent funds totaling UGX.19,445,101,578 on legal costs during the year under review. A review of the statement of financial position revealed that management disclosed a sum of UGX.5,032,868,969 as provision for legal costs for the period under review. This represents a decline of provisions on legal costs by UGX.12,500,755,011 (71%) from the prior year. It was also noted that taxes and interest costs on a number of these cases were yet to be determined by court. This is an indication that the legal costs payable are likely to increase.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 8, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 26}}, {"content": "Furthermore I noted contingent liabilities amounting to UGX.39,818,479,736 for cases where KCCA has been sued or is likely to be sued, an indication that there is a possibility that the legal costs may severely constrain the activities of the Authority in the near future. Delayed payment of legal costs caused cash flow constraints during the year. For instance the Authority received Garnishee orders which impacted on the implementation of planned activities. Delays by the Authority to offset interest bearing judgments in a timely manner may lead to incurring more penalties in terms of interests arising from delayed payments.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 8, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 27}}, {"content": "The Accounting officer explained that the delay to settle interest bearing judgments in a timely manner was mainly on account of the long court process and inadequate funding provisions. The Accounting Officer further explained that Management will ensure that there are adequate budget provisions to take care of interest bearing legal cases.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 8, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 28}}, {"content": "- Review of Multiplex Contract  \nOn 9 th August 2017, KCCA and M/s Multiplex amended the contract for management and modernization of street parking where the monthly contract amount payable was revised", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 8, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 29}}, {"content": "from UGX.140.3 million to UGX.375 million. The parking fees were also revised from UGX.400 to UGX.1000 for the first two hours and UGX.800 for the extra 30 minutes of the subsequent hours. On 13th February 2018, KCCA and M/s Multiplex made a second amendment to the contract to include performance measures and additional streets for controlled parking were included.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 9, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 30}}, {"content": "A review of the M/s Multiplex revenue ledgers indicated that the contractor owed the Authority UGX.433.8 million as at 30th June 2018. KCCA conducted an audit of the Multiplex contract for the period September 2017 to May 2018 which revealed that despite the contract revisions, the contractor breached the contract through; late remittance of funds (after 15th of the subsequent month), failure to provide KCCA with access to the contractor’s Management Information System, continuous variation of parking spaces and failure to mark parking slots.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 9, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 31}}, {"content": "KCCA could be losing revenue due to inability to enforce contract terms.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 9, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 32}}, {"content": "The Accounting officer explained that a contract management team was set up comprising staff from ICT, Directorate of Engineering and Directorate of Revenue which is constantly following up the contractor through timely reviews of their monthly submissions and quarterly inspections.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 9, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 33}}, {"content": "I advised the Accounting Officer to ensure that the contract terms are complied with to avoid risk of revenue loss.", "metadata": {"headings": [{"headings_0": {"content": "Key Audit Matters", "page": 4}}, {"headings_1": {"content": "Basis of Opinion", "page": 3}}], "page": 9, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 34}}, {"content": "be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information; I am required to report that fact. I have nothing to report in this regard.", "metadata": {"headings": [{"headings_0": {"content": "Other Information", "page": 9}}, {"headings_1": {"content": "Key Audit Matters", "page": 4}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 35}}, {"content": "Under Article 164 of the Constitution of the Republic of Uganda, 1995 (as amended) and Section 45 of the Public Finance Management Act, 2015, the Accounting Officer is accountable to Parliament for the funds and resources of the Kampala Capital City Authority.", "metadata": {"headings": [{"headings_0": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}, {"headings_1": {"content": "Other Information", "page": 9}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 36}}, {"content": "The Accounting Officer is also responsible for the preparation of financial statements in accordance with the requirements of the Public Finance Management Act 2015, and the Financial Reporting Guide, 2018, and for such internal control as management determines is necessary to enable the preparation of financial statements that are free from material misstatements, whether due to fraud or error.", "metadata": {"headings": [{"headings_0": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}, {"headings_1": {"content": "Other Information", "page": 9}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 37}}, {"content": "In preparing the financial statements, the Accounting Officer is responsible for assessing the Authority’s ability to continue delivering its mandate, disclosing, as applicable, matters related to affecting the delivery of the mandate of the Kampala Capital City Authority, and using the Financial Reporting Guide 2018 unless the Accounting Officer has a realistic alternative to the contrary.  \nThe Accounting Officer is responsible for overseeing the Authority’s’ financial reporting process.", "metadata": {"headings": [{"headings_0": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}, {"headings_1": {"content": "Other Information", "page": 9}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 38}}, {"content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISSAIs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these financial statements.", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 39}}, {"content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 10, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 40}}, {"content": "obtain audit evidence that is sufficient and appropriate to provide a basis for our opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 11, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 41}}, {"content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Authority’s internal control.\n- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by management.\n- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Authority’s ability to deliver its mandate. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Kampala Capital City Authority to fail to deliver its mandate.\n- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 11, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 42}}, {"content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 11, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 43}}, {"content": "circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "metadata": {"headings": [{"headings_0": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}, {"headings_1": {"content": "Responsibilities of the Accounting Officer for the Financial Statements", "page": 10}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 44}}, {"content": "As required by the Kampala Capital city Authority Act (KCCA), 2010 and the National Audit Act, 2008, I report to you, based on my audit, that;", "metadata": {"headings": [{"headings_0": {"content": "Other Reporting Responsibilities", "page": 12}}, {"headings_1": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 45}}, {"content": "- I have obtained all the information and explanations, which to the best of my knowledge and belief were necessary for the purpose of my audit.\n- In my opinion, proper books of account have been kept by the Authority so far, as appears from my examination of those books; and\n- The statement of financial position and statement of comprehensive financial performance, cash flow statement, sstatement of comparison of budget and actual amounts are in agreement with the books of account.", "metadata": {"headings": [{"headings_0": {"content": "Other Reporting Responsibilities", "page": 12}}, {"headings_1": {"content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 10}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 46}}, {"content": "In accordance with Section 13 and 19 (1) of the National Audit Act, 2008, I have a responsibility to report material findings on the compliance by KCCA with specific legislations, agreements and directives. I report to you that;  \nExcept for the matters raised below, and whose effect has been considered in forming my opinion on financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 47}}, {"content": "The material findings in respect of the compliance criteria for the applicable subject matters are as follows:", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 48}}, {"content": "- Interest on Delayed Payments-UGX. 714,318,282  \nM/s Stirling Civil Engineers Ltd was contracted on 26 th May 2016 under Lot 1 and Lot 2 for the reconstruction and upgrading of some of the Authority’s roads. The contracts were to run for periods of fifteen (15) months. It was noted that during the year under review, a sum of UGX.714,318,282 was incurred as accumulated interest on delayed payments for civil works. The accumulated interest resulted into an increase in the cost of civil works which could have been avoided. These funds would have been used to implement other entity activities.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 12, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 49}}, {"content": "The Accounting Officer explained that the interest in question was charged on multiyear contracts because of delayed payments for these contracts which was due to inadequate funding from Government. The Accounting Officer further explained that the Authority shall continue to engage Government for more funding to enable the Authority pay the certificates on time and review contract terms and engage the contractors to take care of situations where payments are likely to delay such that interest and penalties are avoided.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 50}}, {"content": "I await the outcome of Accounting Officer’s efforts to ensure timely payment of contractors and also consider reviewing contract terms and engagements to take care of situations where payments are likely to delay.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 51}}, {"content": "- Unapproved Human Resource Manual  \nSection 45(2) of the Public Finance and Management Act 2015(PFMA) requires an accounting officer to put in place effective systems of risk management and internal controls in respect of all resources and transactions. I noted that Management submitted a draft Human Resource Manual to the Ministry of Public Service but it was yet to be approved.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 52}}, {"content": "Operating without approved guidelines may result into selective application of human resource standards which may hinder achievement of the Authority’s strategic objectives.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 53}}, {"content": "The Accounting officer explained that the KCCA Management has been engaging with Ministry of Public Service and key milestones had been achieved. The Accounting Officer further explained that KCCA Management and the Ministry of public service have had five engagements to review all the clauses in the proposed manual and the last engagement was on the 7 th November 2018 where the review of the entire manual was completed and agreed upon corrections are compiled for final submission.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 54}}, {"content": "- Staffing gaps  \nThe approved KCCA structure provides for 1464 positions across the ten (10) Directorates) out of which 1128 positions are filled resulting into a shortfall of 336 positions", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 13, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 55}}, {"content": "(representing 23%). Key positions such as Deputy Executive Director, Deputy Directors and Managers among others were vacant at the year end.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 56}}, {"content": "The staffing gaps were due to inadequate funding and also delays by Ministry of public service and Public service commission to approve some recruitments. Staffing gaps in vital positions of the organization affects the performance and overall achievement of organization’s goals and objectives. This has a negative effect on service delivery and could be a contributory factor to unrealized targets.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 57}}, {"content": "The Accounting Officer explained that the workload assessment for the Authority was carried out and proposed a new organizational structure that reflects the workload for the Authority with optimum number of staff across all directorates was approved in November", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 58}}, {"content": "2016. The Accounting Officer further explained that the new approved structure for the Authority has not been implemented mainly due to inadequate budget allocation to recruit the staff as per the approved structure and where the budget is available, the Ministry of Public Service has not given clearance to the Public Service Commission as required by the standing orders section (A-n) (ii) to go ahead and fill the vacant positions on the KCCA structure. Furthermore even where the Public Service Commission has gone ahead to carry out interviews, they have had to withhold the minutes until the Ministry clears the wages bill.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 59}}, {"content": "I advised the Accounting Officers to continue engaging the Ministry of Public Service and Public Service Commission to ensure that staffing gaps are filled.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 60}}, {"content": "- Certificate of compliance (CoC) by NPA  \nAccording to Sections 13(6) and 13(7) of the PFM Act, 2015 a Certificate of Compliance (CoC) is issued by National Planning Authority (NPA) every year to all Government entities. NPA issues certificate of compliance with the aim of ensuring that the national budget, comprising of sector, MDA and Local Government budgets are focused on implementing national development plans (NDP). Specifically, the CoC requires the budget framework paper (BFP) and Annual budgets to be in line with NDP.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 14, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 61}}, {"content": "The Certificate of Compliance issued by NPA revealed that KCCA performed at satisfactory level (75%). However, the following key emerging issues were identified in the CoC.  \n There is under absorption of budgeted funds arising from delayed counterpart funding from Government of Uganda for land acquisition for the right of way.  \n Majority of KCCA projects as they appear in the public investment plan (PIP) are recurrent in nature.  \n Key transformation projects like the Light Rail and Bus Rapid Transport (BRT) have failed to take off yet they are instrumental in achievement of the NDPII.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 62}}, {"content": "Failure to address the above key issues may result into non-achievement of the objectives of the National Development Plan.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 63}}, {"content": "The Accounting Officer explained that key emerging issues raised were due to delays in securing of right of way, lack of financing and suspension of civil works following complaints by some of the PAPs. The Accounting Officer further explained that all the issues had since been addressed and works had progressed and efforts to advance the BRT project are ongoing in collaboration with the Ministry of Works and Transport MoWT, the French Development Agency (AFD) and the World Bank.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 64}}, {"content": "I advised the Accounting Officers to ensure that planned activities are implemented in accordance with the budget and National Development Plan.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 65}}, {"content": "- Field inspections  \nField inspection of KCCA schools, Health Centres, Markets and Kabalagala Youth Centre was conducted for purposes of verifying the Authority’s undertakings in relation to its core objectives of effective service delivery in the city and the following were observed: Details of inspection are in appendix III.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 66}}, {"content": [["**Inspection**", "**Findings**", "**Response**"], ["Markets Namuwongo markets) (Nakawa and", " The rubbish collectors and cleaning personnel lacked basic like gloves, gumboots detergent and brushes among others. items  The Authority does not have a cesspool emptier as the one available is too old to serve the purpose.", " A new solid waste management system is yet to be introduced where the generators of waste are responsible of its storage until when the truck collects it, that is; Self-loading system. Sensitization is underway. Hence poor solid waste management at the skip will"]], "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 15, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 67}}, {"content": [["", "", "be eliminated.  Due to limitations by the budget, the workers were given a pair of gloves in October 2018 and have been required  for themselves a pair of gum boots. to buy  KCCA has increased public health inspections in markets and engagement of market leadership  to have regular clean-ups by the market community members. is underway"], ["Hospitals kisenyi health centres) (Kawala and", " Inadequate staffing in hospitals thus leading to a long waiting time.  There were Limited Maternity delivery beds.  Storage of expired drugs was noted in same stores with non-expired drugs.  There were a number of drug stock outs for instance some ARVs combinations like ABC 3TC 600/300, DTG, EFV 200mg among others. These have been out of stock since August 2018.", " Budget allocation for medical supplies is undertaken by MOH based majorly on the level of health facility. This does not provide for equity in allocation based on the fact that KCCA health units are heavy on volume in terms of OPD attendances."], ["Schools (Nakivubo Blue Primary School, Kisasi Primary School)", " It was noted that at Kisasi Primary School, Toilet pupil ratio is 1:85 the pupils have to line for the toilets at break time.  Teacher, pupil ratio is 1:53, classroom, pupil ratio is 1:95 far above the standard of 1:50.  Nakivubo Blue Primary School land is not fenced.", " Toilet, pupil ratio; KCCA is working with GIZ to intervene in this regard.  DESS is constrained with funds (wage bill) to recruit more teachers. Engagements are ongoing with the MOES on wage enhancement.  The unfenced part of the wall was planned in the ongoing financial year and is currently"]], "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 16, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 68}}, {"content": [["", "", "under procurement."], ["Kabalagala Youth Centre", "to  The KCCA Kabalagala Youth Centre was completed and handed over the Authority on 5 th February 2016 pending landscaping and completion of the perimeter however by the time of the audit this had not been done although the Centre was operational. This was attributed to land encroachment and the resultant court cases. yet  There was no strategy to sustain the Centre in case of a reduction in funding as the Centre is fully funded by the Authority and has not  developed alternative revenue streams from its operations. It was noted that the students that access services at the Centre are not charged any fees and the student’s access the services at no cost.  The Centre given its location mainly attracts youths in the surrounding areas of Makindye living out the other 4 divisions of Kampala", "The Centre is 100% funded under NTR and the Authority is committed to continue supporting the Centre. Management is soliciting for partnerships to support the Centre. To date, Management  secured partnerships  Plan International to the innovation Hub and, Art Ericson to set up a multi-purpose skills and Sports Centre worth $1m.The procurement of scoring machine  is underway. for shoe making has  from support a"]], "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 17, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 69}}, {"content": " With the School land not fenced there is a risk of vandalism, insecurity and encroachment of school land. The non-payment of teachers affects their morale and thus will eventually lead to poor performance.  \n  \nIn the absence of alternative revenue streams, the Centre may not sustain its services to the Community.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 70}}, {"content": "I advised the Accounting Officer to:", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 71}}, {"content": "  \nEngage market committees to ensure that market facilities are regularly cleaned.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 72}}, {"content": " Continue engaging the relevant stake holders to have the issues affecting service deliver in the Health Centres addressed.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 73}}, {"content": " Continue liaising with Ministry of Education and other stake holders in regards to wage enhancement, increase in the number of teachers in the schools, construction of toilets among others.", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 74}}, {"content": "John F.S. Muwanga", "metadata": {"headings": [{"headings_0": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}, {"headings_1": {"content": "Other Reporting Responsibilities", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 75}}, {"content": "KAMPALA", "metadata": {"headings": [{"headings_0": {"content": "AUDITOR GENERAL", "page": 18}}, {"headings_1": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 76}}, {"content": "20 th December, 2018.", "metadata": {"headings": [{"headings_0": {"content": "AUDITOR GENERAL", "page": 18}}, {"headings_1": {"content": "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION", "page": 12}}], "page": 18, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 77}}, {"content": [["**Vote function output**", "**Item description**", "**Planned outputs/Quantity**", "**Amount (Shs) budgeted**", "**Amount released (Shs)**", "**Actual output/ Quantity**", "**Audit Remarks**", "**KCCA Management response**"], ["**Development Project:** Kampala Rehabilitation 1253 Road", "**Output:** 04 06 80 Urban Road Construction", " Populating iRoads RMS with traffic count data; further training on iRoads; final  project presentation  and handover.  Section maintenance and attending to any defects that may arise (Lugoba - 3.85km, Bahai - 2.8km, Kyebando Central, Kawaala  Maintenance attending defects that and to any may arise is ongoing on Lugoba, Bahai, Kyebando  Central,  section. Kawaala  Completion of snags and release of retention at Mutundwe, Weraga, Wansaso, Kiyimba, Kyabaggu  Contract closed on", "46,576,457,949", "46,576,457,949", "(Lugoba -Populating iRoads RMS with traffic count  data; further training on iRoads;  final project presentation and handover.  -Section maintenance and attending to any defects that may arise  - 3.85km, Bahai - 2.8km, Kyebando Central, Kawaala -Maintenance and attending to any defects that  may  ongoing  Lugoba,  Kyebando  Central, Kawaala section.   Completion of and of at is on Bahai, arise snags release retention Mutundwe, Weraga, Wansaso, Kiyimba, Kyabaggu  Contract closed", "UGX. 1,059,526,117 on other activities such as compensations  and payment for taxes for street light which was budgeted under other line items as a result the following activities were not completed. to maintenance  and attending  any defects that may arise (Lugoba - 3.85km, Bahai - 2.8km, Kyebando  Central, Kawaala  to  -Maintenance and attending  any defects that may arise on ongoing on Lugoba,  Bahai, Kyebando", "The observation is noted planned outputs  for Construction of walkways  and accesses  on Kisaasi Kyanja, kawa  lane, Kataza  road, Kinawataka road, and Coronation road as observed were in error at input of the budget tool. See page 133 of MPS. The"]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 20, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 78}}, {"content": [["", " the  following roads Go down, Bukasa  ring, Kibuli, Church. Completion  of construction  of walkways  and accesses  on Kisaasi  Kyanja, kawa lane, Kataza rd., Kinawataka road, coronation road.", "", "", "", "on the following roads  Go down,Bukasa ring,  Church Kibuli,", "", "", null], ["0423 Facilities Grant Schools'", "Output 070880 :Primary education infrastructure construction", "School  provided Government primary schools infrastructure in aided", "454,642,450", "454,642,450", "School infrastructure in aided provided Government primary schools", null, "funds, however Management received all  UGX.42,250,263  was diverted for the Contractors for four unit single storeyed staff quarters at Kansanga Seed Secondary School which had a separate budget line.", "The Observation is noted. Payment of UGX 42,250,263 for  Kansanga Seed Secondary School  was erroneously charged out of this budget line under  Primary school infrastructure instead  Secondary school’s infrastructure and correction was not made in time. of The"], ["", "Output 070881 Secondary", "School provided infrastructure in", "936,544,745", "936,544,745", "Phase 1 of the project to construct a 9-", null, "Despite receiving all the funds only UGX.", "The Observation is noted."]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 21, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 79}}, {"content": "20", "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 21, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 80}}, {"content": "education Government aided infrastructure secondary schools construction", "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 22, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 81}}, {"content": "classroom block at 642,171,765 was spent  \nKansanga  \nSeed on secondary schools The Payment of Secondary School is and the balance of UGX 294,372,980 now complete.  \nUGX.294,372,980 was for Kyaggwe road spent on refurbishment primary school of Kyaggwe road was erroneously Primary school which charged out of had a separate budget this budget line line. under secondary school infrastructure instead  \nof primary school’s infrastructure and correction was not made in time.", "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 22, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 82}}, {"content": "21", "metadata": {"headings": [{"headings_0": {"content": "Appendix 1: Budget performance", "page": 20}}, {"headings_1": {"content": "AUDITOR GENERAL", "page": 18}}], "page": 22, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 83}}, {"content": [["**Date**", "**Payment Reference [IFMS /EFT]**", "**Payee**", "**Details**", "**Cumulative Interest in the Certificate**", "**Cumulative Interest under the Contract as Internal audit payment review reports**"], ["18/01/2018", "16347238", "Stirling Engineering Ltd", "IPC no.12 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1", "2,331,451", "229,387,964"], ["18/01/2018", "16347237", "Stirling Engineering Ltd", "IPC no.13 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1", "26,424,436", "255,812,400"], ["3/5/2018", "17628404", "Stirling Engineering Ltd", "IPC no.14 for reconstruction and/or upgrading of the NMT pilot corridor (Namirembe-Luwum), Archer, Mengo hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1", "13,575,539", "269,387,939"], ["14/06/2018", "18106732", "Stirling Engineering Ltd", "IPC No.15 in relation to the Reconstruction and/or Upgrading of the NMT Pilot Corridor (Namirembe - Luwuum) Archer , Mengo Hill, Nakivubo Channel, Mpabaana, Luzige, Mutebi and Semugooma Rds in Central Division.", "268,140,209", "268,140,209"], [null, null, null, "Ref: KCCA/WORKS/15- 16/00074-LOT 1", null, null], ["", "S/Total 1", "S/Total 1", "Accumulated Interest Paid On Contract Ref: KCCA/WORKS/15- 16/00074-LOT 1", "", "268,140,209"], ["LOT 4", "", "", "", "", ""], ["17/01/2018", "16335733", "Stirling", "IPC No.11 in relation to", "83,410,202", "444,930,343"]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 11-", "page": 23}}, {"headings_1": {"content": "Appendix 1: Budget performance", "page": 20}}], "page": 23, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 84}}, {"content": [["**Date Date**", "**Payment Reference [IFMS /EFT]** **Payment Reference [IFMS /EFT]**", "**Payee Payee**", "**Details Details**", "**Cumulative Interest in the Certificate** **Cumulative Interest in the Certificate**", "**Cumulative Interest under the Contract as Internal audit payment review reports** **Cumulative Interest under the Contract as Internal audit payment review reports**"], ["18/01/2018 18/01/2018", "16347238 16347238", "Stirling Engineering Ltd Stirling Engineering Ltd", "IPC no.12 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1 IPC no.12 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1", "2,331,451 2,331,451", "229,387,964 229,387,964"], ["18/01/2018 18/01/2018", "16347237 16347237", "Stirling Engineering Ltd Stirling Engineering Ltd", "IPC no.13 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1 IPC no.13 for reconstruction/or upgrading of NMT pilot corridor, Archer, Mengo Hill, Nakivubo channel, Mpabaana, Luzige, Mutebi and Semugooma roads in Central div. ref: KCCA/WORKS/15- 16/00074-LOT1", "26,424,436 26,424,436", "255,812,400 255,812,400"]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 11-", "page": 23}}, {"headings_1": {"content": "Appendix 1: Budget performance", "page": 20}}], "page": 23, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 85}}, {"content": [["14/06/2018 14/06/2018", "18106732 18106732", "Stirling Engineering Ltd Stirling Engineering Ltd", "IPC No.15 in relation to the Reconstruction and/or Upgrading of the NMT Pilot Corridor (Namirembe - Luwuum) Archer , Mengo Hill, Nakivubo Channel, Mpabaana, Luzige, Mutebi and Semugooma Rds in Central Division. IPC No.15 in relation to the Reconstruction and/or Upgrading of the NMT Pilot Corridor (Namirembe - Luwuum) Archer , Mengo Hill, Nakivubo Channel, Mpabaana, Luzige, Mutebi and Semugooma Rds in Central Division.", "268,140,209 268,140,209", "268,140,209 268,140,209"], [null, null, null, "Ref: KCCA/WORKS/15- 16/00074-LOT 1 Ref: KCCA/WORKS/15- 16/00074-LOT 1", null, null], ["", "S/Total S/Total  1 1", "S/Total S/Total  1 1", "Accumulated Interest Paid On Contract Ref: KCCA/WORKS/15- 16/00074-LOT 1 Accumulated Interest Paid On Contract Ref: KCCA/WORKS/15- 16/00074-LOT 1", "", "268,140,209 268,140,209"], ["LOT LOT  4 4", "", "", "", "", ""], ["17/01/2018 17/01/2018", "16335733 16335733", "Stirling Stirling", "IPC IPC  No.11 No.11  in in relation relation to to", "83,410,202 83,410,202", "444,930,343 444,930,343"]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 11-", "page": 23}}, {"headings_1": {"content": "Appendix 1: Budget performance", "page": 20}}], "page": 23, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 86}}, {"content": [["", "Engineering Ltd", "reconstruction and/upgrading of Magambo, Dembe Kirowoza, Kiziri, Kigoowa, Kimera, Kisalita, Kisosonkole and Robert Mugabe roads in Nakawa Division.", "", "", null], ["Ref: KCCA/SUPLS/15- 16/00074-LOT 4", null, "", "", null, null], ["", "G/Total", "G/Total", "Total Cumulative Interest Paid For Contracts Lot 1 and Lot 4", "", "713,070,552"]], "metadata": {"headings": [{"headings_0": {"content": "Appendix 11-", "page": 23}}, {"headings_1": {"content": "Appendix 1: Budget performance", "page": 20}}], "page": 24, "document_name": "KCCA Report of Auditor General 2018.pdf", "index": 87}}], "table_of_contents": {"content": ["LIST OF ACRONYMS - 2", "Opinion - 3", "Basis of Opinion - 3", "Key Audit Matters - 4", " Implementation of Budget approved by Parliament - 4", " Domestic Arrears - 5", "Emphasis of Matter - 6", " Non-remittance of Pay As You Earn (PAYE) and Valued Added Tax (VAT) - 6", " Outstanding trade and other receivables - 7", " Legal costs - UGX19,445,101,578 - 8", "Other Matter - 8", " Review of Multiplex Contract - 8", "Other Information - 9", "Responsibilities of the Accounting Officer for the Financial Statements - 10", "Auditor’s Responsibilities for the Audit of the Financial Statements - 10", "Other Reporting Responsibilities - 12", "REPORT ON THE AUDIT OF COMPLIANCE WITH LEGISLATION - 12", " Interest on Delayed Payments-UGX 714,318,282 - 12", " Unapproved Human Resource Manual - 13", " Staffing gaps - 13", " Certificate of compliance (CoC) by NPA - 14", " Field inspections - 15"], "page": 1}}