[{"type": "heading", "level": 1, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 3, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF", "page": 0}, {"type": "heading", "level": 3, "content": "UGANDA CIVIL AVIATION AUTHORITY (UCAA) FOR THE FINANCIAL YEAR ENDED 3O TH JUNE 2019", "page": 0}, {"type": "heading", "level": 3, "content": "TABLE OF CONTENTS", "page": 1}, {"type": "tableOfContent", "content": ["  1.0 Modification of the Passenger Terminal Building at Entebbe International Airport - 1", "  1.1 Excess Quantities - 1", "  1.2 Payment for unjustified preliminaries - UGX 790,492,917 - 1", "Key Audit Matter - 2", "  2.0 Implementation of the approved budget - 2", "Other information - 3", "Responsibilities of Directors for the Financial Statements - 3", "Auditor’s Responsibilities for the Audit of the Financial Statements - 4", "Other Reporting Responsibilities - 5", "Report on Compliance with Legislation - 5", "  3.0 Technical/ Engineering Audit of the Two Projects implemented by Uganda - Civil", "Aviation Authority (UCAA): - 5", "  3.1 Design and Build of Entebbe International Airport Upgrading and Expansion Project - 6", "  3.2 Modification of the Passenger Terminal Building at Entebbe International Airport - 10", "  4.0 Arua Aerodrome - 13", "Appendix I: Implementation of planned activities - 18", "Appendix II: Delays in procurement process - 20"], "page": 1}, {"type": "heading", "level": 1, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF UGANDA CIVIL AVIATION AUTHORITY (UCAA)", "page": 2}, {"type": "paragraph", "content": "FOR THE YEAR ENDED 30 TH JUNE, 2019", "page": 2}, {"type": "heading", "level": 2, "content": "THE RT. HON. SPEAKER OF PARLIAMENT", "page": 2}, {"type": "paragraph", "content": "Opinion", "page": 2}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Civil Aviation Authority (the Authority) and its subsidiary, Entebbe Cold Stores Limited (collectively referred to as the Group) as set out on pages 4 to 41. These financial statements comprise the consolidated statement of financial position as at 30 th June 2019 and the consolidated statements of comprehensive income, changes in equity and cash flows for the year then ended, with the statement of financial position of the Authority standing alone as at 30 th June 2019, together with a summary of significant accounting policies and other explanatory information.", "page": 2}, {"type": "paragraph", "content": "In my opinion, except for the possible effects of matters described in the Basis for Qualified Opinion paragraph, the accompanying financial statements give a true and fair view of the state of the financial affairs of Civil Aviation Authority (the Authority) and its subsidiary (together the Group) as at 30 th June 2019 and of its profit and cash flows for the year then ended in accordance with International Financial Reporting Standards.", "page": 2}, {"type": "heading", "level": 2, "content": "Basis for Qualified Opinion", "page": 2}, {"type": "heading", "level": 2, "content": "1.0 Modification of the Passenger Terminal Building at Entebbe International", "page": 2}, {"type": "paragraph", "content": "Airport  \nThe Contract for the Modification of the Passenger Terminal Building (PTB) at Entebbe International Airport (EIA) is being executed at a contract value UGX. 42,695,026,700. At the time of audit (5th to 27 th August 2019) physical progress of the works reported in the June progress report was at 42.193% with a time lapse of 85.7% while the financial progress was reported at 23.08%. The technical audit of works undertaken revealed excess quantities and unjustified payment of preliminaries (as explained below) which as a whole have a material effect on the expenditures reportedly incurred by UCAA during the year.", "page": 2}, {"type": "paragraph", "content": "contract’s committee meeting which rejected any costs due to the third extension of time.", "page": 3}, {"type": "paragraph", "content": "I conducted my audit in accordance with International Standards of Supreme Audit Institutions (ISSAIs). My responsibilities under those standards are further described in the Auditor’s Responsibilities for the Audit of the Financial Statements section of my report. I am independent of the Uganda Civil Aviation Authority in accordance with the Constitution of the Republic of Uganda (1995) as amended, the National Audit Act, 2008, the International Organization of Supreme Audit Institutions (INTOSAI) Code of Ethics, the International Ethics Standards Board for Accountants Code of Ethics for Professional Accountants (Parts A and B) (IESBA Code), and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda.", "page": 3}, {"type": "paragraph", "content": "I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my opinion.", "page": 3}, {"type": "heading", "level": 2, "content": "Key Audit Matter", "page": 3}, {"type": "paragraph", "content": "A Key audit matter is that matter which, in my professional judgment, was of most significance in my audit of the financial statements of the current period. This matter was addressed in the context of my audit of the financial statements as a whole, and in forming my opinion thereon, and I do not provide a separate opinion on this matter. I have determined the matter described below to be a key audit matter communicated in my report.", "page": 3}, {"type": "heading", "level": 2, "content": "2.0 Implementation of the approved budget", "page": 3}, {"type": "paragraph", "content": "It has been observed on the global Public Sector level that over the years planned and budgeted activities of a number of Government entities are not implemented thereby affecting service delivery. In the overall office wide planning, implementation of the budget was taken as a key area. Risks such as revenue shortfalls and gaps in monitoring and supervision that are likely to be the causes of failure to implement entity planned activities were assessed. The focus was put on those key planned capital outputs of the entity which greatly impact on delivery of services.  \nBased on the procedures performed, I observed that Uganda Civil Aviation Authority has a mandate that covers: 1) regulation of air transport, 2) provision of air navigation and air traffic services, and 3) ownership, development and operation of aerodromes in Uganda.", "page": 3}, {"type": "table", "content": [["**No**", "**Observations**", "**Recommendations**"], ["2.1", "A review of the revenue performance revealed that UCAA had projected to receive UGX 234.137 bn under the approved budget. UCAA was able to realize UGX 248.198 million yielding a surplus of UGX 14.061 bn. surplus (6%) registered indicates a possibility of setting unrealistically low targets for revenue collection by the Authority. attributed the good performance to improvements in the revenue follow up. **Revenue Performance** The Management", "Management  should critically  the Authority  revenue sources and set more realistic targets. assess also  follow outstanding  from  the Authority debtors. should up revenue various Management"], ["2.2", "**Implementation of planned activities**  In order to achieve its mandate, the UCCA planned to implement and achieve a number of activities and outputs under various programmes and projects. According to the budget and work plan, UCCA planned to implement a total of forty three (43) outputs during the year. Of these, the audit team sampled eighteen (18) outputs representing 42% of the total outputs. It was established that of the sampled outputs, only 1 output was fully achieved and 3 outputs partially achieved while 14 were not implemented at all. Refer to **Appendix I** for details. of planned activities affects the achievement of the UCAA objectives. Management explained that Government funding was not received for a number of activities that were planned. Non-implementation", "the Management  should liaise with the relevant authorities to ensure that  funding commitments  are adhered in a timely manner to facilitate achievement of the planned outputs."]], "page": 4}, {"type": "paragraph", "content": "Other information", "page": 4}, {"type": "paragraph", "content": "The Directors are responsible for the other information. The other information comprises the Annual Report. The other information does not include the financial statements and my auditors’ report thereon. My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 4}, {"type": "paragraph", "content": "In preparing the Financial Statements, the directors are responsible for assessing the Authority’s ability to continue as a going concern, disclosing, as applicable, matters related to going concern and using the going concern basis of accounting unless the directors either intend to liquidate the Authority or to cease operations, or have no realistic alternative but to do so.  \nThe Directors are responsible for overseeing the Authority’s financial reporting process.", "page": 5}, {"type": "heading", "level": 2, "content": "Auditor’s Responsibilities for the Audit of the Financial Statements", "page": 5}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the Financial Statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor's report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance ISSAIs will always detect a material misstatement when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in the aggregate, they could reasonably be expected to influence the economic decisions of users taken on the basis of these Financial Statements.", "page": 5}, {"type": "paragraph", "content": "As part of an audit in accordance with ISSAIs, I exercise professional judgment and maintain professional scepticism throughout the audit. I also:", "page": 5}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for our opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 5}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Group’s internal control.", "page": 5}, {"type": "list", "content": "- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by management.", "page": 5}, {"type": "list", "content": "- Conclude on the appropriateness of management’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Authority’s ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Authority to cease to continue as a going concern.", "page": 5}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 5}, {"type": "paragraph", "content": "I communicate with the Directors regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.  \nI also provide the Directors with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with him/her all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 6}, {"type": "paragraph", "content": "From the matters communicated with the Directors, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 6}, {"type": "heading", "level": 2, "content": "Other Reporting Responsibilities", "page": 6}, {"type": "paragraph", "content": "As required by the Civil Aviation Authority Act and the National Audit Act, I report to you, based on my audit that:", "page": 6}, {"type": "list", "content": "- I have obtained all the information and explanations which to the best of my knowledge and belief were necessary for the purpose of my audit;\n- In my opinion, proper books of account have been kept by the Authority, so far as appears from my examination of those books; and\n- The Authority's statement of financial position and statement of financial performance are in agreement with the books of account.", "page": 6}, {"type": "heading", "level": 2, "content": "Report on Compliance with Legislation", "page": 6}, {"type": "paragraph", "content": "In accordance with Section 19 (1) of the National Audit Act, 2008, I report to you, based on my work described on the audit of Financial Statements, that; except for the matters raised in compliance with legislation section below, and whose effect has been considered in forming my opinion on financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 6}, {"type": "paragraph", "content": "The major objective of the technical audit was to evaluate whether the projects are being constructed in accordance with sound engineering principles, technical standards and agreed specifications and at reasonable cost to achieve the desired quality and functionality. Set out below are the key audit findings resulting from the engineering/technical audit.", "page": 7}, {"type": "heading", "level": 2, "content": "3.1 Design and Build of Entebbe International Airport Upgrading and", "page": 7}, {"type": "paragraph", "content": "Expansion Project  \nThe design and build of Entebbe International Airport (EIA) project is being implemented by Civil Aviation Authority (UCAA) at a contract price of USD 200,000,000 and supervised by Dar Al-Handasah (Shair & Partners) supervising consultants’ at a supervision cost of USD 1,183,821,789 VAT Inc. At the time of audit in October 2019, physical progress was at 64% as reported in the June 2019 progress report. The following matters were observed on the technical audit of the Project:", "page": 7}, {"type": "heading", "level": 2, "content": "3.1.1 Planning and design (i) Lack of Project Cost Estimate and Scope Schedule", "page": 7}, {"type": "paragraph", "content": "During review of the contract for implementation of the works including addenda No 1 and 2 for the contract for the Design and Build of the Upgrading and Expansion of Entebbe International Airport Project, it was noted that a complete project criteria detailing the Final project scope, budget and schedules was not carried out by the project Owner/client (CAA) before the design and build contractor was selected. It is expected that for projects conceived to be implemented through a design and build method, a comprehensive project criteria is developed by the owner before any design and build contractor is selected. The project criteria should include amongst other requirements the project scope, budget, and schedule.  \nMuch as an initial cost of the project was included in the document “CAA – Paper of justification for expansion and upgrade of EIA”, and relied upon, it lacked proper basis. This denied the project owner/client information on the final total project cost after design which may result in further variations, extensions of time and delays to the projects.", "page": 7}, {"type": "paragraph", "content": "I advised the Accounting officer to ensure that for future projects, detailed and complete project criteria with project scope, schedules and budget are prepared to enable proper decision making in respect to costing of the projects and sourcing of funds.", "page": 7}, {"type": "paragraph", "content": "Exim bank of China. Accordingly, the CAA contracts committee approved the project cost in the feasibility study on 23rd September 2014 without undertaking an independent evaluation of these costs but rather sought for PPDAs clearance of the contract on 2nd October 2014, contrary to Regulation 3 of the PPDA (Rules and Methods for Procurement of Supplies, Works and Non- Consultancy Services) Regulations, 2014 which require that during initiation of procurement, a procuring entity shall ensure that; a clear description of the works, the estimated value of the works, confirmation of availability of funding; and the approval of the procurement requirement are undertaken.", "page": 8}, {"type": "paragraph", "content": "I advised Management to ensure that for such contracts, the feasibility estimates proposed by the contractor or client consultant are independently evaluated before they are used as a basis for contracting.", "page": 8}, {"type": "heading", "level": 2, "content": "(iii) Lack of Scheme/Concept Designs", "page": 8}, {"type": "paragraph", "content": "The review of project documentation established that scheme/concept designs which are a basis for initial cost estimation and alignment of the project cost and budget available, were not availed for audit. It is therefore not clear how CAA arrived at the estimated cost of USD 270,041,000 for the upgrade and expansion of EIA project under the externally funded category. This stage was very important for this type of design- build method of project delivery adopted for the expansion project.", "page": 8}, {"type": "paragraph", "content": "I advised the Accounting officer to ensure that for future projects initial scheme/concept designs are prepared and evaluated.", "page": 8}, {"type": "heading", "level": 2, "content": "(iv) Unexplained Varying of Employers requirement for Construction of Ground", "page": 8}, {"type": "paragraph", "content": "Car Park  \nThe feasibility study report (Technical proposal) submitted to CAA in December 2013 by CCCC ref Page 71/73, included a table summarizing the works to be included under phase I of the project, and in this technical proposal which was costed at USD 200,000,000, construction of a ground car park was included. However, from the review of the signed contract agreement for the design and build of Entebbe International Airport upgrading and expansion project between CAA and the contractor (CCCC ) with a contract value of USD 200,000,000 dated 8 th October 2014 and the subsequent addenda 1 and 2 dated 12 th Jan 2015 and 22 nd June 2015 respectively, it was noted that construction of the ground car park had not been included yet it was part of the employer’s requirement and had also been costed in the contractors technical proposal.", "page": 8}, {"type": "paragraph", "content": "(v)", "page": 9}, {"type": "heading", "level": 2, "content": "Poor Document Management by CAA", "page": 9}, {"type": "paragraph", "content": "I noted weaknesses in keeping of contract documents. Many contract documents such as copies of design documents for the project, interim payment certificates, progress reports and materials test results were not maintained by the employer “CAA”. As a result, these documents had to be availed by the consultant upon request by CAA during the audit.", "page": 9}, {"type": "paragraph", "content": "I have advised the Accounting Officer to ensure that the contract management team takes full control of document management and storage in respect to this contract during project implementation.", "page": 9}, {"type": "heading", "level": 2, "content": "3.1.2 Delayed implementation of works", "page": 9}, {"type": "paragraph", "content": "Review of the works contract and progress reports showed that the works which commenced on 8 th October 2016 are expected to achieve 100% completion on 9 th May 2021. The progress report for June 2019 shows that the works had achieved only 43.01% physical progress against an elapsed project time of 60.14% which translates into a delay of 10 months. It was also noted that 100% completion of the new cargo complex was to be achieved by 2 nd Dec 2018 (according baseline program", "page": 9}, {"type": "list", "content": "- which has never been updated). However by June 2019, progress of works achieved was only 80.45%. This, however, is on the critical path of commencement of construction of the Passenger Terminal Building (PTB) which was expected to start on 3 rd Dec 2018 with the demolition of existing cargo building; this activity had not started at the time of audit and may affect the completion time of the project.", "page": 9}, {"type": "paragraph", "content": "I advised the Accounting Officer to put in place measures to ensure delayed works are speeded up to meet the completion time.", "page": 9}, {"type": "heading", "level": 2, "content": "3.1.3 Non Adherence to Contract Conditions in respect of Work Programme", "page": 9}, {"type": "paragraph", "content": "It was noted that, the contractor continuously defaulted in complying with the approved work program by delayed submission of design and shop drawings for approval by the consultant. This has impacted on work progress and timely submission of IPCs for payment.", "page": 9}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that the Contractor adheres to the approved work programme and contract requirements with respect to timely submission of design and shop drawings for approval by the consultant.", "page": 9}, {"type": "heading", "level": 2, "content": "3.1.5 Delayed payment of Interim payment certificates (IPCs)", "page": 10}, {"type": "paragraph", "content": "Clause 14.7 of Addendum No.1 of the works contract page 28 /29 of the particular conditions of contract states “payments right from the Interim payment certificate and the final payment certificate shall be made within 56 days upon receipt of the relevant certificates by the Employer.”", "page": 10}, {"type": "paragraph", "content": "A review of payments to the contractor revealed delayed payment of 12 IPCs (IPCs No 11, 12, 13, 14, 15 to No 22) with an invoice value of USD 23,130,646. The payment delays for the IPCs ranged from 94 days to 461 days after submission by the consultant. Delayed payment of IPCs causes delays in the progress of works and may result in the contractor charging interest.", "page": 10}, {"type": "paragraph", "content": "I advised the Accounting Officer to pay all IPCs submitted within the stipulated time period in the contract.", "page": 10}, {"type": "heading", "level": 2, "content": "3.1.6 Unsubstantiated claims in the Claims register", "page": 10}, {"type": "paragraph", "content": "A review of the Monthly progress report (MPR) No 24 of May 2019 and the claims register revealed that a total of 11 notices to claim have been submitted, however audit was not availed details and treatment of each of the claims.  \nIn the circumstances I was unable to ascertain the accuracy and validity of each of these claims detailed in the claims register.", "page": 10}, {"type": "heading", "level": 2, "content": "3.1.7 Quality of works", "page": 10}, {"type": "paragraph", "content": "An inspection of the site laboratory revealed that the equipment for the basic quality tests were in place, and were all calibrated. The respective testing standards were also availed, and the team at the laboratory demonstrated competence in handling the aspects of quality control of the works.", "page": 10}, {"type": "paragraph", "content": "Documentation relating to concrete and AC mix designs were obtained from the site laboratory. Test results of the concrete were also retrieved from the laboratory, and the concrete was seen to be meeting the required specifications. There were no field tests carried out on the concrete, but the concrete at site appeared of good quality, except for a few instances of honey combing at edges adjacent to the formworks.", "page": 10}, {"type": "paragraph", "content": "The lab tests that were carried out included:  \ni.  \nPhysical tests on the crushed rock aggregates and sand  \nii.  \nChemical tests on the crushed rock aggregates and sand -outsourced iii.  \nPhysical tests on the reinforcement steel  \niv.  \nCompressive strength tests on concrete cubes  \nv. Quality tests on AC cores  \nvi. Water for concrete  \nvii.  \nDCP tests to establish subgrade strengths", "page": 10}, {"type": "heading", "level": 2, "content": "3.1.8 Inspection of works", "page": 11}, {"type": "paragraph", "content": "The audit team inspected the works on 2 nd , 3 rd and 5 th September 2019, in the presence of the Chief Engineer CAA, Consultants and representatives from the Contractor. Works were still in progress, defects of visual observations are detailed in the pictorial presentation of the inspections in a separate detailed report of the technical audit.", "page": 11}, {"type": "heading", "level": 2, "content": "3.1.9 Supervision of works - Delayed Procurement of Supervision Consultants", "page": 11}, {"type": "paragraph", "content": "It is good practice for the consultant to be procured earlier and be in place prior to procurement of the contractor. Should the need arise to have design reviews undertaken, sufficient time should be allowed for the Consultants to finalize the design review and prepare tender documents based on the revised design.", "page": 11}, {"type": "paragraph", "content": "It was noted that due to the hurdles that were faced during procurement, the consultant commenced services 10 months after the works commenced. This introduced the need for the employer to institute a supervision team who supervised the contractor in the initial stages of execution.", "page": 11}, {"type": "paragraph", "content": "I advised the Accounting Officer that going forward, management should ensure that supervision consultants are procured earlier and are in place prior to procurement of the contractor.", "page": 11}, {"type": "heading", "level": 2, "content": "3.2 Modification of the Passenger Terminal Building at Entebbe International", "page": 11}, {"type": "paragraph", "content": "Airport  \nThe Contract for the Modification of the Passenger Terminal Building (PTB) at Entebbe International Airport (EIA) is being executed by Seyani Brothers & Co. (U) Limited at a contract value UGX. 42,695,026,700 tax inclusive with SsentoogoS & Partners Limited as the supervising consultants at a supervision cost of UGX 1,183,821,789, tax inclusive. At the time of audit (5th to 27 th August 2019) physical progress of the works reported in the June progress report was at 42.193% with a time lapse of 85.7% while the financial progress was reported at 23.08%.", "page": 11}, {"type": "heading", "level": 2, "content": "3.2.1 Inadequate user needs assessment at Project planning and design", "page": 11}, {"type": "paragraph", "content": "Review of project documents revealed that a design consultant (Arch design Limited), was engaged to carry out the design for the project and this was submitted to CAA and paid for at a cost of UGX 613,526,250. The review of design report however revealed that the current supervising consultant who was engaged for the design review and update and supervision of the project redesigned the entire project owing to new demands by the client. This indicates that there were shortcomings in the needs assessment phase of the project.", "page": 11}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that in future, design review reports are prepared with detailed associated project costs to enable proper decision making.", "page": 12}, {"type": "heading", "level": 2, "content": "3.2.3 Slow progress of works", "page": 12}, {"type": "paragraph", "content": "The review of progress reports revealed that although a commencement order for works was issued on 1 st June 2016, the works commenced 9 months later. This delay in commencement as well as other contract management issues like design update and change of scope, resulted in several extensions of time totaling to 24.5 months. Audit noted that even with the extension of 24.5 months, by the end of June 2019, the physical progress of works was only 42.193%, against an elapsed project time of 85.7%.", "page": 12}, {"type": "paragraph", "content": "The Accounting Officer should ensure that for future projects, the construction site is fully accessible by the contractor, before issuing a commencement order and any project redesign is planned for within project implementation time. In addition, the Accounting Officer needs to ensure that measures are put in place to have works completed in time.", "page": 12}, {"type": "heading", "level": 2, "content": "3.2.4 Payment for unjustified preliminaries - UGX 790,492,917", "page": 12}, {"type": "paragraph", "content": "As explained in the paragraph 1.0 above (Basis for Qualified Opinion), the review of payments revealed that the Project Manager sanctioned a payment for UGX 494,909,091 as running expenses to the contractor for the period July 2016 to February 2017 yet no works were executed in this period since the contractor did not have access to site. Physical works commenced on 1 st March 2017. Furthermore, a total of UGX 295,583,826 had been paid as per IPC 22, as costs due to extension of time in contravention of the decision by the CAA Board as contained in the letter dated 8 th November. It was also not in line with the decision of the 497 th contract’s committee meeting which rejected any costs due to the third extension of time.", "page": 12}, {"type": "paragraph", "content": "I advised the Management of UCAA to further investigate, with a view to recover, the validity and rationale of the time related preliminaries amounting to UGX 494,909,091 as running expenses, and UGX 295,583,826 paid as costs due to extension of time (EOT) to the contractor as per IPC 22.", "page": 12}, {"type": "paragraph", "content": "price adjustment. The audit team reviewed the submitted price adjustment claim and noted irregularities. The detailed findings are in my separate technical / engineering report on the project.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that all errors are corrected in the contractor’s computation before payment. I also advised that for future projects, baseline data for price adjustment is detailed in the signed contract.", "page": 13}, {"type": "heading", "level": 2, "content": "3.2.6 Delivery of only one floor at contract expiry", "page": 13}, {"type": "paragraph", "content": "CAA signed a contract with Seyani Brothers for a project to be delivered fully functional within 17 months. After project extension of 24.5 months, audit noted that the project will not be fully functional and at expiry, only the first floor (the departures level), will be operational with all other components not functional. It should be noted that the public will not receive the facility as expected, and the unfinished works may be a safety hazard to the users of Entebbe Airport. It is also not clear whether the terminal building will meet the requirements for the occupational permit if it is not fully completed.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to put in place measures to ensure that the project is delivered complete as expected.", "page": 13}, {"type": "heading", "level": 2, "content": "3.2.7 Delayed payment of IPCs", "page": 13}, {"type": "paragraph", "content": "Clause 42.2 of Addendum No.1 states that “the project manager shall check the", "page": 13}, {"type": "heading", "level": 2, "content": "Contractor’s statement and certify within 21 days, the amount to be paid", "page": 13}, {"type": "paragraph", "content": "to the contractor’’. Under GCC 43.1, “the Employer shall pay the contractor the amounts certified by the project Manager within 30 days of the date of each certificate”. As detailed in table 3-3 under chapter 3 of my separate technical audit report, I noted that there were incidences where the project manager delayed to certify contractor’s IPCs, and delayed payments. The review of correspondences showed that the contractor claimed for interest on delayed payments amounting to UGX.104,232,610. Such payments should be avoided by adhering to contractual terms to avoid financial loss to government.", "page": 13}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that payments to the contractor are made in time.", "page": 13}, {"type": "paragraph", "content": "payment certificates. It was noted that the contractor had been overpaid by UGX 2,156,511,614.", "page": 14}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that the over payment of UGX 2,156,511,614 made to the contractor is further investigated and recovered.", "page": 14}, {"type": "heading", "level": 2, "content": "3.2.10 Supervision of Works (i) Absence of key personnel on site", "page": 14}, {"type": "paragraph", "content": "Through audit inspection of works, it was noted that in spite of the magnitude of the project, only a clerk of works is present on site to supervise all the works. This project comprises of concrete, steel, complex mechanical and electrical works, and AC works, which cannot be supervised by one individual. This results in ineffective supervision of works by the consultant.", "page": 14}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that all the required consultant’s personnel are on site as per the signed contract for effective supervision of works.", "page": 14}, {"type": "heading", "level": 2, "content": "(ii) Execution of Steel works without Bar Bending Schedules", "page": 14}, {"type": "paragraph", "content": "It is required that after structural design, construction drawings are detailed, and a bar bending schedule that details reinforcement cutting and bending length is generated, and issued to the contractor to help in bending, and placement of bars. However, it was noted that steel works for the project were executed without Bar Bending Schedules (BBS) from the Structural Engineer (letter CAA/SRVCS/14- 15/00289 dated 18th July 2018). Absence of the BBS means there was a challenge in quality checks and quantification of steel during implementation.  \nThe Project Manager should ensure that the Structural Engineer prepares and issues the contractor all required data prior to physical works implementation.", "page": 14}, {"type": "heading", "level": 2, "content": "3.2.11 Erroneously detailed structural drawings, and Bar bending Schedules", "page": 14}, {"type": "paragraph", "content": "The review of the structural drawings issued to the contractor revealed errors in the detailing of the reinforcement, and the bar bending schedules for the project which might have resulted in an increase in the contractors claim for steel as detailed under section 2.2.9 (Quantity verification). Poor detailing of structural drawings also leads to errors during placement of reinforcement and could result in an over or under designed project.", "page": 14}, {"type": "paragraph", "content": "disembarking passengers, 658 passengers in transit, and 10,092 embarking passengers on domestic flights.", "page": 15}, {"type": "paragraph", "content": "The aerodrome contributed USD 390,549 and 68,764,400 in revenue to CAA for the three years (USD 128,379 and UGX 25,092,000 in 2016/2017; USD 131,743 and UGX 21,411,400 in in 2017/2018 and USD 130,427 and UGX 22,261,000 in 2018/2019.", "page": 15}, {"type": "paragraph", "content": "Paragraph 1.4.1 of ICAO Annex 14 Volume 1 requires certification of aerodromes used for international operations in accordance with the specifications contained in this Annex as well as other relevant ICAO specifications through an appropriate regulatory framework.", "page": 15}, {"type": "paragraph", "content": "Given the importance of the aerodrome, I planned to carry out specific procedures on the general operations and management of the aerodrome to ascertain whether the aerodrome was being managed in a manner that allows it to achieve its objectives. I assessed the arrangements for the clearance of passengers, management of flight information and the adequacy of the security arrangements. I developed specific audit procedures which included the review of records for outgoing and incoming traffic for both international and domestic flights, review of travellers’ checking processes, clearance of travellers, invoicing and receipting of landing and airport service charges, recording of air traffic movements and general inspection of the aerodrome.", "page": 15}, {"type": "paragraph", "content": "Based on the procedures performed, I noted the following matters;", "page": 15}, {"type": "list", "content": "- I observed that there was general laxity in the management of security at the Aerodrome.\n- The system of checking passengers on all domestic and international flights is still manual.\n- I noted that the Aerodrome did not have permanently deployed immigration staff The Aerodrome was being served by an Assistant Immigration officer from Lea boarder post, which is ten kilometres away from the aerodrome.\n- The Aerodrome does not have a generator to provide power whenever there is a power cut. The aerodrome also lacks general information processing facilities like photocopiers and scanners.\n- The system of traveller information flow is inadequate.\n- The facilities used as runway, taxi way and apron do not meet the standards of international aerodromes. Whereas Management has been working on tarmacking the apron, it is yet to be finalized for use.", "page": 15}, {"type": "paragraph", "content": "4.1", "page": 16}, {"type": "heading", "level": 2, "content": "Delayed completion of terminal building", "page": 16}, {"type": "paragraph", "content": "In a bid to improve facilities at the Aerodrome, CAA embarked on construction of a terminal building to house key officers, including; the Supervisor and Aeronautical Information Management Officer, and well as Passenger handling facilities. Construction of the terminal building commenced in 2009 and was scheduled to end in 2011. However, by the time of the audit in October 2019, ten years later, the terminal building has not been finalized to permit official use.", "page": 16}, {"type": "paragraph", "content": "The first contract for construction of the terminal building was awarded to General Construction and Maintenance Company Ltd. However, because of insufficient planning and design of the works, four other contracts have been awarded in respect of the works to endeavour to rectify various snags and works that had not been earlier foreseen. As a consequence, a total of UGX 10,407,195,355 has been spent on various works, to facilitate improvement of the structure to be used as a terminal building, but the works are still incomplete. The following are the various contractors engaged to execute the initial scope of works and the subsequent works undertaken:", "page": 16}, {"type": "table", "content": [["**S/N**", "**Company**", "**Details**", "**Amount (UGX)**", "**Status**"], ["1", "General Construction and Maintenance Co Ltd", "construction;   Wall and floor finishes;  Roofing;   Plumbing and drainage;   Electrical and water installations, and;   Windows and doors (aluminium works). Contract for construction of the new passenger terminal building.  Scope of works:   Foundation and wall", "1,289,857,023", "Construction was scheduled to commence 4 th July 2009, to be completed in 11 th July 2012. The works delayed due to inadequate design and delayed payments."], ["2", "Efra Limited", "Contract to construct an apron and improve the taxi way (Phase 1). Scope of works:   Demolition of the existing structures;   Earthworks;   Construction of bases for gravel and earth stones;   Construction of aircraft concrete stand pad, and;   Construction of fire truck shed and staff house.", "2,746,595,507", "The works were to commence in 2 nd December 2014 and completion date was June 2014. The works delayed due to change of design and delayed payments. This led to the extension of the contract completion date to 6 th June 2015. However even after the expiry of the contract extension date, the works remained incomplete."], ["3", "Hass Construction Company Ltd", "Works for operationalization of the terminal building  Scope of works:   Office partitions;", "1,069,137,808", "The works were to commence in 21 st December 2015 and end on 21 st March 2016\\. The works have"]], "page": 16}, {"type": "table", "content": [["", " Ceiling suspension;  Fixing paving blocks at passenger drop off;   Purchase and supply of office furniture, and   Construction of 1000m fence to demarcate air and land site.", "", "been delayed due to change of scope, delayed payments and slow progress by the contractor.", null], ["4", "Heat General Engineers and Contractors", "Contract for construction of the apron (phase 2)  Scope of works:   Construction of the stone base;   Spraying prime coat;  Construction of surface course (asphalt);   Construction of drainage;   Paint marking and;   Construction of temporary access road and park.", "4,613,676,938", "The works were to commence in 2018 and end in 2019. The works have delayed due to change of scope and delayed payment."], ["5", "Lodina Investments Ltd", "Contract for construction of a fence (phase 2) Scope of works:   Fence line of approximately 7kms (chain link and barbed wire);   Construction of crush gates;   Security watch towers, and;   Construction of alternative community road.", "687,928,079", "in The works were to commence 24 th October 2018 and end in 24 th January 2019. The works have delayed due to land compensation issues, bad weather and slow progress of works by the contractor. The poor designs have led to extensions and award of various contracts  for construction of the aerodrome terminal facilities which has also resulted in escalation of costs and delayed works."]], "page": 17}, {"type": "paragraph", "content": "activities in a phased manner as Management waits for government to fund the major project.", "page": 18}, {"type": "paragraph", "content": "I advised the Accounting Officer to;", "page": 18}, {"type": "list", "content": "- Ensure that proper supervision is undertaken to enable timely construction of the planned infrastructure.\n- Facilitate the completion of the outstanding works and follow up the various contractors to ensure that the terminal building and the related facilities are operationalized.", "page": 18}, {"type": "paragraph", "content": "John F.S. Muwanga AUDITOR GENERAL", "page": 18}, {"type": "paragraph", "content": "KAMPALA  \n27 th December, 2019", "page": 18}, {"type": "paragraph", "content": "APPENDICES", "page": 19}, {"type": "heading", "level": 2, "content": "Appendix I: Implementation of planned activities", "page": 19}, {"type": "table", "content": [["**Program**", "**Planned output**", "**Amount (Billion)**", "**Achievement**", "**Audit Remarks**"], ["Airport development Airport coordination planning and planning and", "Improvement departures of", "Budget: 15 Spent: 15", "Partially Achieved", "The activity was partially completed. Partial works were done and the project received additional funding of UGX.6.149 which was not fully utilized as the project slowed down in the year under review due to change in designs."], [null, "CCTV for cargo Center", "Budget:1.5 Spent: 0", "Not Achieved", "There were no funds allocated to this activity."], [null, "Search Park EIA", "Budget: 3.5 Spent: 1.1", "Partially Achieved", "The activity was partially achieved. The project works were 60% complete. Relocation of underground services and the rainy season interrupted the progress of works"], [null, "Supervision of airport expansion project", "Budget: 7.5 Spent: 7.5", "Achieved", "This activity was achieved."], ["Electrical, Electronic and mechanical", "Overhaul of obsolete 11kv EIA Main Power Supply Ring Phase 3", "Budget: 1.8 Spent: 0", "Not Achieved", "This activity was not implemented. Funds were not availed for this output."], ["Marine Search and Rescue", "Rebuilding modification crumbling (Phase 1) and of 2piers", "Budget: 1.4 Spent: 0", "Not Achieved", "was still at specification and development stage. At that time, the piers were being maintained under the certification budget. This activity was not implemented. Project"], ["Government Support", "Security search park shelter, equipment, civil infrastructure and electrical works", "Budget: 68.22 Spent: 0", "Partially Achieved", "This activity was partially achieved.  The civil works for the search park by IBB International is in advanced stage of completion. The civil works were almost completed. However, the facility may not be put to use because of the required screening equipment which was yet to be procured. Funds were obtained from other Authority areas to deliver the output."], [null, "Perimeter  security lighting and Defense system", "Budget: 11.52 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Security surveillance system electronic", "Budget: 7.866 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."]], "page": 19}, {"type": "paragraph", "content": "18", "page": 19}, {"type": "table", "content": [["Government support", "Security screening and scanning equipment", "Budget: 9 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Security  integrated communication equipment", "Budget: 4.32 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Access control system", "Budget: 3.96 Spent:0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Security  integrated Management building system", "Budget: 4.5 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Security for cargo center Equipment", "Budget: 15 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Security Lighting of the perimeter fence at EIA", "Budget:12 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], [null, "Improvement security and lighting at EIA of street", "Budget: 1.2 Spent: 0", "Not Achieved", "The activity was not implemented. The government support did not come through as had been planned. The entity has decided to phase these activities within their budget."], ["Others", "Land Acquisition", "Budget:50 Spent: 0", "Not Achieved", "The activity was not implemented. There were no funds availed for land acquisition."], [null, "Airport Project Expansion", "Budget: 216", "Partially implemented", "The activity was partially achieved.  Slow project progress was observed during the audit."]], "page": 20}, {"type": "heading", "level": 1, "content": "Source: OAG own analysis", "page": 20}, {"type": "paragraph", "content": "19", "page": 20}, {"type": "heading", "level": 1, "content": "Appendix II: Delays in procurement process.", "page": 21}, {"type": "table", "content": [["**Reference Number**", "**Activity**", "**Contract** **(UGX/USD)** **Amount**", "**Initiation Date**", "**Contract Signing**", "**Time Taken**"], ["**Civil Aviation Authority**", null, null, null, null, null], ["CAA/WRKS/17-18/00033", "Ground maintenance of aerodromes upcountry", "926,821,608", "Dec 2017", "Pending", "On going"], ["CAA/WRKS/16-17/00067", "Civil Works 2 nd Floor Passenger Terminal Building", "145,162,479", "November 2016", "September 2018", "19 months"], ["CAA/SUPLS/17-18/00130", "Supply of Runway materials", "", "October 2017", "September 2018", "12 months"], ["CAA/WRKS/15-16/00046", "Relocation of Arua Airfield to Anai", "4,613,676,938", "October 2017", "Pending", "On going"], ["", "Land Acquisition for the expansion of Arua Airport as dictated by the Master plan (Consultancy)", "", "September 2017", "October 2018", "12 months"], ["CAA/SUPLS/13-14/00078", "Supply and Installation of flood lighting mast on Bay 11", "288,626,236", "2013/14", "March 2018", "43 months"], ["CAA/WRKS/15-16/00027", "Improvement of pavement edges, access ramps the Entebbe International Airport and fence at", "669,383,875", "2015/16", "November 2017", "18 months"]], "page": 21}, {"type": "paragraph", "content": "20", "page": 21}]