[{"type": "heading", "level": 5, "content": "THE REPUBLIC OF UGANDA", "page": 0}, {"type": "heading", "level": 5, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF UGANDA NATIONAL ROADS AUTHORITY", "page": 0}, {"type": "paragraph", "content": "FOR THE FINANCIAL YEAR ENDED 30 TH JUNE 2020", "page": 0}, {"type": "heading", "level": 3, "content": "TABLE OF CONTENTS", "page": 1}, {"type": "tableOfContent", "content": ["REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF UGANDA NATIONAL", "ROADS AUTHORITY FOR THE FINANCIAL YEAR ENDED 30TH JUNE, 2020 - 3", "Opinion - 3", "Basis for Qualified Opinion - 3", "  1.0 Improperly maintained Receivables Ledgers - 3", "  2.0 Mischarge of Expenditure –UGX 289,157,979,077 - 3", "Key Audit Matters - 4", "  3.0 Implementation of the approved budget - 4", "Emphasis of Matter - 10", "  4.0 Unbudgeted for domestic arrears- UGX.452,810,845,128 - 10", "Other Information - 11", "Management Responsibilities for the Financial Statements - 11", "Auditor General’s Responsibilities for the audit of the Financial Statements - 12", "Other Reporting Responsibilities - 13", "Report on the Audit of Compliance with Legislation - 13", "  5.0 Management of the Authority Fleet - 13", "  6.0 Nugatory Expenditure - Interest on delayed payments to contractors – - 19", "UGX 7,309,410,300 - 19", "  7.0 Slow progress of works - 20", "  8.0 Road Maintenance Funds - 23", "9.0 Inadequate feasibility studies during planning and design of Nakalama- Tirinyi-Mbale", "Road… - 23", "  10.0 Liquidated damages on Hima-Katunguru road project- UGX 1,873,318,398 - 25", "11.0 Engineering Audit of a selected sample of Road Development, Bridge, Rehabilitation", "and maintenance Projects implemented during the year - 25", "  11.1 Background - 25", "  11.2 Inadequate planning - 26", "  11.3 Delays in completion of design reviews - 27", "  11.4 Delays in progress of works - 28", "  11.5 Use of lump sum contracts - 28", "  11.6 Inclusion of contingency in design and build contracts - 29", "  11.7 Unrealistic rates by Contractors - 29", "  11.8 Unenforceable clauses in works contracts - 30", "  11.9 Lack of dispute boards - 30", "  11.10 Inclusion of unnecessary items in BOQs - 30", "  11.11 Inadequacies in work programs - 31", "APPENDICES - 33"], "page": 1}, {"type": "heading", "level": 5, "content": "REPORT OF THE AUDITOR GENERAL ON THE FINANCIAL STATEMENTS OF UGANDA NATIONAL ROADS AUTHORITY FOR THE FINANCIAL YEAR ENDED 30TH JUNE, 2020", "page": 2}, {"type": "heading", "level": 5, "content": "THE RT. HON. SPEAKER OF PARLIAMENT Opinion", "page": 2}, {"type": "paragraph", "content": "I have audited the accompanying financial statements of Uganda National Roads Authority for the year ending 30 th June 2020, which comprise the Statement of Financial Position as at 30 th June 2020, and the Statement of Financial Performance, Statement of Changes in Equity and Statement of Cash Flows together with other accompanying statements for the year then ended, and notes to the financial statements, including a summary of significant accounting policies.", "page": 2}, {"type": "paragraph", "content": "In my opinion, except for the possible effect of the matters described in the Basis for Qualified Opinion section of my report, the financial statements of Uganda National Roads Authority for the year ended 30 th June 2020 are prepared, in all material respects, in accordance with section 51 of the Public Finance Management Act, 2015 and the Financial Reporting Guide, 2018.", "page": 2}, {"type": "heading", "level": 5, "content": "Basis for Qualified Opinion", "page": 2}, {"type": "paragraph", "content": "1.0", "page": 2}, {"type": "heading", "level": 5, "content": "Improperly maintained Receivables Ledgers", "page": 2}, {"type": "paragraph", "content": "Receivables totalling to UGX.604,835,635,481 relating to Development and maintenance projects were reported in the financial statements for the year. However, contracts and receivables ledgers were improperly maintained or not maintained for some of the road projects. Without proper ledgers, I was unable to confirm the accuracy and completeness of the figures reported for the advances and recoveries therefrom.", "page": 2}, {"type": "paragraph", "content": "2.0", "page": 2}, {"type": "heading", "level": 5, "content": "Mischarge of Expenditure –UGX 289,157,979,077", "page": 2}, {"type": "paragraph", "content": "Expenditure totalling to UGX 289,157,979,077 (UGX 288,713,825,335 from UNRA TSSA and UGX 444,153,742 from UNRA Road Funds) was charged on budget lines to fund activities that were not planned for without authority. The practice undermines the budgetary process and the intensions of the appropriating authority as funds are not utilized for the intended purpose. The accuracy and completeness of the financial statements is compromised, since the figures reported therein do not reflect the actual amounts and outputs for which the funds were expended.", "page": 2}, {"type": "paragraph", "content": "Supreme Audit Institutions (INTOSAI) Code of Ethics, the International Ethics Standards Board for Accountants Code of Ethics for Professional Accountants (Parts A and B) (IESBA Code), and other independence requirements applicable to performing audits of Financial Statements in Uganda. I have fulfilled my other ethical responsibilities in accordance with the IESBA Code, and in accordance with other ethical requirements applicable to performing audits in Uganda.", "page": 3}, {"type": "paragraph", "content": "I believe that the audit evidence I have obtained is sufficient and appropriate to provide a basis for my qualified opinion.", "page": 3}, {"type": "heading", "level": 5, "content": "Key Audit Matters", "page": 3}, {"type": "paragraph", "content": "Key audit matters are those matters, in my professional judgment, were of most significance in my audit of the financial statements of the current period. These matters were addressed in the context of my audit of the financial statements as a whole, and in forming my opinion thereon, and I do not provide a separate opinion on this matter. In addition to the matters described in the Basis for Qualified for Opinion section of my report, I have determined the matter described below to be a key audit matter communicated in my report.", "page": 3}, {"type": "heading", "level": 5, "content": "3.0 Implementation of the approved budget", "page": 3}, {"type": "paragraph", "content": "Every year, Government plans and allocates funds to MDAs for implementation of activities that would enable the country to attain sustainable development. I observed that MDAs have challenges with regard to implementation of planned activities, which negatively affects service delivery and improvement of the people’s wellbeing. As a result, the implementation of the approved budget was considered a key audit matter and during the office-wide planning, I identified risks common with MDAs which include; non-implementation of strategic plans, underperformance of revenue, implementation of off-budget activities, under absorption of funds, insufficient quantification of outputs, partial and non-implementation of outputs, diversion of funds and challenges in budget monitoring and reporting of performance.", "page": 3}, {"type": "paragraph", "content": "Uganda National Roads Authority has a constitutional mandate to manage, maintain and develop the national roads network; to advise the Government on policy matters concerning roads generally, and to assist in the co-ordination and implementation of the policies governing road development and maintenance.", "page": 3}, {"type": "paragraph", "content": "In order to achieve this mandate, the Authority planned to implement and achieve a number of both recurrent and development outputs under various programmes. A review of the entity’s budget revealed that the UNRA had an approved budget of UGX 4,019,068,912,990, out of which UGX 2,580,880,000,000 was released. Table 1 below shows a summary of the key deliverables for the financial year 2019/20.", "page": 3}, {"type": "heading", "level": 3, "content": "Table 1: Showing key deliverables for UNRA for the year", "page": 4}, {"type": "table", "content": [["**S/n**", "**Key projects**", "**Amount spent (UGX Bn)**", "**Percentage of expenditure**"], ["1", "01 Finance and Administration", "93.87", "4.1"], ["2", "0265 Upgrade Atiak - Moyo-Afoji (104km)", "6.36", "0.3"], ["3", "0267 Improvement of Ferry Services", "26.77", "1.2"], ["4", "0952 Design Masaka-Bukakata road", "67.34", "2.9"], ["5", "0957 Design the New Nile Bridge at Jinja", "27.57", "1.2"], ["6", "1034 Design of Mukono-Katosi-Nyenga (72km)", "55.48", "2.4"], ["7", "1035 Design Mpigi-Kabulasoka-Maddu (135 km)", "31.63", "1.4"], ["8", "1040 Design Kapchorwa-Suam road (77km)", "27.55", "1.2"], ["9", "1041 Design Kyenjojo-Hoima-Masindi- Kigumba (238km)", "46.16", "2.0"], ["10", "1042 Design Nyendo - Sembabule (48km)", "26.06", "1.1"], ["11", "1176 Hoima-Wanseko Road (83Km)", "132.37", "5.8"], ["12", "1180 Kampala Entebbe Express Highway", "12.01", "0.5"], ["13", "1274 Musita-Lumino-Busia/Majanji Road", "45.28", "2.0"], ["14", "1275 Olwiyo-Gulu-Kitgum Road 5", "53.57", "2.3"], ["15", "1276 Mubende-Kakumiro-Kagadi Road", "81.05", "3.5"], ["16", "1277 Kampala Northern Bypass Phase 2", "96.07", "4.2"], ["17", "1278 Kampala-Jinja Expressway", "15.04", "0.7"], ["18", "1279 Seeta-Kyaliwajjala-Matugga-Wakiso- Buloba-Nsangi", "18.73", "0.8"], ["19", "1280 Najjanankumbi-Busabala Road and Nambole-Namilyango-Seeta", "14.28", "0.6"], ["20", "1281 Tirinyi-Pallisa-Kumi/Kamonkoli Road", "133.44", "5.8"], ["21", "1310 Albertine Region Sustainable Development Project", "18.12", "0.8"], ["22", "1311 Upgrading Rukungiri-Kihihi- Ishasha/Kanungu Road", "18.54", "0.8"], ["23", "1312 Upgrading Mbale-Bubulo-Lwakhakha Road", "30.12", "1.3"], ["24", "1313 North Eastern Road-Corridor Asset Management Project", "8.62", "0.4"], ["25", "1319 Kampala Flyover", "43.71", "1.9"], ["26", "1320 Construction of 66 Selected Bridges", "67.41", "2.9"], ["27", "1322 Upgrading of Muyembe-Nakapiripirit (92 km)", "70.13", "3.1"], ["28", "1402 Rwenkunye- Apac- Lira-Acholibur road", "14.5", "0.6"], ["29", "1403 Soroti-Katakwi-Moroto-Lokitonyala road", "143.83", "6.3"], ["30", "1404 Kibuye- Busega- Mpigi", "78.27", "3.4"]], "page": 4}, {"type": "table", "content": [["31", "1490 Luwero- Butalangu", "1", "0.0"], ["32", "1503 Karugutu-Ntoroko Road", "0.43", "0.0"], ["33", "1506 Land Acquisition", "413.64", "18.1"], ["34", "1510 UNRA Retooling Project", "74.08", "3.2"], ["35", "1536 Upgrading of Kitala-Gerenge Road", "5.72", "0.3"], ["36", "1537 Upgrading of Kaya-Yei Road 2", "18.05", "0.8"], ["37", "1538 Development of Nakaseke-Ssingo- Kituma road", "9.02", "0.4"], ["38", "1543 Kihihi-Butogota-Bohoma Road", "23.37", "1.0"], ["39", "1544 Kisoro-Lake Bunyonyi Road", "0.9", "0.0"], ["40", "1545 Kisoro-Mgahinga National Park Headquarters Road", "1.8", "0.1"], ["41", "1546 Kisoro-Nkuringo-Rubugiri-Muko Road", "1.79", "0.1"], ["42", "1547 Kebisoni-Kisizi-Muhanga road", "23.22", "1.0"], ["43", "1548 Nansana-Busunju Section I", "1.23", "0.1"], ["44", "1549 Nansana-Busunju II", "22.13", "1.0"], ["45", "1550 Namunsi-Sironko/Muyembe- Kapchorwa Section I", "19.73", "0.9"], ["46", "1551 Fortportal Kyenjojo Road", "28.78", "1.3"], ["47", "1552 Hoima-Katunguru Road", "22.62", "1.0"], ["48", "1553 Ishaka-Rugazi-Katunguru Road", "54.72", "2.4"], ["49", "1554 Nakalama-Tirinyi-Mbale Road", "37.03", "1.6"], ["50", "1555 Fortportal Hoima Road", "22.45", "1.0"], ["", "", "**2285.59**", "**100**"]], "page": 5}, {"type": "paragraph", "content": "UNRA planned to achieve its deliverables through implementation of 43 outputs with a budget of UGX 4,019bn. I sampled 16 outputs worth UGX 1,245bn; representing 55% of the total releases.", "page": 5}, {"type": "paragraph", "content": "From the procedures undertaken, I noted the following (as per Table 2 below).", "page": 5}, {"type": "paragraph", "content": "Table 2: Showing a summary of key findings on the implementation of the entity’s budget", "page": 5}, {"type": "table", "content": [["**No**", "**Observations**", "**Recommendations**"], ["**3.1**", "**Implementation of the strategic plan** The overall Government National Development Plan (NDP II) expired at the end of FY 2019/20. In line with the NDP II, the UNRA had a strategic plan for the period 2015/16 - 2019/20, which set out both the long term and short-term targets to be achieved during the duration of the strategic plan.", "I advised the Accounting officer to ensure that period evaluation of the implementation of the strategic  is undertaken. plan"]], "page": 5}, {"type": "table", "content": [["", "This being the last year of implementation of the UNRA’s strategic plan, UNRA was expected to undertake an evaluation of the progress made in the achievement of the strategic goals and objectives. However it was observed that UNRA had not undertaken the end line evaluation. Consequently, I was not able to undertake the planned audit procedures to enable me assess the achievements made during the implementation period. to evaluate performance hinders effective accountability for funds allocated to the entity during the strategic plan period. Accounting Officer explained that the Approved UNRA Strategic Plan implementation period run from 2017/18 to 2022/25 so as to align with the implementation period of the NDP II and it’s evaluation is done on annual basis with the last undertaken in the last year of the NDPII and the UNRA Corporate Strategy Implementation Period. The Accounting Officer further explained that assessment of UNRA’s achievements during the NDP II and UNRA Corporate Strategy Implementation Periods are highlighted in the UNRA Annual Performance Report 2019/20. the Accounting Officer indicated the Authority had undertaken evaluations, no evidence was provided to support the assertion. Failure The Whereas", ""], ["**3.2**", "15(1) of the Public Finance and Management Act (PFMA) 2015 states that after approval of the annual budget by Parliament, the Secretary to Treasury shall issue the annual cash flow plan of Government, based on the procurement plans, work plans and recruitment plans approved by Parliament. Section 15(2) of the PFMA states that the annual cash flow plan issued under subsection (1) shall be the basis for release of funds by the Accountant General to the Accounting Officers. Further, Section 15 (3) requires that an Accounting Officer shall commit the budget of a vote, based on the annual cash flow plan issued under this section.  A review of the entity’ revenue performance revealed the following:   The entity had an approved budget of UGX. during year. However, (66.6%) was warranted of affected 4,019,068,912,990 UGX.2,677,574,546,630 resulting UGX.1,341,494,366,360, budget  shortfall which the in  a **Revenue Performance** Section", "to I advised the Accounting Officer liaise with relevant authorities and ensure  the budgeted funds are fully released, to enable the implementation  of planned activities. that"]], "page": 6}, {"type": "table", "content": [["", "spent implementation of planned activities. the  Out of the total receipts for the financial year of UGX. 2,677,574,546,630  UGX. 2,279,371,610,152 representing an absorption level of 85.1% leaving unspent balances of UGX.398,202,936,478, of which the GoU component was returned to the Consolidated Fund while the external  the respective UNRA project accounts. financing component remained on Authority The Accounting Officer explained that the shortfall was due to external funding that was never disbursed because the financing agreement of some projects like Oil Roads had not been signed and procurement delays. The financing Agreement has since been signed and funds utilized. Accounting Officer further explained that the external funds could not be fully utilized due to delays in completion of procurement process of some projects like Rwenkunye Apac, Muyembe Nakapiripirit. The", ""], ["**3.3**", "**Performance of NTR** According to the the NTR estimates for the financial year 2019/2020, UNRA projected to collect NTR amounting to UGX 12bn. Out of this, only UGX 2,634,160,774 was collected, representing a performance of 22% of the target. I also noted a decline of 72.5% in the NTR collected from the previous year of UGX 9,586,629,574 to UGX. 2,634,160,774. Shortfalls in NTR collections affect the implementation of planned activities. The Accounting Officer explained that the NTR target set by MoFPED was high and unrealistic for an entity like UNRA which is not a revenue generating entity.", "liaise The Accounting Officer should  with MoFPED to ensure that realistic revenue targets are set, and the revenue collected is in line with the approved estimates."], ["**3.4**", "**Quantification and implementation of outputs and activities** 55 of the budget execution circular for the financial year 2019/2020 states that the Accounting Officer is required to submit quarterly performance reports by the 30 th day of the first month of the next quarter. These reports should indicate the actual performance against the planned outputs and performance for each quarter, showing the quantity/quality and physical location of the reported outputs against expenditure. Paragraph", "I advised the Accounting Officer to ensure that all outputs are sufficiently quantified during the budgeting process to facilitate  proper monitoring  and evaluation.  I also  Accounting Officer initiate strategies the to to advised"]], "page": 7}, {"type": "table", "content": [["", "I reviewed the implementation of sixteen (16) sampled outputs having a total of sixty three (63) activities and expenditure of UGX.962.438bn. I noted that out of the sixteen (16) sampled outputs with a total number of sixty three (63) activities, fifty nine (59) activities had clear set targets to enable assessment of performance while four (4) activities lacked targets. also noted that out of the sixty-three (63) activities, twenty-eight (28) were fully achieved; fourteen (14) were partially achieved; and eighteen (18) were not achieved. **Details on the outputs are given in Appendix 1** to this report. the activities that lacked targets I observed that, Management reported performance in generic ways such as maintenance of vehicles, purchase of fuel among others. Failure to plan and report on the quality/quantity of activities implemented renders it difficult to establish the reasonableness of individual activity costs for each planned output which curtails effective accountability when funds are subsequently spent. Further, without clearly and fully quantified activities, I could not ascertain the level of achievement of these activities and whether funds appropriated by Parliament were spent for the intended purpose. The Accounting Officer explained that the planning and implementation of activities was affected by COVID\\_19. The Accounting Officer further explained that Management has put in place procedures and measures in planning of activities to mitigate the effects and disruptions caused by COVID 19 Pandemic in implementation of projects. The Pandemic is still on and assessment will be done basing on guidance given by Government. An impact assessment of COVID19 on UNRA projects and operations will be undertaken to support future decisions and planning. I For", "ensure that all the partially implemented activities are rolled over to  financial year and subsequently implemented. the next"], ["**3.5**", "**Diversion/Mischarges of expenditure** The Parliament of Uganda appropriates funds through the budget in accordance with the agreed priorities of the country and this appropriation is tagged to particular activities and outputs using both account and MTEF codes. Paragraph 8.5.2 of the 2017 Treasury Instructions states that, the implementation of the budget shall strictly follow the work plans, procurements, and recruitment plans as", "I advised the Accounting Officer to always streamline the budget process to ensure that sufficient  are allocated  each account and budget controls  fully adhered to such as funds to are"]], "page": 8}, {"type": "paragraph", "content": "approved by parliament.  \nseeking authority for Contrary to this, I noted that funds earmarked for the any reallocations in selected outputs to the tune of UGX 288,713,825,335 accordance with the were irregularly mischarged from the activities for which it regulations  \nwas budgeted and spent on other activities without  \nseeking and obtaining the necessary approvals.", "page": 9}, {"type": "heading", "level": 3, "content": "(Appendix 2 (i)).", "page": 9}, {"type": "paragraph", "content": "Mischarge of expenditure is an indication of Management override of the established budgetary and commitment", "page": 9}, {"type": "heading", "level": 3, "content": "control procedures. It impacts on the credibility of the", "page": 9}, {"type": "paragraph", "content": "budget and, accuracy and completeness of the financial statements, since the figures reported therein do not reflect the actual amounts expended. Also, planned activities remain unexecuted as funds are diverted elsewhere.", "page": 9}, {"type": "paragraph", "content": "The Accounting Officer explained that some activities were accelerated and the allocated funds could not settle all obligations while funds allocated to other activities did not progress and had not been absorbed due to delays in the procurement process, effects of COVID 19 pandemic and the law limiting to 10% reallocation.", "page": 9}, {"type": "heading", "level": 5, "content": "Emphasis of Matter", "page": 9}, {"type": "paragraph", "content": "Without qualifying my opinion further, I draw attention to the following matter presented in the financial statements that, in my judgement, is of such importance and fundamental to users’ understanding of the financial statements:", "page": 9}, {"type": "paragraph", "content": "4.0", "page": 9}, {"type": "heading", "level": 5, "content": "Unbudgeted for domestic arrears- UGX.452,810,845,128", "page": 9}, {"type": "paragraph", "content": "Section 13(10) (a) (iv) of the Public Finance Management Act, 2015 states that the annual budget shall indicate a plan for the Government debt and  \nthe financial year to which the annual budget relates.", "page": 9}, {"type": "paragraph", "content": "financial liabilities for", "page": 9}, {"type": "paragraph", "content": "Review of the approved budget estimates and the statement of Appropriation account (based on nature of expenditure) revealed that UNRA budgeted for UGX 20,000,000,000 in respect of domestic arrears. The amount was warranted and released during the year. However, it was observed that domestic arrears paid during the year totalled to UGX.472,810,845,128 resulting in unappropriated expenditure of UGX452,810,845,128. There was also no evidence that supplementary funding was obtained to settle the outstanding domestic arrears.", "page": 9}, {"type": "paragraph", "content": "The Accounting Officer explained that commitments of ongoing multiyear projects are presented as Domestic Arrears to comply with Accounting period.  \nThe funding of commitments for ongoing projects referred to as domestic arrears is always appropriated under relevant line items within the current budget. Whereas Management further explained the arrears were provided for, the funds were deducted from the current year operations to cover the arrears.", "page": 10}, {"type": "paragraph", "content": "I advised the Accounting Officer to:", "page": 10}, {"type": "list", "content": "- Ensure adherence to the commitment control system to limit accumulation of domestic arrears and seek for Parliamentary authority to reallocate funds to settle the domestic arrears to avoid diversion of funds.", "page": 10}, {"type": "list", "content": "- Endeavour to come up with a debt settlement plan with the various creditors to avoid possible litigation and the associated costs.", "page": 10}, {"type": "heading", "level": 5, "content": "Other Information", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer is responsible for the other information. The other information comprises the statement of responsibilities of the Accounting Officer and the commentaries by the Head of Accounts and the Accounting Officer, and other supplementary information. The other information does not include the financial statements and my auditors’ report thereon. My opinion on the financial statements does not cover the other information and I do not express an audit opinion or any form of assurance conclusion thereon.", "page": 10}, {"type": "paragraph", "content": "In connection with my audit of the financial statements, my responsibility is to read the other information and, in doing so, consider whether the other information is materially consistent with the financial statements or my knowledge obtained in the audit, or otherwise appears to be materially misstated. If, based on the work I have performed, I conclude that there is a material misstatement of this other information, I am required to report that fact. I have nothing to report in this regard.", "page": 10}, {"type": "heading", "level": 5, "content": "Management Responsibilities for the Financial Statements", "page": 10}, {"type": "paragraph", "content": "The Accounting officer is responsible for the preparation and fair presentation of these financial statements in accordance with Section 51 of the Public Finance Management Act, 2015, and the Financial Reporting Guide, 2018 and for such internal control as management determines is necessary to enable the preparation of financial statements that are free from material misstatements, whether due to fraud or error.", "page": 10}, {"type": "paragraph", "content": "The Accounting Officer is responsible for overseeing the Authority’s financial reporting process.", "page": 11}, {"type": "heading", "level": 5, "content": "Auditor General’s Responsibilities for the audit of the Financial Statements", "page": 11}, {"type": "paragraph", "content": "My objectives are to obtain reasonable assurance about whether the financial statements as a whole are free from material misstatement, whether due to fraud or error, and to issue an auditor’s report that includes my opinion. Reasonable assurance is a high level of assurance, but is not a guarantee that an audit conducted in accordance with ISSAIs will always detect a material misstatement, when it exists. Misstatements can arise from fraud or error and are considered material if, individually or in aggregate, they could reasonably be expected to influence the economic decisions of users, taken on the basis of these financial statements.", "page": 11}, {"type": "paragraph", "content": "As part of an audit in accordance with ISSAIs, I exercise professional judgement and maintain professional scepticism throughout the audit. I also:", "page": 11}, {"type": "list", "content": "- Identify and assess the risks of material misstatement of the financial statements, whether due to fraud or error, design and perform audit procedures responsive to those risks, and obtain audit evidence that is sufficient and appropriate to provide a basis for my opinion. The risk of not detecting a material misstatement resulting from fraud is higher than for one resulting from error, as fraud may involve collusion, forgery, intentional omissions, misrepresentations, or the override of internal control.", "page": 11}, {"type": "list", "content": "- Obtain an understanding of internal control relevant to the audit in order to design audit procedures that are appropriate in the circumstances, but not for the purpose of expressing an opinion on the effectiveness of the Authority’s internal control.\n- Evaluate the appropriateness of accounting policies used and the reasonableness of accounting estimates and related disclosures made by the management.", "page": 11}, {"type": "list", "content": "- Conclude on the appropriateness of Accounting Officer’s use of the going concern basis of accounting and, based on the audit evidence obtained, whether a material uncertainty exists related to events or conditions that may cast significant doubt on the Authority’s ability to continue as a going concern. If I conclude that a material uncertainty exists, I am required to draw attention in my auditor’s report to the related disclosures in the financial statements or, if such disclosures are inadequate, to modify my opinion. My conclusions are based on the audit evidence obtained up to the date of my auditor’s report. However, future events or conditions may cause the Authority to cease to continue as a going concern.", "page": 11}, {"type": "list", "content": "- Evaluate the overall presentation, structure and content of the financial statements, including the disclosures, and whether the financial statements represent the underlying transactions and events in a manner that achieves fair presentation.", "page": 11}, {"type": "paragraph", "content": "I communicate with the Accounting Officer regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that I identify during my audit.", "page": 12}, {"type": "paragraph", "content": "I also provide the Accounting Officer with a statement that I have complied with relevant ethical requirements regarding independence, and to communicate with them all relationships and other matters that may reasonably be thought to bear on my independence, and where applicable, related safeguards.", "page": 12}, {"type": "paragraph", "content": "From the matters communicated with the Accounting Officer, I determine those matters that were of most significance in the audit of the financial statements of the current period and are therefore the key audit matters. I describe these matters in my auditor’s report unless law or regulation precludes public disclosure about the matter or when, in extremely rare circumstances, I determine that a matter should not be communicated in my report because the adverse consequences of doing so would reasonably be expected to outweigh the public interest benefits of such communication.", "page": 12}, {"type": "heading", "level": 5, "content": "Other Reporting Responsibilities", "page": 12}, {"type": "paragraph", "content": "In accordance with Section 19 (1) of the National Audit Act, 2008, I report to you, based on my work described on the audit of Financial Statements, that; except for the matters raised in compliance with legislation section below, and whose effect has been considered in forming my opinion on the financial statements, the activities, financial transactions and information reflected in the financial statements that have come to my notice during the audit, are in all material respects, in compliance with the authorities which govern them.", "page": 12}, {"type": "heading", "level": 5, "content": "Report on the Audit of Compliance with Legislation", "page": 12}, {"type": "paragraph", "content": "The material findings in respect of the compliance criteria for the applicable subject matters are as follows;", "page": 12}, {"type": "paragraph", "content": "5.0", "page": 12}, {"type": "heading", "level": 5, "content": "Management of the Authority Fleet", "page": 12}, {"type": "paragraph", "content": "Over the years, there has been increasing demand for accountability and better management of public resources by various stakeholders in Uganda, such as: the Executive arm of Government, Parliament, Citizenry, Donors, and Civil Society, among others that prompted the Office of the Auditor General (OAG) to select fleet management as one of the key audit matters for the audit year 2020.", "page": 12}, {"type": "list", "content": "- Acquired in compliance with Government vehicle acquisition guidelines; 13", "page": 12}, {"type": "list", "content": "- Are comprehensively recorded in the assets register to ensure their proper management;\n- Are adequately allocated, operated and utilized to enable delivery of public service;\n- Are properly and regularly maintained to achieve optimal performance, increased useful lives and reduced running costs; and\n- Are disposed in compliance with PPDA guidelines, and disposal proceeds properly accounted for.", "page": 13}, {"type": "paragraph", "content": "The study took a scope of three financial years: 2017/18-2019/20. From the procedures undertaken, I noted the following key observations;", "page": 13}, {"type": "table", "content": [["", "**Key Observations**", "**Audit Recommendation**"], ["**5.1 5.1.1**", "**Funding of fleet** During the three (3) financial years: 2017/18-2019/20; UNRA planned to spend UGX.11,241,846,416 on acquisition of vehicles from government funding. A total of UGX.8,150,862,854 was warranted and released by the Treasury for this purpose, and the Authority the funds in the acquisition of 38 vehicles over the three (3) year period. of the budgets with the actual funding revealed shortfalls of **UGX.3,090,983,562 (27%)** implying that the entity could not procure all the vehicles as planned, which may negatively impact on its operations. Accounting Officer explained that a needs analysis of fleet requirement for the Authority was undertaken. The Authority requested for funding which was never obtained. UNRA explored other options and suggested them to Ministry of Finance which resulted into approval of Vehicle Leasing model that is currently under procurement. **Acquisition of motor vehicles** Comparison The", "I advised the Accounting officer to  liaise with the Ministry of Finance for  necessary to scale up the fleet size required  for effective delivery of the  entity’s mandate. the funding"], ["**5.1.2**", "**Motor Vehicles** According to the Circular letter Ref; BDP/86/107/03 and dated 15 th May 2019 from the Permanent Secretary and Secretary to the Treasury to all Accounting Officers, Government issued a freeze order on purchase of vehicles by all MDAs during FY 2019/20 with the exception of 5 Votes, which included; Office of the President, State House; Ministry of Defence and Veteran Affairs; Ministry of Foreign Affairs; and Uganda Revenue Authority.  Further guidance from the Ministry of Public Service (MoPS) **Non-compliance with Government Ban on Acquisition of**", "I advised the Accounting Officer to always adhere to issued guidelines and/or  seek authority  before deviating from the set guidelines."]], "page": 13}, {"type": "table", "content": [["", "through a Circular letter Ref; ADM 99/205/01 and dated 21 st August 2019 provided that clearance would only be given for procurement of vehicles under on-going donor funded projects. It was noted that the UNRA acquired two (2) vehicles at a total cost of **UGX 677,849,549** during the FY 2019/20 using GoU funds contrary to the issued guidelines.  There was no evidence of a waiver issued to the entity by PS/ST allowing acquisition of vehicles. with the Government ban on acquisition of motor vehicles undermines the intended Government objective of controlling expenditure on purchase of vehicles. Although the Accounting Officer explained that the clearance for purchase of these vehicles was obtained from Ministry of Public Service, I was not provided with the clearance letter to confirm Non-compliance", ""], ["**5.1.3**", "8.6.2 of the Treasury Instructions (Tis), 2017 requires implementation of the budget to follow the work plans, procurement and recruitment plans approved by Parliament. examination of the submitted procurement plans for the last three financial years revealed that out of the 38 vehicles procured two (2) motor vehicles purchased in the FY 2019/2020 with a total cost of UGX. 677,849,549 were not in the annual work plan and procurement plan. The anomalies were attributed to the failure by Management to enforce compliance with the existing financial and procurement guidelines. Funds utilized for the purchase of these vehicles could have been diverted from other planned activities. the Accounting officer explained that the procurement of vehicles was in Road Fund work plan and procurement Plan of UNRA. The availed work plan and procurement plan did not indicate plans for procurement of these vehicles. **Unplanned acquisition of motor vehicles** Paragraph However, Although", "I advised the Accounting Officer to ensure that the needs assessment is undertaken and vehicles planned for procurement are included in the approved work plan and procurement plans in accordance with the financial and procurement guidelines."], ["**5.2 5.2.1**", "**Motor vehicle recording** **Asset Management Module in the Financial Management system** 10.13.4 of the Tis, 2017 requires all fixed assets acquisitions to be captured in the fixed assets module of the Government Computerised Financial Management Information System (GFMIS). I noted that all vehicles acquired over the 3 years under review **Un-updated** Paragraph", "I advised the Accounting Officer to liaise with the Accountant General and ensure the IFMS asset module is regularly updated to enable accurate recording of fixed assets  the financial in"]], "page": 14}, {"type": "table", "content": [["", "were not captured in the fixed assets module of the GFMIS. All the vehicles acquired at a cost of UGX. 8,150,862,854 over the period under review were not posted onto the Asset Management module in the Integrated Financial Management system (IFMS) as at the end of the financial year 2019/2020. of the assets in the assets management module in the IFMS may lead to misstatement of assets recorded in the financial statements, and may cause challenges in reconciliation of the fixed assets register using system information. Accounting Officer explained that the function of updating Assets in IFMS Asset Module is not yet enabled. Historical information of Assets was submitted to Ministry of Finance for uploading into the IFMS. UNRA operates Assets and inventory Management System that runs Asset management processes including production of Fixed Assets Register. Non-recording The", "statements,  and maintenance of a comprehensive assets register."], ["**5.3**", "**Drivers’ Competences for adequate operation of entity fleet** 14 of part F-I of public standing Orders, 2010 provides that to encourage and sustain the highest level of care and responsibility for Government vehicles on the part of individual drivers, the following shall apply: - Undergo a driving test by the Chief Mechanical Engineer prior to assumption of duty;   Periodic training including defensive driving at a recognized Training Institute;   Periodic testing every three years on traffic regulations and an annual medical check-up including eye testing. review of staff records revealed that the Authority had eighty- five (85) drivers. Further review of records on driver’s competence revealed the following matters; There was no evidence of annual medical examination being done to obtain their fitness status. This may put the lives of the officials they drive in danger in case of any medical challenge that may hamper their ability to drive. It is a recruitment requirement for all prospective drivers to undergo a driving test conducted by the Chief Mechanical Engineer prior to assumption of duty; this was not evident in UNRA records. ii. The Authority does not comply with the requirements for  A Section i.", "for advised the Accounting Officer to, going forward arrange  the trainings  the drivers, and also ensure enforcement of the procedures put in place to assess  drivers’ competences and fitness. I"]], "page": 15}, {"type": "table", "content": [["", "periodic assessment of drivers’ competence thus pausing a danger to the officials they drive. The Accounting Officer explained that: Prior to hiring, all Fleet Assistants undergo a driving practical test, which they must pass to meet conditions of hire  • Eye Testing is done at the renewal of the driving permits  • Between October and November 2017, a total of 158 Fleet Assistants were trained in defensive driving by Prestige Driving School at Gulu, Hoima, Mbarara, Luweero, Mbale, Soroti and Bugolobi.  • The remaining 37 were to be trained in FY 2019/2020 but due to the COVID 19 pandemic this programme was disrupted. Subject to funding, a refresher for all Fleet Assistants will be organized in the future.  In May 2018, 34 Fleet Assistants were  in Occupational Safety and Health. This is a critical training designed for all UNRA staff. •  trained • The remaining Fleet Assistants would be trained as and when we resume rolling the OSH Training.  • All drivers have medical cover and ensure mandatory testing • Management would consider the undertaking an annual assessment to ascertain fitness to work. •", ""], ["**5.4 5.4.1**", "**of Vehicle Maintenance Funding** **Vehicle maintenance** 16.9.1 of the TIs, 2017 requires the Accounting Officer to prepare an annual budget for asset maintenance, and assess the functionality, utilization, and physical and financial performance of assets held. A review of the approved work plan and budget, revealed that the budget for vehicle maintenance for 3 years (20017/2018, 2018/2019 and 2019/2020) totalled to **UGX.5,000,000,000.** However, review of expenditures was for only two financial years (2018/2019 and 2019/2020) due to lack of information about vehicle maintenance for the year 2017/2018. Therefore out of the vehicle maintenance budget for the two (2) FYs 2018/2019 and 2019/2020 of UGX 4,000,000,000 UNRA realised and spent a total of **UGX. 3,479,899,701** reflecting a funding shortfall to the tune of **UGX.520,100,299,** which is **13%** of the budgeted vehicle maintenance funds.(table 2 below) **Adequacy** Paragraph", "advised the Accounting Officer to ensure that the vehicle  maintenance costs are kept at the minimum. I"]], "page": 16}, {"type": "table", "content": [["**Table2: showing Funding for maintenance** **FY** Vehicle Maintenance Budget (A)** 2017/18 2018/19 1,000,000,000 2,000,000,000 2019/20 2,000,000,000 220 **Totals** 5,000,000,00 0** **No. of operat ional entity motor Vehicl es (B)** -  220 **No. of operat ional entity motor cycles** - 46 46 **Amount spent (C)** - 1,629,899 701 1,850,000 000 **3,479,89 9,701** **Averag e spendi ng per vehicl** **e**  **(C/B)**  - 7,408,6 35 8,409,0 90 **15,817 725** **Variance (A-C)** - 370,100,2 99 150,000,0 00 **520,100, 299** The annual average vehicle maintenance cost per vehicle increased  to **UGX.8,409,090** in FY 2019/20. from **UGX.7,408,635** in FY 2018/19 The Accounting Officer explained that UNRA has old fleet with a life of 5 years and above which is susceptible to break down that necessitates regular maintenance hence increased expenditure. This concern was discussed with Ministry of Finance and agreed on a different approach of Vehicle leasing where maintenance will be the responsibility of the lessor. The procurement of Vehicles under operating lease is ongoing and old vehicles will be disposed gradually.", null, null, null, null, null, null, null, ""], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null], ["**Disposal of vehicles** Non-compliance with disposal conditions** 15.11.1 of the TIs, 2017 requires that where it is considered that vehicles have reached the end of their useful life; are beyond economical repair or are unserviceable for any other reason; or have become redundant through obsolescence; shall be retained until a sufficient quantity is accumulated to merit the convening of a Board of Survey to inspect them, and it shall be the duty of such Board to determine the action to be taken, including the decision to board them off. UNRA had a total of 395 vehicles. On review of the Board of survey reports for the period under review, it was noted that out of 395 vehicles in the assets register, 341 vehicles had exceeded the recommended 5 years useful life, and 170 of these vehicles had their mileage above the recommended 250,000km, hence were all due for disposal. See summary below: **5.5** Paragraph **5.5.1**", null, null, null, null, null, null, null, "advised the Accounting officer to evaluate the fleet mix to adequately make use of the available funds. For example, smaller  vehicles with  lower capacities may be purchased  for officers who do not have field activities instead  of purchasing  high capacity vehicles. I"], [null, null, null, null, null, null, null, null, null], [null, null, null, null, null, null, null, null, null]], "page": 17}, {"type": "heading", "level": 8, "content": "Showing number of vehicles in use with respective years and mileage", "page": 18}, {"type": "heading", "level": 4, "content": "Years in use", "page": 18}, {"type": "paragraph", "content": "Mileage (Number of vehicles) (Number of vehicles) 0-5 yrs 5-10 yrs Above 10 Below  \nAbove  \nyrs 250,000km 250,000km 54 217 124 225 170", "page": 18}, {"type": "paragraph", "content": "Continued usage of old vehicles results into high costs of maintenance and uneconomical fuel consumption.", "page": 18}, {"type": "heading", "level": 3, "content": "The Accounting Officer explained that UNRA lacks funding to", "page": 18}, {"type": "paragraph", "content": "purchase new vehicles and in order to keep operational, old", "page": 18}, {"type": "heading", "level": 3, "content": "vehicles could not be disposed without replacement. The Board", "page": 18}, {"type": "paragraph", "content": "of survey exercise is ongoing in preparation for disposal of vehicles when the procurement of new vehicles under leasing model is completed.", "page": 18}, {"type": "paragraph", "content": "6.0", "page": 18}, {"type": "heading", "level": 5, "content": "Nugatory Expenditure - Interest on delayed payments to contractors – UGX. 7,309,410,300", "page": 18}, {"type": "paragraph", "content": "I observed that UNRA made payments amounting to UGX 7,309,410,300 (appendix 3) that arose out of penalties for the court cases and interest on delayed payments of advances and IPCs invoices from various contractors.", "page": 18}, {"type": "paragraph", "content": "Funds that were budgeted and allocated for planned activities were diverted towards payments of these fines and court penalties. The expenses on interest and penalties are considered nugatory.", "page": 18}, {"type": "paragraph", "content": "The Accounting officer explained that the Authority has been experiencing inadequate funding leading to its inability to settle certificates of approved works within the contractual period. Contractors invoke the clause in the contract and claim interest on unpaid Certificates.", "page": 18}, {"type": "paragraph", "content": "I advised the Accounting Officer to strengthen the risk management function to facilitate early identification and mitigation of risks of loss associated with management of contracted works.", "page": 18}, {"type": "paragraph", "content": "7.0", "page": 19}, {"type": "heading", "level": 5, "content": "Slow progress of works", "page": 19}, {"type": "paragraph", "content": "7.1", "page": 19}, {"type": "heading", "level": 5, "content": "Slow progress of work on Kampala flyover construction and Road upgrading", "page": 19}, {"type": "paragraph", "content": "project", "page": 19}, {"type": "paragraph", "content": "The contract agreement for Kampala flyover construction and Road upgrading project; Lot-1 (Package 1: Clock Tower Flyover and Package 2: Nsambya - Mukwano Road) was signed on 17 th September 2018 with Shimizu-Konoike joint venture as the contractor for the accepted contract amount of the equivalent of JYP 2,289,324,131, USD 43,778,555.82 and UGX 61,502,640,727. The official commencement date for the project was 4 th May 2019 and completion date of 28 th December 2021 thus the total contract time agreed of 970 days.", "page": 19}, {"type": "paragraph", "content": "Section 20.1 of the general conditions of the contract indicates that if the contractor considers himself to be entitled to any extension of the time for completion and/or any additional payment, in connection with the contract, the contractor shall give notice to the Engineer not later than 28 days.", "page": 19}, {"type": "paragraph", "content": "Review of the Monthly progress and quality control report No. 17 for September 2020 indicated that by the end of the September 2020 the overall progress of the project works including the general items and the provisional sums was estimated to be 11.11% against the planned progress of 39.5%, the progress of physical works was estimated to be 4.94% and the total contract time that had elapsed was 53.2%. Financial progress was estimated at 21.24% (including the advance payment) against the planned 50%.", "page": 19}, {"type": "paragraph", "content": "Further review of the progress report revealed that the contractor has mobilised very limited equipment for the road works, for instance, the screwed steel pile driving equipment, graders, rollers, tipper trucks and other equipment have not been mobilised yet by the end of September 2020. The contractor’s ability to mobilise the required resources is questioned and it will further slowdown the works progress.", "page": 19}, {"type": "paragraph", "content": "This significant slow progress of the works has culminated into contractor’s claims and notices; to-date the contractor has claimed for extension of time of 385 days. On his part, the contractor has claimed the need for extensions to be due to abnormal rainfall, late utility relocation, late land acquisition, late availability of access to site, late submission of project designs by the engineer and effect of COVID 19 on contractors working hours.", "page": 19}, {"type": "paragraph", "content": "among others. The revised work program is being prepared by the Contractor for monitoring progress of works in accordance with the Contract. The Contractor will also be reminded about the need for urgently mobilize the outstanding key road construction equipment, materials and manpower.", "page": 20}, {"type": "paragraph", "content": "I advised the Accounting Officer to;", "page": 20}, {"type": "list", "content": "- Ensure that the contractor is offered full access to the site through timely compensation of the Project affected persons and timely submission of project designs to the contractor so as to avoid claims and notices to claim.", "page": 20}, {"type": "list", "content": "- Compel the contractor to mobilize all the necessary equipment for the project works.", "page": 20}, {"type": "paragraph", "content": "7.2  \nDelayed capacity improvement of the Kampala Northern By-Pass", "page": 20}, {"type": "paragraph", "content": "The contract agreement with a private firm worth Euro 67,394,566.56 (excluding contingencies and VAT) for Capacity Improvement of the Kampala Northern By-Pass was signed on 7 th April 2014 with a commencement date of 14 th July 2014, and contract period of 36 months to 14 th July 2017. The contract period has been revised a number of times, the latest being the extension of time up to 22 nd October 2021, an extra 51 months, with an estimated revised contract price of Euro 129,827,888.", "page": 20}, {"type": "paragraph", "content": "The main reasons for the extension of times were the delayed access to site at various locations, delayed relocation of utilities obstructing the planned works, the addition and increased scope of works and quantities and limited equipment deployment in the early period of the project. The monthly progress report of September 2020 indicated that works were estimated to be at 77.4%The construction that had been planned to take 36 month (3years) has so far taken 78 months (6 and half years), a time escalation of 217%, and still on going.", "page": 20}, {"type": "paragraph", "content": "Delayed completion of works inconveniences surrounding business community and denies the intended beneficiaries timely use of the infrastructure and may result in escalation of project costs. The projects costs have escalated from Euro 67,394,566.56 to Euro 129,827,888 (92.7% increment).", "page": 20}, {"type": "paragraph", "content": "The accounting officer explained that there were challenges that were experienced during the land acquisition process that arose from; disputed compensation amounts by PAPs, family disputes over ownership, absentee landlords, injurious affection, design improvements and the need to acquire way leaves for the relocation of utilities. As of October 2019, the Contractor had access to all the six interchanges ie Sentema, Hoima, Gayaza, Kyebando, Ntinda and Naalya and work is progressing at all the sites.", "page": 20}, {"type": "paragraph", "content": "I advised the Accounting Officer to ensure that the contractor and the consultant expedite the completion of the construction works.", "page": 21}, {"type": "heading", "level": 5, "content": "8.0 Road Maintenance Funds", "page": 22}, {"type": "paragraph", "content": "8.1", "page": 22}, {"type": "heading", "level": 5, "content": "Ineligible expenditure - UGX. 444,153,742", "page": 22}, {"type": "paragraph", "content": "Paragraph 9 (a) of the performance agreement signed between UNRA and URF states that unless the Fund otherwise agrees, the Designated Agency shall apply the Finance Sum only for Road Maintenance. The Designated Agency shall ensure that the whole amount of the Finance Sum is utilized during the Financial Year and applied exclusively for Road Maintenance in accordance with the Annual Road Maintenance Programme.", "page": 22}, {"type": "paragraph", "content": "Review of the expenditure details relating to URF funding indicated that UNRA spent a total of UGX 444,153,742 on activities that were unrelated to road maintenance contrary to the requirements. Appendix 2 (ii) refers. Use of URF funds on ineligible activities frustrates the implementation of the planned activities under the URF approved annual road maintenance work plan.", "page": 22}, {"type": "paragraph", "content": "The Accounting Officer indicated that expenditure was part of the Operational Expenses approved by the Road Fund in the Annual Workplan of FY 2019/2020. However, audit established that the activities financed under these expenditures were not related with road rehabilitation as financed by Uganda road Fund", "page": 22}, {"type": "paragraph", "content": "I advised the Accounting Officer to avoid utilising funds on activities that are not financed by the Uganda Road fund.", "page": 22}, {"type": "heading", "level": 5, "content": "9.0 Inadequate feasibility studies during planning and design of Nakalama- Tirinyi-Mbale Road", "page": 22}, {"type": "paragraph", "content": "UNRA entered into a contract with Dott Services for rehabilitation of Nakalama-Tirinyi Mbale road under contract number UNRA/WORKS/2013-14/00025/01/06 at a contract sum of UGX 135,371,669,415. The contract was to commence on 23 rd April 2018 and end on 22 nd May 2020.  \nReview of the project documents, the BOQ and payment certificates revealed that by the time the project was at 67% completion (financial completion), the executed quantities for items in the BOQ like earthworks, compaction, rock fill, materials like crushed stone, labour and others exceeded the planned quantities some by over 200%. Table 5 below refers.", "page": 22}, {"type": "heading", "level": 3, "content": "Table 5: Differences in original quantities and those on the project", "page": 23}, {"type": "table", "content": [["**Item bill no**", "**ORIGINAL QUANTITIES**", "**QUANTITY SO FAR**", "**NET DIFFERENCE**", "**% DIFFERENCE**"], ["14.05 (c) operate vehicles specified for travel distance in excess of average 3000km per month (km)", "120,000", "446,890", "326,890", "272.41"], ["14.13 communication(b)", "18", "21.419", "3", "18.99"], ["33 TOTAL BILL AMOUNT", "1,054,344,000", "3,009,389,297", "1,955,045,297", "185.43"], ["**36 EARTH WORKS**", "", "", "**0**", ""], ["36.01 EXCAVATIONS", "14348", "14687.96", "340", "2.37"], ["36.02(D) ROCK FILL PROCESSING AND COMPACTION", "1299", "6895.46", "5,596", "430.83"], ["36.03 ROAD BED COMPACTION", "15084", "23971.69", "8,888", "58.92"], ["37.02 (A) NATURAL GRAVEL CLASS G30", "7000", "8940.29", "1,940", "27.72"], ["81\\. labour", "6,274,000", "8,720,641", "2,446,641", "39.00"], ["**Materials**", "", "", "", ""], ["91.03 crushed stone aggregates (ton)", "75", "11,928.45", "11,853", "15804.60"], ["91.04 sand (ton)", "40", "156.34", "116", "290.85"], ["91.1 cutback bitumen ltrs", "975", "27,779.07", "26,804", "2749.14"], ["Equipment", "", "", "0", ""], ["100.08 motor grader(hrs)", "200", "254.9", "55", "27.45"], ["100.01 wheeled roller", "150", "286.75", "137", "91.17"], ["100.13 self-propelled water tanker", "200", "207.5", "8", "3.75"]], "page": 23}, {"type": "paragraph", "content": "This was an indicator that proper planning and feasibility studies were not carried out during the design phase of the road leading to increased use of quantities and thus more funds.", "page": 23}, {"type": "paragraph", "content": "The Accounting Officer explained that the contract is an admeasurement contract where during the time of payment, the contractor is paid basing on the actual quantity of work performed. This is the reason for the variances stated above. And all the IPC’s have been approved by the contract manager.", "page": 24}, {"type": "paragraph", "content": "I advised the Accounting Officer to carry out proper preliminary design and feasibility studies in order to minimize variations in quantities.", "page": 24}, {"type": "heading", "level": 5, "content": "10.0 Liquidated damages on Hima-Katunguru road project- UGX 1,873,318,398", "page": 24}, {"type": "paragraph", "content": "GCC 49.1 of the contract for the rehabilitation of Hima – Katunguru road project states that; the contractor shall pay liquidated damages to the employer at the rate per day stated in the SCC for each day that the completion date is later than the intended completion date. It was emphasized in the special conditions (SCC, GCC 49.1) that the liquidated damages for the whole of the works are 0.05% per day.", "page": 24}, {"type": "paragraph", "content": "Review of project correspondences of the rehabilitation of Hima Katunguru road by China Railway No 3 Engineering group revealed that the contract expired on 22 nd Sept 2019, but the contractor completed the works on 6 th Nov 2019 and liquidated damages amounting to UGX 1,873,318,398 as a result of delay in works completion were not charged to the contractor.", "page": 24}, {"type": "paragraph", "content": "Failure to charge the liquidated damages is a loss to Government, and the contractors may not be motivated to work in accordance with contract terms.", "page": 24}, {"type": "paragraph", "content": "The Accounting Officer explained that a letter was written to the Resident Engineer requesting him to invoke clause 8.7 and deduct liquidated damage from IPC19. I advised the Accounting Officer to expedite the recovery of the liquidated damages from the contractors", "page": 24}, {"type": "heading", "level": 5, "content": "11.0 Engineering Audit of a selected sample of Road Development, Bridge,", "page": 24}, {"type": "paragraph", "content": "Rehabilitation and maintenance Projects implemented during the year", "page": 24}, {"type": "heading", "level": 5, "content": "11.1 Background", "page": 24}, {"type": "paragraph", "content": "For the financial year 2019/20, a total of 64 projects (Development, rehabilitation and bridge projects) with a total contract sum/value of UGX 12,523,857,730,000 were under implementation by UNRA.", "page": 24}, {"type": "heading", "level": 3, "content": "Table 13: Engineering projects selected for audit:", "page": 25}, {"type": "table", "content": [["**S/No**", "**Contract road name/Contractor**", "**Contract Price (UGX,M)**"], ["1", "Package 1: Masindi(Kisanja)-Park junction, Packwach (Tangi Junction)-Paraa-Buliisa (147km)/ CCCC", "804,643.23"], ["2", "Package 3: Buhimba-Nalweyo-Bulamagi and Bulumagi-Igayaza- Kakumiro (93 Km)/ China Wu Yi Co. Ltd", "658,012.95"], ["3", "Bulima- Kabwoya/ China Railway No 5 Engineering Group Co. Ltd", "141,941.00"], ["4", "Kyenjojo-Kabwoya/ Shengli Engineering Construction (Group) Co Ltd of Shengli Oilfield", "214,563.00"], ["5", "Akisim – Moroto/ China Railway No.3 Engineering Group Co. Ltd", "248,000.00"], ["6", "Mubende-Kakumiro-Kagadi Road/CCCC", "484,887.00"], ["7", "Masaka-Bukakata/ Arab contractors", "165,325.00"], ["8", "FortPortal- Hima/ China Wu Yi Co. Ltd", "94,838"], ["9", "Hima – Katunguru/ China Railway no. 3", "83,258"], ["10", "Design and Build of Odroo Bridge on Arua-Biliafe-Otrevu road, Ayugi Bridge on Atiak-Adjumani-Moyo-Yumbe-Manibe road, Wariki Bridge on Logiri-Bondo road, Ceri, Adidi and Opio Bridges on Pakele-Pabbo road./ Chongqing International Construction Corporation (CICO)", "56,113"], ["11", "Reconstruction of Washed Out and Failed Bridges in Northern Uganda Under Design and Build. Lot 1: Design and Build of Aji and Ora bridges including 9.2km access road/ Terrain Services Ltd", "18,222"], ["12", "Reconstruction of Washed Out and Failed Bridges in Northern Uganda Under Design and Build. Lot 2: Design and Build of Enyau Bridge/ Terrain Services Ltd", "11,682"], ["13", "Construction of Multi Cell Box Culvert at Opot along Amuria- Obalanga-Abim Road/ Kasese Nail and Wood in JV with Hands Engineering", "6,880"], ["", "**TOTAL**", "**2,988,365.18**"]], "page": 25}, {"type": "paragraph", "content": "Below is a summary of the key findings and observations resulting from the engineering audit. The details of the findings are presented in a separate engineering audit report.", "page": 25}, {"type": "list", "content": "- Relocation of facilities were underestimated for Kyenjojo-Kabwoya road project by over 127%\n- In extensive consultation with Uganda Wildlife Authority (UWA) and National Forestry Authority (NFA) during concept design for Masindi-Park junction-Tangi road project through Murchison falls National Park resulting in reduction of road width in the park section which may result in a potential nugatory expenditure of USD 4,884,766.10\n- Underestimation of quantities by UGX 16bn (11.95% of the original contract) for Bulima-Kabwoya road project. In addition, for the same project, there was an omission of about 0.8Km of swamp sections of 4m average depth resulting in four times the requirement for swamp treatment.\n- Underestimation of quantities for Masaka-Bukakata road project due to inadequacies in geotechnical investigations\n- Absence of detailed design at contract commencement for Hima-Katunguru rehabilitation project", "page": 26}, {"type": "paragraph", "content": "The Accounting Officer responded that consultations are being made with utility companies to estimate relocations prior to issuance of bid documents. She stated that consultations were made with relevant MDAs such as UWA, NEMA and NFA. She further indicated that development of bills of quantities at design stage is being supervised by a Manager quantity surveying before procurement of works contracts to minimize estimation errors. I commend the adopted approach to reduce increases in scope during project implementation due to quantities estimation errors.", "page": 26}, {"type": "paragraph", "content": "I advised the Accounting officer to consult the key stakeholders during concept design and not wait for review recommendations during the ESIA. In addition to adopting measures to ensure adequate planning for the projects to minimize design gaps that would impact on the service life of the infrastructure projects..", "page": 26}, {"type": "paragraph", "content": "11.3", "page": 26}, {"type": "heading", "level": 5, "content": "Delays in completion of design reviews", "page": 26}, {"type": "paragraph", "content": "Design review is a key component of construction supervision for which any delay affects implementation of the projects. However, delays were observed for several engineering projects, such as the following;", "page": 26}, {"type": "list", "content": "- For kyenjojo-kabwoya project, a first design review was delayed by 3 months while the final review delayed by 9 months.\n- For Akisim-Moroto road section, the first review was delayed by 3 months while the final review delayed by 9 months.\n- For Bulima-Kabwoya project, while the review was scheduled for 6 months, it delayed by over 24 months.\n- For masaka-Bukakata road project, the design review delayed by over 60 months (5 years) with multiple reviews leading to a net increase in project cost of UGX 16.3bn.\n- Fort portal-Hima road design drawings were delayed by over a year.", "page": 26}, {"type": "list", "content": "- For Hima-Katunguru project , there was delay in issuance of final design drawings by over 12 months.\n- For the design and build of lot 3 bridges projects reviewed; the draft and final design that was to be submitted in 12 and 20 weeks respectively, was submitted in 16 and 32 weeks respectively.", "page": 27}, {"type": "paragraph", "content": "I advised the Accounting Officer to consider charging damages for consultants that fail to deliver design reviews on time due to their impact on overall project in respect of completion time and claims for prolongation which could be avoided among others.", "page": 27}, {"type": "paragraph", "content": "11.4", "page": 27}, {"type": "heading", "level": 5, "content": "Delays in progress of works", "page": 27}, {"type": "paragraph", "content": "Delays were noted in failure to complete the projects within the contractually stipulated time. The following examples pertain:", "page": 27}, {"type": "list", "content": "- For Bulima-Kabwoya road project that was initially scheduled for 30 months, after 52 months the project has achieved 97% completion.\n- Masaka-Bukakata road project had a 13.9% physical progress lag.\n- A delay of over 44 days on Hima Katunguru road project (UGX 660,000,000 delay damages) was noted.", "page": 27}, {"type": "paragraph", "content": "I advised the Accounting Officer to charge liquidated damages for delays beyond the project completion dates. For those projects within project timelines, the progress lags need to be reduced to ensure timely completion.", "page": 27}, {"type": "paragraph", "content": "11.5", "page": 27}, {"type": "heading", "level": 5, "content": "Use of lump sum contracts", "page": 27}, {"type": "paragraph", "content": "Several projects were implemented as lump-sum contracts. This was common for all the design and build projects. Clause 35 (1) of the PPDA regulations 2014 states that “a procuring and disposing entity shall use a lump sum contract for buildings and other f orms  \nof construction where the works are well defined and are unlikely to change in quantity or specification, and where encountering difficult or unforeseen site conditions, such as hidden foundation problems, is unlikely”.", "page": 27}, {"type": "paragraph", "content": "The Accounting Officer explained that the choice in using Lump sum contracts was due to advantages like minimising risks for the client, reduction in owner supervision, etc.", "page": 27}, {"type": "paragraph", "content": "11.6  \nInclusion of contingency in design and build contracts", "page": 28}, {"type": "paragraph", "content": "Five of the thirteen bridges audited were design and build and had a 10% inclusion as contingency.", "page": 28}, {"type": "paragraph", "content": "The Accounting Officer explained that the contingency was added to the contract to cater for unforeseen events/risks to the Employer as is best practice for civil works projects.", "page": 28}, {"type": "paragraph", "content": "I advised that in design and build method of projects delivery, it is expected that the employer fully understands the project output required and therefore his requirements must be comprehensively defined to achieve those outputs. This means money is locked in the project in anticipation of variations. Therefore there was no need to increase contract sum by 10% contingency as Clause 20.1 of FIDIC yellow book stipulates clearly how risks due to employer are handled.", "page": 28}, {"type": "paragraph", "content": "11.7", "page": 28}, {"type": "heading", "level": 5, "content": "Unrealistic rates by Contractors", "page": 28}, {"type": "paragraph", "content": "Clause 5 (1) of the PPDA rules and methods for procurement 2014 requires the accounting officer to use all appropriate sources of information so as to determine the market price of a procurement. Some of the proposed sources are;", "page": 28}, {"type": "list", "content": "- Prices obtained on previous similar bids or contracts, taking into account any difference in the quantities purchased\n- Prices published or advised by potential providers; and\n- A build-up of estimates of prices of components of the works,", "page": 28}, {"type": "paragraph", "content": "I noted that Kyenjojo-Kigumba road project had unrealistic rates for several items including accommodation for the engineer, vehicles, concrete works and earthworks, the Lot 3 of design and build bridges project also had unrealistic rates for excavation, concrete pipes, reinforcement and concrete for structures.", "page": 28}, {"type": "paragraph", "content": "The Accounting Officer explained that rates for key cost drivers for the projects are checked at evaluation stage and for unrealistic rates; bidders are requested to provide a cost build-up. The Accounting Officer further indicated that market assessments are also undertaken before arriving at the contract sum.", "page": 28}, {"type": "paragraph", "content": "11.8", "page": 29}, {"type": "heading", "level": 5, "content": "Unenforceable clauses in works contracts", "page": 29}, {"type": "paragraph", "content": "Review of the different contracts indicated some clauses that were not enforceable despite their usefulness to UNRA. For instance;", "page": 29}, {"type": "list", "content": "- UNRA could not charge damages for delayed handover of priority sections along Kyenjojo-Kabwoya project, Buhimba-Nalweyo project (package 3),\n- An erroneous clause in the Hima-Katunguru road project lead to UNRA meeting all overheads for the disputes review board invoices including the Contractor’s part contribution. This led to a payment of UGX 18,155,663.91 above the limit.", "page": 29}, {"type": "paragraph", "content": "The Accounting Officer explained that a claim for the delay damages was not enforced due to an undefined completion time for the priority sections. The Accounting Officer also indicated that an attempt had been made to recover the overpayment.", "page": 29}, {"type": "paragraph", "content": "I advised her to check the consistence of contract clauses to eliminate loss of potential damages or unrecoverable overpayments.", "page": 29}, {"type": "paragraph", "content": "11.9", "page": 29}, {"type": "heading", "level": 5, "content": "Lack of dispute boards", "page": 29}, {"type": "paragraph", "content": "Two road projects audited namely Akisim-Moroto project (under Defects Liability Period) and Fort Portal-Hima project under construction, did not have fully constituted dispute boards as required i.e. 90 days after commencement. The boards are necessary to resolve timely any disagreements between UNRA and the Contractors that arise during contract implementation.", "page": 29}, {"type": "paragraph", "content": "The Accounting Officer explained that the delays were due to the Contractor’s objection and preferred particular Dispute Boards.", "page": 29}, {"type": "paragraph", "content": "I advised the Accounting Officer to complete the process for constituting Dispute Boards for ongoing projects and always ensure timely appointments.", "page": 29}, {"type": "heading", "level": 5, "content": "11.10 Inclusion of unnecessary items in BOQs", "page": 29}, {"type": "paragraph", "content": "Several items were found in project Bills of Quantities that were considered unnecessary for the scope of works under consideration or redundant due to contrary provisions. This was especially noted for laboratory supplies that were not necessary for the project under implementation and requirements to purchase cars for supervision teams while the transport arrangements were already catered for separately. The following refer:", "page": 29}, {"type": "list", "content": "- Laboratory supplies worth USD 34,526.2 on Laboratory equipment for Asphalt Concrete roads while the road under implementation was Double Bituminous Surface Treatment (DBST). This was found on Kyenjojo-Kabwoya road project.", "page": 29}, {"type": "list", "content": "- Inclusion of UGX 370,000,000 provisional sum for vehicle purchase for employer’s use yet the supervision team already had a facilitation provision. This was found on the contract for construction of Multi-cell box culvert at Opot along Amuria-Obalanga-Abim road", "page": 30}, {"type": "list", "content": "- Provisional sum of UGX 200,000,000 to provide a vehicle for the employer. This was found on the design and build contract for Enyau bridge.\n- Provisional sum to provide a vehicle that was not bought under lot 1 (design and build of Aji and Ora bridges).", "page": 30}, {"type": "paragraph", "content": "These sums ultimately led to increased contract sums.", "page": 30}, {"type": "paragraph", "content": "The Accounting officer explained that the laboratory equipment would be useful in establishing a laboratory for UNRA. The accounting officer further added that the vehicles were not bought because the supervision was done by the in-house team which already had transport facilitation.", "page": 30}, {"type": "paragraph", "content": "I advised the Accounting officer to remove items that increase contract sums whose function is already catered for under other items that are more favorable. Besides, a separate procurement could also be considered for the supplies if needed.", "page": 30}, {"type": "heading", "level": 5, "content": "11.11 Inadequacies in work programs", "page": 30}, {"type": "paragraph", "content": "I noted that work programs for the projects assessed were either out of date or having gaps in their constitution. They missed the core requirements needed for being operational. The following inadequacies were generally noted among the work programs:", "page": 30}, {"type": "list", "content": "- The critical path was not defined in relation to the actual resources.\n- Work allocation was not consistent with the resources.", "page": 30}, {"type": "list", "content": "- Production rates and standard rates of equipment were not included in the work program", "page": 30}, {"type": "list", "content": "- The cash flow forecasts presented by the contractor were not linked to the work program.", "page": 30}, {"type": "list", "content": "- Quantities of work were not linked to the equipment inventory/productivities.", "page": 30}, {"type": "paragraph", "content": "I advised the Accounting Officer contractor to enforce this requirement as it is necessary in resolution disputes regarding prolongation costs in case they arise. An updated work program makes the delivery of the contract on time easier.", "page": 31}, {"type": "paragraph", "content": "John F.S. Muwanga", "page": 31}, {"type": "heading", "level": 5, "content": "AUDITOR GENERAL", "page": 31}, {"type": "heading", "level": 5, "content": "KAMPALA", "page": 31}, {"type": "paragraph", "content": "28 th December 2020", "page": 31}, {"type": "heading", "level": 5, "content": "APPENDICES", "page": 32}, {"type": "paragraph", "content": "Appendix 1  \nAppendix 2: Showing key outputs and activities and the level of implementation", "page": 32}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["**0952 Design Masaka-Bukakata road**", null, null, null, null, null, null, null], ["01 Monitoring and Capacity Building Support", "12 monitoring supervision reports and", "Budgeted amount: 225,233 External Financing: 0 Revised budget: 225,233 Reallocations: 0  Amount released: 168,916 Amount spent: 207,021", "10", "2", "10 out of 12 reports prepared", "Partially achieved", "Output was partially achieved.  M&S reports had no standard format. Only 10 out of 12 reports provided"], [null, "Payment of PAYE and NSSF to staff under the Project Implementation Unit", null, "1", "0", "N/A", "Fully achieved", null], ["80  National Construction /Rehabilitation Standard) Road (Bitumen", "17 km  upgraded Masaka-Bukakata road. equivalents on", "Budgeted amount: 30,323,056  External Financing: 70,131,912  Revised budget: 30,278,227 Reallocations: 44,828.940 Amount released: 14,285,555 Amount spent: 30,951,147", "12.53", "4.47", "Increased water levels,  which caused flooding in some  sections (Lambu Spur and Bukakata swamp) and caused delays in  progress of works.", "Partially achieved", "spent in report the performance  is 30,271,251,  different from the amount spent as per the BIG reports- 30,951,147.505 Output was partially achieved due to delays in progress of works. Amount"], [null, "Rehabilitation of 5.88Km equivalent for Masaka town roads", null, "0", "5.88", "Procurement for civil  works contractor was still ongoing  at close  FY 2019/20 as of", "Not achieved", null], ["**1040 Design Kapchorwa-Suam road (77km)**", null, null, null, null, null, null, null]], "page": 32}, {"type": "table", "content": [["**Output Output**", "**Planned Target for the Financial year** **Planned Target for the Financial year**", "**Funds Funds**  **UGX** UGX (‘000’) (‘000’)**", "**Achieved Target by Financial year end** **Achieved Target by Financial year end**", "**Variance Variance**", "**Causes for the variances** **Causes for the variances**", "**Audit Conclusion** **Audit Conclusion**", "**Output Output** Remarks Remarks**"], ["**0952**  **0952**  **Design**  **Design**  **Masaka-Bukakata Masaka-Bukakata** road road**", null, null, null, null, null, null, null], ["01 Monitoring and Capacity Building Support 01 Monitoring and Capacity Building Support", "12 monitoring supervision reports 12 monitoring and supervision reports and", "Budgeted amount: 225,233 External Financing: 0 Revised budget: 225,233 Reallocations: 0 Budgeted amount: 225,233 External Financing: 0 Revised budget: 225,233 Reallocations: 0", "10 10", "2 2", "10 out of 12 reports prepared 10 out of 12 reports prepared", "Partially achieved Partially achieved", "Output was partially achieved.  M&S reports had no standard format. Only Output was partially achieved.  M&S reports had no standard format. Only"]], "page": 32}, {"type": "table", "content": [["80  National Construction /Rehabilitation Standard) Road (Bitumen 80  National Construction /Rehabilitation Standard) Road (Bitumen", "17 km  upgraded Masaka-Bukakata road. equivalents on 17 km  upgraded Masaka-Bukakata road. equivalents on", "Budgeted amount: 30,323,056  External Financing: 70,131,912  Revised budget: 30,278,227 Reallocations: 44,828.940 Amount released: 14,285,555 Amount spent: 30,951,147 Budgeted amount: 30,323,056  External Financing: 70,131,912  Revised budget: 30,278,227 Reallocations: 44,828.940 Amount released: 14,285,555 Amount spent: 30,951,147", "12.53 12.53", "4.47 4.47", "Increased water levels,  which caused flooding in some  sections (Lambu Spur and Bukakata swamp) and caused delays in  progress of works. Increased water levels,  which caused flooding in some  sections (Lambu Spur and Bukakata swamp) and caused delays in  progress of works.", "Partially achieved Partially achieved", "spent in report the performance  is 30,271,251,  different from the amount spent as per the BIG reports- 30,951,147.505 Output was partially achieved due to delays in progress of works. spent in Amount  report the performance  is 30,271,251,  different from the amount spent as per the BIG reports- 30,951,147.505 Output was partially achieved due to delays in progress of works. Amount"], [null, "Rehabilitation of 5.88Km equivalent for Masaka town roads Rehabilitation of 5.88Km equivalent for Masaka town roads", null, "0 0", "5.88 5.88", "Procurement for civil  works contractor was still ongoing  at close  FY 2019/20 as of Procurement for civil  works contractor was still ongoing  at close  FY 2019/20 as of", "Not  Not  achieved achieved", null], ["**1040**  **1040**  **Design Design**  **Kapchorwa-Suam Kapchorwa-Suam** road road (77km) (77km)**", null, null, null, null, null, null, null]], "page": 32}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "Upgrade of 19km of the road", "Budgeted amount: 7,150,000 External Financing: 114,756,904  Revised budget: 6,660,000 Reallocations: 910,000 Amount released: 3,580,000 Amount spent: 6,595,306", "9.05", "9.95", "Delay  in acquisition of ROW and heavy rains", "Partially achieved", "Output was partially achieved due to land disputes which affected the progress of works. Amount spent the performance  is 6,575,742,  different from the amount spent as per the BIG reports- 6,595,306.025 in report"], ["**1176 Hoima-Wanseko Road (83Km)**", null, null, null, null, null, null, null], ["01 Monitoring and Capacity Building Support", "Salaries of project staff paid.", "Budgeted amount: 3,070,600 External Financing: 0  Revised budget: 3,070,600 Reallocations: 0  Amount released: 2,471,950 Amount spent: 3,070,428", "1", "0", "N/A", "Fully achieved", "Output was partially achieved."], [null, "Monitoring supervision of projects. and", null, "N/A", "Not able to assess", "Not able to assess since there were no clear targets", "Not able assess to", null], [null, "Procurement of fuel for vehicles.", null, "N/A", "Not able to assess", "Not able to assess since there were no clear targets", "Not able assess to", null], [null, "Maintenance of vehicles.", null, "N/A", "Not able to assess", "Not able to assess since there were no clear targets", "Not able assess to", null], [null, "48 reports drafted", null, "48", "0", "N/A", "Fully achieved", null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "Upgrade of 149km of oil roads", "Budgeted amount: 129,300,000  External Financing: 717,538,112  Revised budget: 129,300,000 Reallocations: 0", "117.67", "31.33", "Delays in payment of contractors", "Partially achieved", "Output was partially achieved due to delays in loan securing which slowed down the progress of works"]], "page": 33}, {"type": "paragraph", "content": "34", "page": 33}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["Amount released: 27,300,000 Amount spent: 130,709,976", "", "", "", "", "", null, null], ["**1278 Kampala-Jinja Expressway**", null, null, null, null, null, null, null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "Rehabilitation 5.88km distance of a", "Budgeted amount: 13,350,000  External Financing: 372,534,876  Revised budget: 12,015,000 Reallocations: 1,300,035 Amount released: 10,540,772 Amount spent: 12,024,866", "9", "-3.12", "Extra land take", "Fully achieved", "Output was fully achieved."], [null, "Rehabilitation of 2.14km road distance and procurement of a civil works contractor", null, "2.14", "0", "N/A", "Fully achieved", null], ["**1281 Tirinyi-Pallisa-Kumi/Kamonkoli Road**", null, null, null, null, null, null, null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "37 km equivalents on Tirinyi - - Kumi/ Kamonkoli road upgraded. Pallisa", "Budgeted amount: 41,800,000  External Financing: 122,008,504  Revised budget: 41,700,000 Reallocations: 100,000 Amount released: 34,442,788 Amount spent: 42,124,007", "60.10", "-23.1", "Extra land take", "Fully achieved", "not on the output was  consistent. Total kms acquired on both sections from Tirinyi to Kamonkoli are 80km which is not in line with the 60km attained within the financial year under review Output achieved. was  fully Reporting"]], "page": 34}, {"type": "paragraph", "content": "35", "page": 34}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["in report Amount spent the performance  is 41,700,000,  different from the amount spent as per the BIG reports- 42,124,006.916", null, null, null, null, null, null, null], ["**1313 North Eastern Road-Corridor Asset Management Project**", null, null, null, null, null, null, null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "\\- Mbale 69 km equivalents on Tororo  - Soroti - Dokolo - Lira - Kamdini  road Rehabilitated/ reconstructed.", "Budgeted amount: 3,273,400 External Financing: 129,196,838  Revised budget: 2,946,060 Reallocations: 327,340 Amount released: 2,246,060 Amount spent: 2,972,481.796", "0", "69", "Non-compliance  by the contractor to environment and  social safeguards that led to the suspension  of works.", "Not achieved", "Output was not implemented.  Works on this output were suspended due to non-compliance by the contractor  to environmental and social safeguards"], ["**1319 Kampala Flyover**", null, null, null, null, null, null, null], ["74 Major Bridges", "24% of  works  flyover completed for construction Kampala", "Budgeted amount: 0 External Financing: 99,131,909  Revised budget: 21,252,298 Reallocations: 21,252,298 Amount released: 21,252,297.931  Amount spent: 21,235,903", "3.55%", "20.45", "Delays relocation utilities in of", "Partially achieved", "Output was partially achieved due to delays in relocation of utilities. The targets are not consistent as reported in the policy statement and performance reports."], ["**1320 Construction of 66 Selected Bridges**", null, null, null, null, null, null, null], ["74 Major Bridges", "25% construction works on 66 bridges", "Budgeted amount: 72,300,000  External Financing: 0", "32", "34", "Delays procurement processes in and", "Partially achieved", "Output was partially achieved  Amount spent in the"]], "page": 35}, {"type": "paragraph", "content": "36", "page": 35}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["Revised budget: 67,306,547 Reallocations: 5,297,501 Amount released: 52,306,526 Amount spent: 67,466,683", "", "", "covid 19", "", "performance report is 67,306,547,  different from the amount spent as per the BIG reports- 67,466,683", null, null], ["**1402 Rwenkunye- Apac- Lira-Acholibur road**", null, null, null, null, null, null, null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "Advance payment contractor mobilization paid. to for", "Budgeted amount: 16,000,000  External Financing: 100,657,016  Revised budget: 14,400,000 Reallocations: 1,600,000 Amount released: 14,400,000 Amount spent: 14,637,421", "N/A", "Not able to assess", "Procurement of contractor  for Migyera-Kafu was called off", "Partially achieved", "Output was partially achieved.  Procurement of the civil works contractors had not been concluded by the end of the Financial year. spent in report the performance  is 14,400,000,  different from the amount spent as per the BIG reports- 14,637,421.406 Amount"], [null, "km-equivalent on 3  constructed Rwenkunye-Apac-Lira- Archolibur road.", null, "0", "3", "Procurement of the civil works contractor had not been concluded by the end of the Financial year.", "Not achieved", null], [null, "2.94Km equivalent Migera  rehabilitated. for Kafu", null, "0", "2.94", "Procurement of the civil works contractors had not  been concluded by the end of the Financial year.", "Not achieved", null], ["**1403 Soroti-Katakwi-Moroto-Lokitonyala road**", null, null, null, null, null, null, null]], "page": 36}, {"type": "paragraph", "content": "37", "page": 36}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "30 km equivalents on Soroti-Katakwi-  Akism - Moroto Lokitanyala upgraded -", "Budgeted amount: 137,500,000  External Financing: 0  Revised budget: 123,750,000 Reallocations: 13,750,000 Amount released: 99,469,624 Amount spent: 123,631,938", "19.6", "10.4", "Procurement of civil  works contractor  for moroto  - lokitanyala was still ongoing by close  FY 2019/20. of", "Partially achieved", "spent in report the performance  is 123,749,999, different from the amount spent as per the BIG reports- 123,631,937.692 Output was partially achieved. Amount"], ["**1404 Kibuye- Busega- Mpigi**", null, null, null, null, null, null, null], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "7 km equivalents on Busega-Mpigi  road upgraded", "Budgeted amount: 0 External Financing: 208,420 Revised budget: 400,162 Reallocations: 400,162 Amount released: 400,162 Amount spent: 400,162", "0", "7", "Lack of an approved design and alignment", "Not achieved", "Output was not implemented due to lack of an approved design and alignment"], ["**1506 Land Acquisition**", null, null, null, null, null, null, null], ["04 51 71 Acquisition of Land by Government", "0.4 Hectares of acquired land", "Budgeted amount: 408,681,655  External Financing: 0  Revised budget: 408,681,655 Reallocations: 0  Amount released: 207,176,507  Amount spent: 408,720,957", "2.06", "-1.66", "land debt was carried forward from  2018/19 exceeding  the initial target", "Fully achieved", "target to was exceeded  1,721 hectares of land due to a majority of land debts being carried forward from FY 2018/2019 the acquired land has no 80% of Output was partially achieved. The Over"], [null, "0.4 Hectares of acquired land", null, "N/A", "Not able to assess", "This  acquired  Olwiyo Gulu road. land was under", "Fully achieved", null], [null, "12.14 Hectares of land acquired", null, "0", "12.14", "Land was not acquired due to an ongoing court case", "Not achieved", null]], "page": 37}, {"type": "paragraph", "content": "38", "page": 37}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["56.66 Hectares of land acquired", "", "160.13", "-103.47", "The plan had only considered lot 1 land acquisition however,  resources  were doubled to avail land for lot 2 as well which the contractor required.", "Fully achieved", "titles yet due to lengthy processes involved in land  subdivision. payments disputes achievement output in and PAPs land affected of the Delays", null], ["0.40 Hectares of land acquired", "", "16.02", "-15.62", "Land debt was brought forward from financial year 2018/19", "Fully achieved", null, ""], ["28.33 Hectares of land acquired", "", "39.16", "-10.83", "Land debt was brought forward from financial year 2018/19", "Fully achieved", null, ""], ["0.4 Hectares of acquired land", "", "N/A", "Not able to assess", "This acquired Mpigi Sembabule project land was under Madu road", "Fully achieved", null, ""], ["0.4 Hectares of acquired land", "", "22.65", "-22.25", "This  land represents both Sembabule Vila Mmaria and Mpigi Madu Sembabule; there was land debt  carried forward  from 2018/19", "Fully achieved", null, ""], ["0.81 Hectares of land acquired", "", "0", "0.81", "Residual claims on this  land acquisition were still  being compensated", "Not achieved", null, ""]], "page": 38}, {"type": "paragraph", "content": "39", "page": 38}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["40.47 Hectares of land acquired", "", "136.77", "-96.3", "Previous  acquisition was within Kampala where there were a lot of disputes that did not allow for  prompt payment; payments within FY 2019/20 were mostly in Mukono where there were less  disputes. Projection of land was based on past experience and thus  an underestimate.", "Fully achieved", "", null], ["0.4 Hectares of acquired land", "", "5.79", "-5.39", "There was extra land take between Km0+000  - Km5+000", "Fully achieved", "", null], ["3.24 Hectares of land acquired", "", "0.106", "3.134", "Part of the land intended to be acquired  was Electoral Commission and Uganda  Police which  not submit required documentation on time. did", "Partially achieved", "", null], ["2.02 Hectares of land acquired", "", "0", "2.02", "Delay in finalizing design  delayed start of Land Acquisition", "Not achieved", "", null]], "page": 39}, {"type": "paragraph", "content": "40", "page": 39}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["0.81 Hectares of land acquired", "", "0", "0.81", "Detailed design not yet ready", "Not achieved", "", null], ["242.82 Hectares of land acquired", "", "632.6", "-389.78", "Land  take projected  was increased to cater for the additional roads.", "Fully achieved", "", null], ["60.70 Hectares of land acquired", "", "0", "60.7", "There administrative delays  designs methodology valuation assessments in both and of were", "Not achieved", "", null], ["20.23 Hectares of land acquired", "", "0", "20.23", "RAP report not implemented", "Not achieved", "", null], ["28.33 Hectares of land acquired", "", "51.38", "-23.05", "There was land debt  carried forward from FY 2018/19", "Fully achieved", "", null], ["48.56 Hectares of land acquired", "", "49.19", "-0.63", "Land acquired as planned but within minimum variance", "Fully achieved", "", null], ["0.81 Hectares of land acquired", "", "10.5", "-9.69", "also land from There was land debt  carried forward from FY 2018/19.  Additional  was  supplementary report  and  during 2019/20 prepared implemented", "Fully achieved", "", null], ["48.56 Hectares of land acquired", "", "0", "48.56", "RAP implemented report not", "Not achieved", "", null]], "page": 40}, {"type": "paragraph", "content": "41", "page": 40}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["121.41 Hectares of land acquired", "", "0", "121.41", "RAP report not implemented", "Not achieved", "", null], ["28.33 Hectares of land acquired", "", "0", "28.33", "Land not yet acquired for this road  section. Reported  land acquired relates to Busega  Mpigi section", "Not achieved", "", null], ["40.47 Hectares of land acquired", "", "0", "40.47", "Land was acquired as planned but it is not part of the project codes", "Not achieved", "", null], ["0.81 Hectares of land acquired", "", "1.55", "-0.74", "Project  was substantially completed; most payments were covering debt from FY 2018/19", "Fully achieved", "", null], ["**1277 Kampala Northern Bypass Phase 2**", null, null, null, null, null, null, null], ["04 51 80 National Road Construction/Rehabilitatio n (Bitumen Standard)", "3 km equivalent on Kampala - Northern Bypass  upgraded.", "Budgeted amount: 75,000,000  External Financing: 0  Revised budget: 68,000,000 Reallocations: 7,000,000 Amount released: 29,282,719 Amount spent: 70,941,155", "2.04", "0.96", "Reduction in the workforce  and working  hours because  of encamping due to Covid  -19 pandemic.", "Partially achieved", "in report Output was partially achieved  Amount spent the performance  is 68,000,000,  different from the amount spent as per the BIG reports- 70,941,155"], ["**1042 Design Nyendo - Sembabule (48km)**", null, null, null, null, null, null, null]], "page": 41}, {"type": "paragraph", "content": "42", "page": 41}, {"type": "table", "content": [["**Output**", "**Planned Target for the Financial year**", "**Funds UGX (‘000’)**", "**Achieved Target by Financial year end**", "**Variance**", "**Causes for the variances**", "**Audit Conclusion**", "**Output Remarks**"], ["80  National Construction/Rehabilitatio n (Bitumen Standard) Road", "11 km equivalent of town roads upgraded.", "Budgeted amount: 28,899,400  External Financing: 0  Revised budget: 26,013,060 Reallocations: 2,886,340 Amount released: 18,483,060 Amount spent: 26,748,982", "9.04", "1.96", "N/A", "Partially achieved", "spent in report the performance  is UGX  26,013,060 different from the amount spent as per the BIG reports-26,748,982. Output was partially achieved Amount"]], "page": 42}, {"type": "paragraph", "content": "43", "page": 42}, {"type": "heading", "level": 5, "content": "Appendix 2(i): Mischarge of expenditure-UGX. 288,713,825,335", "page": 43}, {"type": "table", "content": [["**Project Code**", "**Project Name**", "**Diverted to Code**", "**Project Name**", "**Amount Mischarged**"], ["265", "Atiak-Moyo Road", "1402", "Rwenkunye - Apac -Lira - Acholibur road", "29,670,000"], ["", "", "1555", "Fortportal Hima road", "6,300,000,000"], ["", "", "", "", ""], ["267", "Improvement of Ferry Services", "1510", "UNRA Retooling Project", "769,162,940"], ["", "", "RM01", "Road maintenance in stations", "12,407,107,385"], ["", "", "", "", ""], ["952", "Masaka-Bukakata road", "1040", "Kapchorwa-Suam road (77km)", "196,139,369"], ["", "", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "17,273,100"], ["", "", "", "", ""], ["1035", "Mpigi-Kabulassoke (135km)", "1042", "Design Nyendo - Sembabule (48km)", "6,538,988,043"], ["", "", "1176", "Hoima-Wanseko (83km)", "1,364,503,271"], ["", "", "1277", "Kampala Northern Bypass Phase 2", "320,591,250"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "87,166,885"], ["", "", "1510", "UNRA Retooling Project", "100,930,872"], ["", "", "1536", "Upgrading of Kitala-Gerenge Project", "185,635,710"], ["", "", "RM01", "Road maintenance", "108,897,303"], ["", "", "", "", ""], ["1040", "Design Kapchorwa- Suam road (77km)", "952", "Masaka-Bukakata road", "734,859,053"], ["", "", "1034", "Mukono\\_katosi - Nyenga (72km)", "239,252,579"], ["", "", "1276", "Mubende Kakumiro-Kagadi", "159,041,641"], ["", "", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "75,095,105"], ["", "", "", "", ""], ["1041", "Hoima-Masindi- Kigumba (238km) Design Kyenjojo-", "1312", "Mbale-Bubulo-Lwakhakha", "27,319,864"], ["", "", "1551", "Fortportal Kyenjojo road", "1,060,228,895"], ["", "", "1555", "Fortportal Hima road", "218,865,813"], ["", "", "", "", ""], ["1042", "Design Nyendo - Sembabule (48km)", "1035", "Mpigi-Kabulassoke (135km)", "15,627,000"], ["", "", "RM01", "Road maintenance", "35,999,999"], ["", "", "", "", ""], ["1176", "Hoima-Wanseko", "957", "Design the New Nile Bridge at", "237,313,782"]], "page": 43}, {"type": "table", "content": [["", "(83km)", "", "Jinja", ""], ["", "", "1180", "Kampala Entebbe Express Highway", "109,840,959"], ["", "", "1319", "Kampala Flyover Project", "819,449,375"], ["", "", "1446", "Masindi-Bugungu via Murchison Falls National Park (80km)", "31,593,721,521"], ["", "", "1506", "Project Land compensation", "24,422,953"], ["", "", "RM01", "Road maintenance", "3,492,398,670"], ["", "", "", "", ""], ["1274", "Musita-Lumino-Busia (104km)", "265", "Atiak-Moyo Road", "2,348,182,161"], ["", "", "1275", "Olwiyo-Gulu-Kitgum (70.3km)", "63,604,164"], ["", "", "1276", "Mubende Kakumiro-Kagadi", "615,814,681"], ["", "", "1402", "Rwenkunye - Apac -Lira - Acholibur road", "772,616,330"], ["", "", "RM01", "Road maintenance", "1,892,051,638"], ["", "", "", "", ""], ["1275", "Olwiyo-Gulu-Kitgum (70.3km)", "1176", "Hoima-Wanseko (83km)", "15,039,060"], ["", "", "RM01", "Road maintenance", "2,174,991,153"], ["", "", "", "", ""], ["1276", "Mubende Kakumiro- Kagadi", "1506", "Project Land compensation", "37,037,000"], ["", "", "1551", "Fortportal Kyenjojo road", "842,979,794"], ["", "", "RM01", "Road maintenance", "25,034,036"], ["", "", "", "", ""], ["1277", "Kampala Northern Bypass Phase 2", "1278", "Kampala-Jinja Expressway", "998,055,340"], ["", "", "", "", ""], ["1278", "Kampala-Jinja Expressway", "1176", "Hoima-Wanseko (83km)", "385,352,993"], ["", "", "RM01", "Road maintenance", "1,825,883,811"], ["", "", "", "", ""], ["1279", "Seeta-Kyaliwajjala- Matugga-Wakiso- Buloba-Nsangi", "1275", "Olwiyo-Gulu-Kitgum (70.3km)", "12,615,982,691"], ["", "", "1276", "Mubende Kakumiro-Kagadi", "5,384,017,309"], ["", "", "RM01", "Road maintenance", "747,936,694"], ["", "", "", "", ""], ["1280", "Najjanankumbi- Busabala Road and Nambole-Namilyango- Seeta", "1034", "Mukono\\_katosi - Nyenga (72km)", "5,899,867,000"], ["", "", "1176", "Hoima-Wanseko (83km)", "7,600,133,000"]], "page": 44}, {"type": "table", "content": [["", "", "1320", "Construct Selected 66 Bridges", "61,717,000"], ["", "", "RM01", "Road maintenance", "913,572,364"], ["", "", "", "", ""], ["1281", "Tirinyi-Pallisa- Kumi/Kamonkoli Road", "1551", "Fortportal Kyenjojo road", "892,920,000"], ["", "", "", "", ""], ["1311", "Upgrading Rukungiri- Kihihi- Ishasha/Kanungu Road", "1278", "Kampala-Jinja Expressway", "2,261,025,715"], ["", "", "1551", "Fortportal Kyenjojo road", "495,181,760"], ["", "", "RM01", "Road maintenance", "90,360,117"], ["", "", "", "", ""], ["1312", "Upgrading Mbale- Bubulo-Lwakhakha Road", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "136,659,750"], ["", "", "", "", ""], ["1313", "North Eastern Road- Corridor Asset Management Project", "1276", "Mubende Kakumiro-Kagadi", "383,662,157"], ["", "", "1278", "Kampala-Jinja Expressway", "175,113,748"], ["", "", "", "", ""], ["1319", "Kampala Flyover", "1034", "Mukono\\_katosi - Nyenga (72km)", "1,941,545,149"], ["", "", "1278", "Kampala-Jinja Expressway", "5,626,939,772"], ["", "", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "1,210,521,919"], ["", "", "1312", "Mbale-Bubulo-Lwakhakha", "1,722,707,270"], ["", "", "1320", "Construct Selected 66 Bridges", "5,104,169,504"], ["", "", "1551", "Fortportal Kyenjojo road", "602,454,272"], ["", "", "", "", ""], ["1322", "Upgrading of Muyembe-Nakapiripirit (92 km)", "1278", "Kampala-Jinja Expressway", "17,567,933"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "4,676,968,121"], ["", "", "1551", "Fortportal Kyenjojo road", "500,000,000"], ["", "", "1555", "Fortportal Hima road", "3,969,644,362"], ["", "", "RM01", "Road maintenance", "353,387,517"], ["", "", "", "", ""], ["1402", "Rwenkunye- Apac- Lira-Acholibur road", "1278", "Kampala-Jinja Expressway", "218,282,106"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "13,500,000,000"]], "page": 45}, {"type": "table", "content": [["", "", "RM01", "Road maintenance", "900,000,000"], ["", "", "", "", ""], ["1403", "Soroti-Katakwi- Moroto-Lokitonyala road", "952", "Masaka-Bukakata road", "14,395,000"], ["", "", "1034", "Mukono\\_katosi - Nyenga (72km)", "5,687,429,181"], ["", "", "1056", "Transport Corridor Project", "1,966,805,152"], ["", "", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "4,505,231,137"], ["", "", "1551", "Fortportal Kyenjojo road", "778,641,780"], ["", "", "1552", "Hoima-Katunguru road", "3,546,102,760"], ["", "", "", "", ""], ["1404", "Kibuye- Busega- Mpigi", "1278", "Kampala-Jinja Expressway", "309,152,550"], ["", "", "", "", ""], ["1490", "Luwero- Butalangu", "1552", "Hoima-Katunguru road", "72,100,896"], ["", "", "1555", "Fortportal Hima road", "536,771,008"], ["", "", "RM01", "Road maintenance", "291,128,096"], ["", "", "", "", ""], ["1503", "Karugutu-Ntoroko Road", "RM01", "Road maintenance", "1,260,000,000"], ["", "", "", "", ""], ["1506", "Land Acquisition", "1278", "Kampala-Jinja Expressway", "76,240,336"], ["", "", "", "", ""], ["1510", "UNRA Retooling Project", "1034", "Mukono\\_katosi - Nyenga (72km)", "165,904,909"], ["", "", "RM01", "Road maintenance", "14,516,543,153"], ["", "", "", "", ""], ["1536", "Upgrading of Kitala- Gerenge Road", "267", "Improvement of Ferry Services", "691,305,580"], ["", "", "1278", "Kampala-Jinja Expressway", "320,159,307"], ["", "", "", "", ""], ["1537", "Upgrading of Kaya-Yei Road", "1275", "Olwiyo-Gulu-Kitgum (70.3km)", "8,425,266,754"], ["", "", "1506", "Project Land compensation", "1,341,608,465"], ["", "", "1551", "Fortportal Kyenjojo road", "8,212,032,916"], ["", "", "RM01", "Road maintenance", "90,122,265"], ["", "", "", "", ""], ["1538", "Development of Nakaseke-Ssingo- Kituma road", "1034", "Mukono\\_katosi - Nyenga (72km)", "4,041,998,602"], ["", "", "1276", "Mubende Kakumiro-Kagadi", "2,246,807,088"]], "page": 46}, {"type": "table", "content": [["", "", "1553", "Ishaka-Rugazi-Katunguru road", "2,730,864,310"], ["", "", "RM01", "Road maintenance", "144,685,945"], ["", "", "", "", ""], ["1543", "Kihihi-Butogota- Bohoma Road", "265", "Atiak-Moyo Road", "16,817,000"], ["", "", "1040", "Kapchorwa-Suam road (77km)", "63,382,000"], ["", "", "1041", "Kigumba – Bulima-Masindi – Hoima – Kabwoya road (238km)", "71,732,000"], ["", "", "1176", "Hoima-Wanseko (83km)", "54,428,530"], ["", "", "1274", "Musita-Lumino-Busia (104km)", "27,707,000"], ["", "", "1281", "Tirinyi-Pallisa-Kumi/Kamonkoli", "58,870,000"], ["", "", "1311", "Rukungiri-Kihihi- Ishaka/Kanungu", "92,760,000"], ["", "", "1312", "Mbale-Bubulo-Lwakhakha", "28,355,000"], ["", "", "1322", "Muyembe-Nakapiripirit", "38,200,000"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "22,524,005,000"], ["", "", "1506", "Project Land compensation", "150,978,208"], ["", "", "1510", "UNRA Retooling Project", "31,155,000"], ["", "", "1553", "Ishaka-Rugazi-Katunguru road", "30,560,000"], ["", "", "RM01", "Road maintenance", "2,351,330,151"], ["", "", "", "", ""], ["1544", "Kisoro-Lake Bunyonyi Road", "RM01", "Road maintenance", "900,000,000"], ["", "", "", "", ""], ["1545", "Kisoro-Mgahinga National Park Headquarters Road", "1277", "Kampala Northern Bypass Phase 2", "1,800,000,000"], ["", "", "", "", ""], ["1546", "Kisoro-Nkuringo- Rubugiri-Muko Road", "1040", "Kapchorwa-Suam road (77km)", "433,134,746"], ["", "", "1277", "Kampala Northern Bypass Phase 2", "1,029,270,645"], ["", "", "1278", "Kampala-Jinja Expressway", "123,299,611"], ["", "", "RM01", "Road maintenance", "434,783,355"], ["", "", "", "", ""], ["1547", "Kebisoni-Kisizi- Muhanga road", "1552", "Hoima-Katunguru road", "19,746,397,899"], ["", "", "1555", "Fortportal Hima road", "1,673,000,000"], ["", "", "RM01", "Road maintenance", "1,957,456,884"], ["", "", "", "", ""]], "page": 47}, {"type": "table", "content": [["1548", "Nansana-Busunju Section I", "952", "Masaka-Bukakata road", "18,895,000"], ["", "", "1278", "Kampala-Jinja Expressway", "93,311,575"], ["", "", "1549", "Nansana-Busunju II", "43,830,000"], ["", "", "", "", ""], ["1549", "Nansana-Busunju II", "1035", "Mpigi-Kabulassoke (135km)", "466,778,412"], ["", "", "1278", "Kampala-Jinja Expressway", "3,949,598,339"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "1,035,026,436"], ["", "", "1490", "Luwero- Butalangu", "403,692,817"], ["", "", "1510", "UNRA Retooling Project", "100,000,000"], ["", "", "", "", ""], ["1550", "Namunsi-Sironko/ Muyembe-Kapchorwa Section I", "1278", "Kampala-Jinja Expressway", "1,052,205,410"], ["", "", "1281", "Tirinyi-Pallisa-Kumi/Kamonkoli", "2,241,363,614"], ["", "", "RM01", "Road maintenance", "3,981,839,838"], ["", "", "", "", ""], ["1551", "Fortportal Kyenjojo road", "1278", "Kampala-Jinja Expressway", "204,157,496"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "148,359,290"], ["", "", "1553", "Ishaka-Rugazi-Katunguru road", "117,560,085"], ["", "", "", "", ""], ["1553", "Ishaka-Rugazi- Katunguru road", "1310", "Albertine Region Sustainable Dev't", "28,625,000"], ["", "", "1403", "Soroti - Katakwi-Moroto- Lokiutonyala", "304,489,027"], ["", "", "RM01", "Road maintenance", "78,091,473"], ["", "", "", "", ""], ["1554", "Nakalama-Tirinyi- Mbale road", "1274", "Musita-Lumino-Busia (104km)", "1,493,798,576"], ["", "", "1510", "UNRA Retooling Project", "40,189,117"], ["", "", "RM01", "Road maintenance", "34,610,883"], ["", "", "", "", ""], ["**TOTAL SUM**", "", "", "", "**288,713,825,335**"]], "page": 48}, {"type": "heading", "level": 3, "content": "Appendix 2(ii): Mischarge and diversion on URF Maintenance Funds", "page": 49}, {"type": "table", "content": [["**Invoice Number**", "**Description**", "**Item code charged**", "**Correct code to be charged**", "**Payment Date**", "**Distribution Amount**", "**Supplier**", "**Item code**"], ["RM01020080 839", "City tyres partial payment of Inv CTSCR11854 supply of plant and vehicle tyres", "Maintenance - Civil", "Maintenance- Vehicles", "23-Jun-20", "196,744,068", "City Tyres", "228001"], ["RM01020080 839", "City tyres partial payment of Inv CTSCR11854 supply of plant and vehicle tyres", "Maintenance - Civil", "Maintenance- Vehicles", "23-Jun-20", "35,413,932", "City Tyres", "228001"], ["RM01022010 00533", "Payment in respect of advance for transferring records of Accounts to Namugongo", "Cleaning and sanitation", "Allowance", "4-Nov-19", "170,000", "ALOYSIUS MUGALU OPTA", "224004"], ["RM01092003 0122", "Ultimate images Inv 402 for photography and video coverage", "Welfare and Entertainment", "Advertising and public relations", "13-Mar-20", "356,949", "ULTIMATE IMAGES", "221009"], ["RM01020060 833", "City Oil Inv CTLC097 Provision of lubricants", "Maintenance - Civil", "Fuel and lubrications", "23-Jun-20", "178,840,677", "City Oil", "228001"], ["RM01082012 00077", "Yawe- 1NOA 1SDA Allowances for Trouble shooting problem of intermittent power supply for Kyoga 2 Ferry", "URF Axle load", "Ferry services", "10-Dec-19", "115,000", "JOSEPH YAWE", "45105"], ["RM01082012 00250", "Ssekidde- 10NOA 1SDA Allows for inspection team to undertake seaworthiness for all UNRA Ferries", "URF Axle load", "Ferry services", "23-Dec-19", "1,015,000", "RICHARD SSEKIDDE", "45105"], ["RM01082002 00653", "Owokuhisa- 5NOA 1SDA Allows for Central and Eastern region civil projects inspection and supervision", "Ferry services", "Monitoring and Capacity Building Support", "25-Feb-20", "1,025,000", "NOEL OWOKUHIS A", "45106"]], "page": 49}, {"type": "table", "content": [["RM01082011 00453", "Nyanzi- 2NOA 1SDA Allowance for facilitation for peer audits", "URF Axle load", "GoU finance and adminsitration", "15-Nov-19", "420,000", "RONALD NYANZI UNRA/16/1 002", "45105"], ["RM01082012 00243", "Oloya- 3NOA 1SDA Allows for training of UNRA Staff on maintenance of crane lifting equipment", "Ferry services", "Monitoring and Capacity Building Support", "23-Dec-19", "315,000", "FRANCIS OLOYA", "45106"], ["RM01082060 00319", "Tumwebaze- Payment in respect of  Airticket refund for 3rd Global ministerial conference on Road Safety in Sweden 17th-20th Feb 2020 USD 3809@3729.83", "Ferry services", "GoU finance and adminsitration", "23-Jun-20", "14,206,922", "REUBEN TUMWEBAZ E BYARUHAN GA", "45106"], ["RM01072060 00862", "14NOA 1SDA Travel for georeferencing of bottlenecks on Road Network", "URF Axle load", "Unra support services", "26-Jun-20", "2,825,000", "NAMAYANJ A ESSY", "45105"], ["RM01082011 00259", "Turyasingura- 2NOA Allows for survey works at Rwentobo UNRA Road Camp", "URF Axle load", "Unra support services", "11-Nov-19", "400,000", "TIMOTHY TURYASIN GURA", "45105"], ["RM01072060 00865", "14NOA 1SDA Travel for georeferencing of bottlenecks on Road Network", "URF Axle load", "Unra support services", "26-Jun-20", "855,000", "PAUL SSETIMBA EUGENE", "45105"], ["RM01082012 00076", "Mafabi- 1NOA 1SDA Allowances for Trouble shooting problem of intermittent power supply for Kyoga 2 Ferry", "URF Axle load", "Ferry services", "10-Dec-19", "220,000", "JOSHUA MAFABI", "45105"], ["RM01022004 00099", "Adebua- Payment in respect of pending allowance for Travel for supply,  installation, monitoring, maintenance and support of  tracking system", "URF Axle load", "Monitoring and Capacity Building Support", "4-May-20", "2,025,000", "Adebua Samuel 761681", "45105"]], "page": 50}, {"type": "table", "content": [["", "North, North East and Eastern FEB 2020", "", "", "", "", "", ""], ["RM01082060 0033", "Byaruhanga- ravel abroad allowances for 3rd Global Ministerial Conference on Road Safety in Sweden 17th-20th Feb 2020 (Paid USD 2,450@ 3,757.63-Perdiem and inland travel; pending airticket and visa USD 4067", "Ferry services", "GoU finance and adminsitration", "17-Jun-20", "9,206,194", "REUBEN TUMWEBAZ E BYARUHAN GA", "45106"], ["**Total**", "", "", "", "", "**444,153,742**", "", ""]], "page": 51}, {"type": "heading", "level": 3, "content": "Appendix 3 Nugatory expenditure: Interest on delayed payments", "page": 52}, {"type": "table", "content": [["**S/No**", "**Project /Description /Purpose**", "**Amount (UGX)**"], ["1", "Term maintenance of Iganga Bulopa Kamuli", "265,004,832"], ["2", "Term maintenance of Kamuli Kaliro", "161,596,572"], ["3", "Term maintenance of Muyembe Namalu", "75,914,907"], ["4", "Supply, delivery and commissioning of a landing craft ferry for Sigulu Islands", "185,514,734"], ["5", "SPENCON JV STIRLING- INTEREST ON DELAYED PAYMENTS - NAMANVE INDUSTRIAL PARK ACCESS ROADS", "13,908,448"], ["6", "WHT Spencon - Stirling Joint Venture- Interest on delayed payment(F) $4,095.23@ 3,713.21", "15,206,441"], ["7", "China Wuyi Interest on Ipc 05-07 Nansana Busunju", "18,998,260"], ["8", "The Arab Contractors Interest IPC 01L for Lot 1 & Interest IPC 01L for Lot2 -Tirinyi - Pallisa Kumi kamonkoli code 1281", "33,765,381"], ["9", "China State Construction Engineering Corporation-Interest on delayed payments in respect to IPC No.13-Bumbobi-Lwakhakha road", "38,164,697"], ["10", "Interest on delayed payment of IPC 02-Civil works on Mbarara bypass access road to Nyakakoni junction", "43,380,763"], ["11", "SPENCON JV STIRLING- INTEREST ON DELAYED PAYMENTS - NAMANVE INDUSTRIAL PARK ACCESS ROADS", "77,269,156"], ["12", "CHINA RAILWAY N0. 5 ENGINEERING GROUP CO. LIMITED-IPC No.21B-Interest on delayed payment in respect to Bulima-Kabwoya civil works", "78,401,352"], ["13", "China Wu Yi's Interest IPC 13B USD 22,091.94 & 18B USD 4,039.50 +charges USD 35 @ 3,706.13 Kyenjojo Fort Portal", "96,976,228"], ["14", "The Arab Contractors Interest IPC 01L for Lot 1 & Interest IPC 01L for Lot2 -Tirinyi - Pallisa Kumi kamonkoli code 1281", "187,585,449"], ["15", "China State Construction Engineering Corporation-Interest on delayed payments in respect to IPC No.13-Bumbobi-Lwakhakha road", "212,026,096"], ["16", "Interest on delayed payment of IPC 02-Civil works on Mbarara bypass access road to Nyakakoni junction", "241,004,238"], ["17", "Spencon - Stirling Joint Venture- Interest on delayed payment(F) $64,158.57 +$35 @ 3,800", "243,935,573"], ["18", "IPC 13-Interest on delayed payment-USD 62,089.50+USD 35@4000-Civil works on Bumbobi Lwakhakha", "248,498,000"], ["19", "ENERGO'S Interest on delayed payment Final payment Certificate Mpigi Kanoni", "441,492,090"], ["20", "China Communications Construction Co. Domestic arrears IPC 28 balance, interest IPC 23 to 27 and price adjustment IPC 25 to 27 USD 120,615.79 + $ 35 @ 3,800 works on Kampala Expressway", "458,472,996"], ["21", "China Wu Yi's Interest IPC 13B UGX 306,256,402 & 18B UGX 183,030,044. Kyenjojo Fort Portal", "489,286,446"], ["22", "China Wu Yi Interest Certificate 3( 15,465,604 ) and Interest Certificate 2( 616,878,062 ) Fortportal Hima Road", "632,343,666"], ["23", "Interest cert no5L-Mukono Kayunga Njeru", "671,958,371"], ["24", "Interest certifiate no5-USD 205,710+USD 35@3857.31- Mukono Kayunga Njeru", "772,401,707"], ["25", "CCCC Interest 1 USD 232,283.32 + $ 35 @3,800 Kamdin Gulu", "882,809,616"], ["26", "China Communications Construction Co. Domestic arrears IPC 28 balance, interest IPC 23 to 27 and price adjustment IPC 25 - 27 for works on Kampala Entebbe Expressway", "101,997,060"], ["27", "The Arab Contractors lot 1 IPCs 11F,12F,13F,14F & Interest 01F and lot 2 IPCs 11F,12F,13F and Interest 01F Total USD 2,323,026.58 Plus bank charges USD35 @", "166,845,192"]], "page": 52}, {"type": "table", "content": [["", "3706.13 - Code 1281 Tirinyi Pallisa Kumi Kamonkoli Road", ""], ["28", "CRN3 Hima Katunguru Forex IPC 12 interest, IPC 12,13,14,15, interest on IPC 12 is UGX 121,217,815 and USD 7,556.09", "149,221,667"], ["29", "CHINA WU YI's IPC 19L,20L,21L & 21BL UGX 795,106,549 Civil works Kyenjojo-Fort Portal road interest on IPC 14 AND 15", "54,425,219"], ["30", "term maintenance of unpaved roads lot 14, Panyimuri-Erusi-Goli-Paidha (61km), Paidha-Anyavu(65Km) and Anyavu- Vurra (27Km)", "251,005,143"], ["", "**Total**", "**7,309,410,300**"]], "page": 53}]